{
  "STSI": [
    {
      "id": 32990,
      "title": "Process Engineer - CFD, SNCR, SCR",
      "isOpen": true,
      "status": "Open",
      "dateAdded": 1748364550000,
      "dateLastModified": 1756518689613,
      "clientCorporation": {
        "id": 32570,
        "name": "Fuel Tech Inc."
      },
      "clientContact": {
        "id": 1470554,
        "firstName": "Maureen",
        "lastName": "Kennedy"
      },
      "description": "Process EngineerRemotePay Range: $100,000-$150,000/yr.Benefits: Access to Client Full Benefits Package\nPosition Overview \nThis is a technical individual contributor role within the Process Engineering department and recognized for its expertise within the organization. May use sophisticated computer tools and scientific methods to assist with analyses. Properly documents the technical basis for the analysis and prepares comprehensive reports or white papers that clearly communicate the results. Consistently high-quality independent work is expected.\nPrimary Responsibilities\n\nProvides process design and technical support for products including Selective Non-Catalytic Reduction (SNCR), Selective Catalytic Reduction (SCR), and water treatment technology.\nUses Computation Fluid Dynamics (CFD) Flow Modeling to optimize and confirm designs.\nGathers and analyzes data, formulates a resolution plan and executes the plan to produce the desired outcome; seeks technical support of peers and industry experts as required.\nUses customer data and specifications as a framework to create and optimize process designs.\nRecognizes when additional data is required and can assess the risk of proceeding with missing data.\nPushes the boundaries of designs to create a competitive edge for client while quantifying the risks associated.\nAssesses the viability of different injection strategies to control pollutants.\nAssesses plant layouts and equipment for applicability of technology and can create visuals to show changes required for successful implementation.\nUtilizes computer tools, spreadsheets, graphics, design tables, databases and other methods to produce viable, creative solutions.\nMaintains thorough understanding of technologies, engineering methods, procedures, and materials required in the execution of those technologies.\nFollows engineering standards, design basis, accepted industry practices, quality verification of work product and related technical and administrative control procedures.\nSeeks ways to continuously improve the products and/or reduce costs.\nPrepares reports, procedure manuals, white papers and reporting tools as required to keep the company apprised of key metrics.\nPresents information and responds to questions from peers, clients, senior management, regulators and external engineering professionals and vendors.\nAdheres to policies, procedures, safety and quality programs, company objectives, and core values.\nMaintains awareness of technical developments in the industry related to technologies and adopts technology as appropriate.\nMaintains relationships with key vendors to facilitate design iterations.\nDoes not directly supervise employees.\n\n\nWe are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.\n\nEducation and Experience\n\nRequires a BS and MS in Science or Engineering; a Doctorate in a related topic and/or a PE License is desirable.\nProven proficiency with the given disciplines of the position and experience with utility boilers, industrial furnaces and related equipment is essential.\nRequires a minimum of 10 years of demonstrated SNCR, SCR, or water treatment experience.\n\nKnowledge: \n\nKnowledge of scientific principles, methods and their application to practical process problems.\nStrong engineering skills and ability to use complicated spreadsheets and computer tools to solve assigned projects.\nFamiliar with the operation practices within power plants and industrial boilers.\nWorks with minimal supervision and oversight and is able to make technical decisions.\nGenerates creative solutions, demonstrates attention to detail, identifies and resolves complex technical problems in a timely manner.\nReads, analyzes and interprets technical data and information.\n\nSkills: \n\nFamiliar with Detailed Structural Drawings, Process Flow Diagrams (PFD), Logic Diagrams, and other engineering documentation.\nComputational Fluid Dynamics (CFD) modeling experience is preferred but not required.\nCAD experience preferred but not required.\nAbility to read, analyze and interpret technical data and information.\nStrong computer skills.\nAbility to write reports, business correspondence, and procedure manuals.\nPresents information and responds to questions from peers, clients, senior management, regulators and external engineering professionals and vendors.\n\nTravel Requirements:\nTravel (up to 15%) and may involve extended periods of one week in the field and/or international travel.\nOccasional work in industrial environments for short periods of time in support of field data gathering, troubleshooting, and new process implementation.",
      "publicDescription": "<strong>Process Engineer<br>\nRemote<br>\nPay Range: $100,000-$150,000/yr.<br>\nBenefits: Access to Client Full Benefits Package</strong><br>\n<br>\n<strong>Position Overview: </strong>This is a technical individual contributor role within the Process Engineering department and recognized for its expertise within the organization. May use sophisticated computer tools and scientific methods to assist with analyses. Properly documents the technical basis for the analysis and prepares comprehensive reports or white papers that clearly communicate the results. Consistently high-quality independent work is expected. Primary Responsibilities:\n<ul>\n\t<li>Provides process design and technical support for products including <strong>Selective Non-Catalytic Reduction (SNCR), Selective Catalytic Reduction (SCR), and water treatment technology. Uses Computation Fluid Dynamics (CFD)</strong> Flow Modeling to optimize and confirm designs.\n\t<li>Gathers and analyzes data, formulates a resolution plan and executes the plan to produce the desired outcome; seeks technical support of peers and industry experts as required.\n\t<li>Uses customer data and specifications as a framework to create and optimize process designs.\n\t<li>Recognizes when additional data is required and can assess the risk of proceeding with missing data.\n\t<li>Pushes the boundaries of designs to create a competitive edge for client while quantifying the risks associated.\n\t<li>Assesses the viability of different injection strategies to control pollutants.\n\t<li>Assesses plant layouts and equipment for applicability of technology and can create visuals to show changes required for successful implementation.\n\t<li>Utilizes computer tools, spreadsheets, graphics, design tables, databases and other methods to produce viable, creative solutions.\n\t<li>Maintains thorough understanding of technologies, engineering methods, procedures, and materials required in the execution of those technologies.\n\t<li>Follows engineering standards, design basis, accepted industry practices, quality verification of work product and related technical and administrative control procedures.\n\t<li>Seeks ways to continuously improve the products and/or reduce costs.\n\t<li>Prepares reports, procedure manuals, white papers and reporting tools as required to keep the company apprised of key metrics.\n\t<li>Presents information and responds to questions from peers, clients, senior management, regulators and external engineering professionals and vendors.\n\t<li>Adheres to policies, procedures, safety and quality programs, company objectives, and core values.\n\t<li>Maintains awareness of technical developments in the industry related to technologies and adopts technology as appropriate.\n\t<li>Maintains relationships with key vendors to facilitate design iterations.\n\t<li>Does not directly supervise employees.\n</ul>\n<u><strong>Education and Experience</strong></u>\n\n<ul>\n\t<li>Requires a BS and MS in Science or Engineering; a Doctorate in a related topic and/or a PE License is desirable.\n\t<li>Proven proficiency with the given disciplines of the position and experience with utility boilers, industrial furnaces and related equipment is essential.\n\t<li><strong><span style=\"background-color: rgb(241,196,15);\">Requires a minimum of 10 years of demonstrated SNCR, SCR, or water treatment experience</span></strong>.\n\t<li>Knowledge of scientific principles, methods and their application to practical process problems.\n\t<li>Strong engineering skills and ability to use complicated spreadsheets and computer tools to solve assigned projects.\n\t<li>Familiar with the operation practices within power plants and industrial boilers.\n\t<li>Works with minimal supervision and oversight and is able to make technical decisions.\n\t<li>Generates creative solutions, demonstrates attention to detail, identifies and resolves complex technical problems in a timely manner.\n\t<li>Reads, analyzes and interprets technical data and information.\n</ul>\n<strong>Skills:</strong> Process Flow Diagrams (PFD), Logic Diagrams, and other engineering documentation. Computational Fluid Dynamics (CFD) modeling experience is preferred but not required. CAD experience preferred but not required. Ability to read, analyze and interpret technical data and information. Strong computer skills. Ability to write reports, business correspondence, and procedure manuals. Presents information and responds to questions from peers, clients, senior management, regulators and external engineering professionals and vendors. Travel Requirements: Travel (up to 15%) and may involve extended periods of one week in the field and/or international travel. Occasional work in industrial environments for short periods of time in support of field data gathering, troubleshooting, and new process implementation.<br>\n<br>\n<em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em><br>\n ",
      "numOpenings": 1,
      "isPublic": 1,
      "address": {
        "city": "",
        "state": "IL",
        "countryName": "United States                                                   "
      },
      "employmentType": "Direct Hire",
      "salary": 0.0,
      "salaryUnit": "",
      "isDeleted": false,
      "categories": {
        "total": 0,
        "data": []
      },
      "onSite": [
        "Remote"
      ],
      "benefits": [
        "Healthcare",
        "Dental",
        "Vision",
        "Life Insurance",
        "401K"
      ],
      "bonusPackage": null,
      "degreeList": null,
      "skillList": "Chemical Process Engineering, CFD, SNCR, SCR",
      "certificationList": null,
      "owner": {
        "id": 1398291,
        "firstName": "STSI House",
        "lastName": ""
      },
      "assignedUsers": {
        "total": 1,
        "data": [
          {
            "id": 1397696,
            "firstName": "Rachel",
            "lastName": "Mann"
          }
        ]
      },
      "responseUser": {
        "id": 1397696,
        "firstName": "Rachel",
        "lastName": "Mann"
      },
      "_score": 1.0
    },
    {
      "id": 34278,
      "title": "Sr. Architect",
      "isOpen": true,
      "status": "Open",
      "dateAdded": 1756491908757,
      "dateLastModified": 1756518554627,
      "clientCorporation": {
        "id": 32576,
        "name": "Plus Group"
      },
      "clientContact": {
        "id": 1470783,
        "firstName": "Keith",
        "lastName": "Strunk"
      },
      "description": "<p><br>\n8/25 Notes</p>\n\n<p><strong><u>Sr. Architect</u></strong><br>\n-Targeting 110k-130k<br>\n-10+ years’ experience<br>\n-Registered Architect<br>\n-Open to Remote, but prefers someone local to the Cincinnati office.<br>\n-Contract to Direct after 6 months, would consider DIR if local resource.</p>\n \n\n<p><strong>Senior Architect</strong><br>\n<strong>Job Category:</strong> Architecture<br>\n<strong>Requisition Number:</strong> SENIO002291</p>\n\n<p> </p>\n\n<p><strong>Posting Details</strong><br>\nPosted: August 18, 2025<br>\nFull-Time<br>\nRemote<br>\nUnited States<br>\n </p>\n\n<p><strong>Job Details</strong></p>\n\n<p>Description</p>\n\n<p>Founded in 1975, Salas O’Brien is an employee-owned engineering and professional services firm focused on achieving impact for our clients, our team, and the world. We know that tomorrow’s requirements are today’s opportunities, and we are here to design lasting solutions for pressing challenges.</p>\n\n<p>We work across a variety of industries providing integrated engineering and consulting services. Salas O'Brien's Process and Manufacturing (P&M) business unit provides transformative solutions for pharmaceutical and industrial processes from concept to implementation. As part of ‘one’ Salas O'Brien, a multi-disciplinary engineering and architecture firm, the P&M business unit ensures a seamless, comprehensive service experience through a \"local everywhere\" approach. We integrate specialized expertise across a spectrum of markets, including:</p>\n\n<p>Pharmaceutical</p>\n\n<p>Consumer Products</p>\n\n<p>Agribusiness</p>\n\n<p>Chemical/Petrochemical</p>\n\n<p>Food and Beverage </p>\n\n<p>Material Handling & Processing</p>\n\n<p>Power & Utilities</p>\n\n<p>Process & Manufacturing</p>\n\n<p>We have dedicated team members who guide our customers through unique business needs, from start-up and commissioning to design, construction, and connecting facilities through automation and digital solutions. We are also committed to sustainability, integrating eco-friendly practices into our designs to optimize resource efficiency and environmental impact. </p>\n\n<p><strong>Job Summary:</strong></p>\n\n<p>The Architect III performs discipline responsibilities within Project and Departmental Budgets. Architect is accountable technically and administratively to the Department Manager as well as Project Managers for successfully executing the architectural group's work. Architects are expected to serve in the role of Project Discipline Lead to execute several projects of different sizes simultaneously. This position will have a focus on pharmaceutical market projects.</p>\n\n<p><strong>Job Responsibilities:</strong></p>\n\n<ul>\n\t<li>Work closely with other discipline Project Leads, Architects, Engineers and Designers to deliver technically correct and graphically complete project documents including drawings and sketches.\n\t<li>Excellent communication and teamwork skills.\n\t<li>Provide clear and concise directions to Architectural team members on projects in which the Architect serves as Project Discipline Lead.\n\t<li>Take responsibility for layout and detailing of architectural projects.\n\t<li>Independently coordinate the work of a multidiscipline team through multiple phases of a project; proactively request information needed to progress your work as well as inform others of information they need to complete their work.\n\t<li>Participate in reviews with various governing agencies for code compliance.\n\t<li>Conduct work sessions at project site in conjunction with Project Manager and other disciplines.\n\t<li>Coordinate the workload of team members through multiple phases to complete documents on schedule and within budget.\n\t<li>Prepare and update (on a weekly basis) project workplan/forecast.\n\t<li>Review architectural documents for areas of conflict with all disciplines.\n\t<li>Write and edit architectural specifications and reports.\n\t<li>Coordinate with and assist affected disciplines with construction bulletins, requests for information.\n\t<li>Review construction phase submittals.\n\t<li>Attend and lead project and discipline/department meetings as required.\n\t<li>Ensure conformance of the discipline's work with customers and Salas O’Brien standards and practices.\n\t<li>Manage the issuance of documents for quality control through the department and office. \n</ul>\n\n<p><strong>Job Requirements:</strong></p>\n\n<ul>\n\t<li><strong>Familiarity in areas of pharmaceutical projects is required.</strong>\n\t<li><strong>Fundamental mastery of Microsoft Word, Excel, Outlook, and PowerPoint.</strong>\n\t<li>Proficient with<strong> Revit and familiarity with related tools and processes.</strong>\n\t<li>The ability to produce rough sketches to communicate ideas and concepts to clients and project team.\n\t<li>Work Independently within a fast paced remote or hybrid environment.\n\t<li>Knowledgeable in Architectural details and standards. \n\t<li>Excellent verbal and written communication skills.\n\t<li>Excellent analytical and problem-solving skills.\n\t<li>Demonstrated graphic presentation skills.\n\t<li>Must have experience in preparation and layout of architectural contract documents and specifications.\n\t<li>Consumer Goods, Food & Beverage or Chemicals Industries Facilities experience a plus.\n\t<li>Comfortable with remote or hybrid work environment.\n\t<li>An attitude and commitment to being an active participant of our culture is a must. \n</ul>\n\n<p><strong>Education/Experience/Licensure:</strong></p>\n\n<ul>\n\t<li><strong>Bachelor of Science in Architecture or Master of Architecture</strong>\n\t<li><strong>Registered Architect with NCARB</strong>\n\t<li><strong>8+ years’ experience with a focus on the pharmaceutical market</strong>\n\t<li><strong>Experience in sustainable solutions</strong>\n\t<li><strong>LEED Accreditation helpful </strong>\n</ul>\n\n<p><strong>Location</strong>: United States; remote<br>\n<strong>Compensation: </strong>$100,000.00 - 120,000.00<br>\n<strong>Travel</strong>: Averages about 20% annually, travel to client sites and other work-related events as business needs dictate. Salas O’Brien is committed to keeping business travel to a reasonable nature for the execution of the business.</p>\n\n<p> <strong>Physical Requirements</strong>:</p>\n\n<ul>\n\t<li>Frequently required to sit at a desk/workstation for long periods of time.\n\t<li>Ability to work at a computer terminal for extended periods of time.\n\t<li>Light Lifting up to 20 lbs.\n\t<li>Ability to climb ladders and negotiate work areas under construction.\n\t<li>Ability to speak to and hear clients via phone or in person.\n\t<li>Body motor skills sufficient to enable incumbent to move around an office environment.\n\t<li>Ability to analyze unique situations and develop appropriate responses.\n</ul>\n",
      "publicDescription": "<p><strong>Senior Architect</strong><br>\nRemote<br>\nBenefits: Access to Benefit Package<br>\nPay Range: $110,000-$130,000</p>\n\n<p><strong><u>Summary:</u></strong><br>\nThe Architect will perform discipline responsibilities within Project and Departmental Budgets. Architect is accountable technically and administratively to the Department Manager as well as Project Managers for successfully executing the architectural group&apos;s work. Architects are expected to serve in the role of Project Discipline Lead to execute several projects of different sizes simultaneously. This position will have a focus on pharmaceutical market projects.</p>\n\n<p><strong><u>Responsibilities:</u></strong></p>\n\n<ul>\n\t<li>Work closely with other disciplines: Project Leads, Architects, Engineers and Designers to deliver technically correct and graphically complete project documents including drawings and sketches.\n\t<li>Excellent communication and teamwork skills.\n\t<li>Provide clear and concise directions to Architectural team members on projects in which the Architect serves as Project Discipline Lead.\n\t<li>Take responsibility for layout and detailing of architectural projects.\n\t<li>Independently coordinate the work of a multidiscipline team through multiple phases of a project; proactively request information needed to progress your work as well as inform others of information they need to complete their work.\n\t<li>Participate in reviews with various governing agencies for code compliance.\n\t<li>Conduct work sessions at project site in conjunction with Project Manager and other disciplines.\n\t<li>Coordinate the workload of team members through multiple phases to complete documents on schedule and within budget.\n\t<li>Prepare and update (on a weekly basis) project workplan/forecast.\n\t<li>Review architectural documents for areas of conflict with all disciplines.\n\t<li>Write and edit architectural specifications and reports.\n\t<li>Coordinate with and assist affected disciplines with construction bulletins, requests for information.\n\t<li>Review construction phase submittals.\n\t<li>Attend and lead project and discipline/department meetings as required.\n\t<li>Ensure conformance of the discipline&apos;s work with customers and Company standards and practices.\n\t<li>Manage the issuance of documents for quality control through the department and office.\n</ul>\n\n<p><strong><u>Requirements:</u></strong></p>\n\n<ul>\n\t<li><strong>Bachelor of Science in Architecture or Master of Architecture</strong>\n\t<li><strong>Registered Architect with NCARB</strong>\n\t<li><strong>8+ years’ experience with a focus on the pharmaceutical market</strong>\n\t<li><strong>Experience in sustainable solutions</strong>\n\t<li><strong>LEED Accreditation helpful </strong>\n\t<li>Familiarity in areas of pharmaceutical projects is required.\n\t<li>Fundamental mastery of Microsoft Word, Excel, Outlook, and PowerPoint.\n\t<li>Proficient with Revit and familiarity with related tools and processes.\n\t<li>The ability to produce rough sketches to communicate ideas and concepts to clients and project team.\n\t<li>Work Independently within a fast paced remote or hybrid environment.\n\t<li>Knowledgeable in Architectural details and standards.\n\t<li>Excellent verbal and written communication skills.\n\t<li>Excellent analytical and problem-solving skills.\n\t<li>Demonstrated graphic presentation skills.\n\t<li>Must have experience in preparation and layout of architectural contract documents and specifications.\n\t<li>Consumer Goods, Food & Beverage or Chemicals Industries Facilities experience a plus.\n\t<li>Comfortable with remote or hybrid work environment.\n\t<li>An attitude and commitment to being an active participant of our culture is a must.\n</ul>\n\n<p><em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "numOpenings": 1,
      "isPublic": 1,
      "address": {
        "city": null,
        "state": "OH",
        "countryName": "United States                                                   "
      },
      "employmentType": "Contract to Hire",
      "salary": 0.0,
      "salaryUnit": "Per Hour",
      "isDeleted": false,
      "categories": {
        "total": 1,
        "data": [
          {
            "id": 2000003,
            "name": "Architecture"
          }
        ]
      },
      "onSite": [
        "Remote"
      ],
      "benefits": [
        "Healthcare",
        "Dental",
        "Vision",
        "Life Insurance",
        "Long-term Disability"
      ],
      "bonusPackage": null,
      "degreeList": null,
      "skillList": "Lead Architect, rough sketch, architectural details, codes, standards, project documentation, pharmaceutical",
      "certificationList": "LEED, Registered Architect, NCARB",
      "owner": {
        "id": 1397694,
        "firstName": "Ryan",
        "lastName": "Oliver"
      },
      "assignedUsers": {
        "total": 1,
        "data": [
          {
            "id": 1397696,
            "firstName": "Rachel",
            "lastName": "Mann"
          }
        ]
      },
      "responseUser": {
        "id": 1397696,
        "firstName": "Rachel",
        "lastName": "Mann"
      },
      "_score": 1.0
    },
    {
      "id": 34276,
      "title": "Site Management Supervisor",
      "isOpen": true,
      "status": "Open",
      "dateAdded": 1756486235910,
      "dateLastModified": 1756518494203,
      "clientCorporation": {
        "id": 32594,
        "name": "Agile One/Jacobs Engineering"
      },
      "clientContact": {
        "id": 1473796,
        "firstName": "Tony",
        "lastName": "Morrissey"
      },
      "description": "<strong>8/26 - valid DL required; does not need to be CDL (td)</strong><br>\n<br>\nKEYS<br>\n<br>\nColorado Class A Wastewater License is Required<br>\nDriver's license no major infractions<br>\nVehicle included with paid fuel<br>\nMUST be located within an hour of Winter Park CO<br>\nTravel 10%<br>\n6 years' experience in industrial water/wastewater treatment facility, or municipal water/wastewater facility public works operation, including experience in project management with responsibility for technical support and financial accountability <br>\n<br>\n<strong>Qualifications:</strong>\n<pre>\nCandidate must have a Level “A” wastewater license for the state of Colorado.\nHigh school diploma\n6 years of experience at an industrial water/wastewater treatment facility, or municipal water/wastewater facility public works operation, including experience in project management with responsibility for technical support and financial accountability or 6 years working in a related field.\nUnderstanding of industrial operations including basic fluid flow, process equipment, and control instrumentation.\nThree years of experience at a supervisory level.\nAbility to travel 10% of the time.\nPossess a valid driver’s license with no major infractions.\nProficient with computer software including but not limited to Microsoft Suite (Word, Excel, Power Point, Outlook, Teams), PDF software, etc. Ability to perform daily computer skills managing various client software programs, SCADA, and data entry.\nPossess sufficient virtual communication skills to successfully maintain operations and regulatory compliance while located remote from client sites.\nCandidate needs to be able to read, understand, and abide by Industrial Regulations and Standards.\nCandidate needs to be able to read, understand, abide by, and guide their team in compliance with client safety, quality, and other requirements.\nCandidate must live in Winter Park, CO, or a nearby community\n</pre>\n<strong>Responsibilities:</strong>\n\n<pre>\n- Manage staff for two locations in Colorado for a private-sector industrial client.\n- Organize and direct all onsite contract operations teams (projects) within the assigned portfolio.\nProvide clients with effective performance in compliance with local, state, and federal regulatory agency water quality permit requirements.\nCreate a safe work culture and ensure safe work practices are followed by all staff.\nMaintain assigned sites in Operational and Regulatory compliance.\nProvide support, mentoring, training, and leadership to assure the highest possible effort on the part of onsite managers, local staff, and operators in the region.\nEnsure staff stays on task and completes job related duties.\nAssure personnel compliance with corporate reporting systems and customer reporting systems.\nLead O&M personnel development and training program to drive professional advancement within the organization.\nImplement O&M training programs to develop all levels of associates at regional sites, recommend new training requirements, undertake to advance professional skills, mentor new project managers and members of the contract operating teams with a written plan.\nAssure the implementation of all required training programs and performance reviews for new and existing projects.\nLead O&M Safety, Maintenance, Process Control, cost/savings, process optimization, and Sustainability efforts in the assigned portfolio.\nParticipate in the selection, assignment, and orientation of all onsite supervisors and motivate extraordinary, self-starting effort by onsite supervisors.\nSupport affirmative action and diversity efforts in the assigned portfolio ·\nAssure O&M management of the proper execution of job performance interviews and in the continuing communication of management policies to all personnel.\nDevelop all of the technical skills to function as an onsite manager and are prepared to perform these functions during project start up as well as during emergency situations.\nVerify and complete all job-related documents and reports.\nMaintain quality of operations and deliverables at the levels expected by client and by Jacobs, including achievement of Key Performance Indicators (KPI) where applicable.\nFrequently travel to sites for Client meetings, Inspections, and Operational Compliance.\nProvide support with business development of contract operations and other efforts.\nReport on all competitive contract services sales efforts and advises marketing personnel of these efforts and prepare other reports and presentations as required.\nProvide primary client relationship with client management and technical personnel and report regularly as to client confidence, satisfaction, and/or problems.\nReview monthly contract service reports for each installation, advising management as to project status, regulatory agency permit compliance, and technical/plant management attitudes.\nSupport regional personnel with the handling of local problems and in the development of client relations strategies to assure successful on-going business at each site.\nDevelop budgets and assist in the preparation of operations strategies to achieve compliance with regulatory agency requirements and O&M corporate objectives.\nReview all monthly project reports and utilize these materials to more effectively manage O&M client services and to assure O&M's compliance with all contract provisions and client understanding and satisfaction of services rendered.\nActively participate in regional and local professional groups, and reports on any technology or service advancements desired by local groups and/or O&M clients.\n</pre>\n<strong>Comments/Special Instructions</strong>\n\n<pre>\nThis position comes with a company vehicle and paid fuel. Must be located within an hour of the Winter Park, CO area.\n</pre>\n<strong>Attached Documentation:</strong>\n\n<table cellpadding=\"0\" cellspacing=\"0\" id=\"ctl00_CPH_ucJobDocumentView_dg\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td><a href=\"https://ag.agile1.com/tech/Common/Page/FileDownload.aspx?q=3l5Hf0w6mYYoHGBnT4GSVRl-o9aRO4AHPKXXhg8DWtYNXT1j8UcCo0ub3PU3Fe250\" id=\"ctl00_CPH_ucJobDocumentView_dg_ctl02_lnk\" target=\"_blank\">Job Description</a></td>\n\t\t\t<td>Job Description</td>\n\t\t\t<td><img alt=\"active\" src=\"https://ag.agile1.com/tech/Images/SVG/icons/ico_uncheck_2.svg\"></td>\n\t\t\t<td>8/26/2025 10:49 AM (EST)</td>\n\t\t\t<td>Kyle Burden</td>\n\t\t</tr>\n\t</tbody>\n</table>\n<br>\nRequestor & Work Location\n<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" style=\"width: 100.0%;\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td>Requested by:</td>\n\t\t\t<td>Kyle Burden</td>\n\t\t\t<td>Alternate:</td>\n\t\t\t<td>Kyle Burden</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Report To:</td>\n\t\t\t<td>Kyle Burden</td>\n\t\t\t<td> </td>\n\t\t\t<td> </td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Phone:</td>\n\t\t\t<td>402-960-9912   Ext.:</td>\n\t\t\t<td> </td>\n\t\t\t<td> </td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Travel Required:</td>\n\t\t\t<td> </td>\n\t\t\t<td>How Much Travel?</td>\n\t\t\t<td>10%</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Report To Manager's Office Address</td>\n\t\t\t<td colspan=\"3\">717 17th Street, Denver, CO 80202 United States</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Start Date:</td>\n\t\t\t<td>9/15/2025</td>\n\t\t\t<td rowspan=\"2\">Work Days:</td>\n\t\t\t<td rowspan=\"2\">\n\t\t\t<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" id=\"t_SunToSat\" style=\"width: 100.0%;\">\n\t\t\t\t<tbody>\n\t\t\t\t\t<tr>\n\t\t\t\t\t\t<td>Sun</td>\n\t\t\t\t\t\t<td>Mon</td>\n\t\t\t\t\t\t<td>Tue</td>\n\t\t\t\t\t\t<td>Wed</td>\n\t\t\t\t\t\t<td>Thu</td>\n\t\t\t\t\t\t<td>Fri</td>\n\t\t\t\t\t\t<td>Sat</td>\n\t\t\t\t\t</tr>\n\t\t\t\t</tbody>\n\t\t\t</table>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>End Date:</td>\n\t\t\t<td>9/30/2028</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Start Time:</td>\n\t\t\t<td>7:00 AM</td>\n\t\t\t<td>Total Reg Hours:</td>\n\t\t\t<td>40.00</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>End Time:</td>\n\t\t\t<td>3:30 PM</td>\n\t\t\t<td>Overtime Required:</td>\n\t\t\t<td> </td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Lunch Time:</td>\n\t\t\t<td>30 Minutes</td>\n\t\t\t<td> </td>\n\t\t\t<td> </td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Exempt:</td>\n\t\t\t<td> </td>\n\t\t\t<td>Open Bid:</td>\n\t\t\t<td> </td>\n\t\t</tr>\n\t</tbody>\n</table>\n \n\n<table id=\"tblRates\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td>Pay Type:</td>\n\t\t\t<td>Hourly</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Pay Rate (Min-Max):</td>\n\t\t\t<td>USD 57.69 /hr - USD 72.11 /hr</td>\n\t\t</tr>\n\t</tbody>\n</table>\n<br>\n ",
      "publicDescription": "<p><strong>Site Management Supervisor</strong><br>\nLocation: Denver, CO / Hybrid</p>\n\n<p>Rate: $57.69-$72.11/hr.<br>\nBenefits: Medical, Dental, & Vision</p>\n\n<p>**** This position includes a company vehicle with paid fuel. Candidate must be located within an hour of the Winter Park, CO area.</p>\n\n<p><strong>Qualifications:</strong></p>\n\n<ul>\n\t<li>Candidate must have a Level “A” wastewater license for the state of Colorado.\n\t<li>High school diploma.\n\t<li>6 years’ experience at an industrial water/wastewater treatment facility, or municipal water/wastewater facility public works operation, including experience in project management with responsibility for technical support and financial accountability or 6 years working in a related field.\n\t<li>Understanding of industrial operations including basic fluid flow, process equipment, and control instrumentation.\n\t<li>Three years of experience at a supervisory level.\n\t<li>Ability to travel 10% of the time.\n\t<li>Possess a valid driver’s license with no major infractions.\n\t<li>Proficient with computer software including Microsoft Suite (Word, Excel, Power Point, Outlook, Teams), PDF software, etc.\n\t<li>Ability to perform daily computer skills managing various client software programs, SCADA, and data entry.\n\t<li>Possess sufficient virtual communication skills to successfully maintain operations and regulatory compliance while located remote from client sites.\n\t<li>Candidate needs to be able to read, understand, and abide by Industrial Regulations and Standards.\n\t<li>Candidate needs to be able to read, understand, abide by, and guide their team in compliance with client safety, quality, and other requirements.\n\t<li>Candidate must live in Winter Park, CO, or a nearby community\n</ul>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n\t<li>Manage staff for two locations in Colorado for a private-sector industrial client.\n\t<li>Organize and direct all onsite contract operations teams (projects) within the assigned portfolio.\n\t<li>Provide clients with effective performance in compliance with local, state, and federal regulatory agency water quality permit requirements.\n\t<li>Create a safe work culture and ensure safe work practices are followed by all staff.\n\t<li>Maintain assigned sites in Operational and Regulatory compliance.\n\t<li>Provide support, mentoring, training, and leadership to assure the highest possible effort on the part of onsite managers, local staff, and operators in the region.\n\t<li>Ensure staff stays on task and completes job related duties.\n\t<li>Assure personnel compliance with corporate reporting systems and customer reporting systems.\n\t<li>Lead O&M personnel development and training program to drive professional advancement within the organization.\n\t<li>Implement O&M training programs to develop all levels of associates at regional sites, recommend new training requirements, undertake to advance professional skills, mentor new project managers and members of the contract operating teams with a written plan.\n\t<li>Assure the implementation of all required training programs and performance reviews for new and existing projects.\n\t<li>Lead O&M Safety, Maintenance, Process Control, cost/savings, process optimization, and Sustainability efforts in the assigned portfolio.\n\t<li>Participate in the selection, assignment, and orientation of all onsite supervisors and motivate extraordinary, self-starting effort by onsite supervisors.\n\t<li>Support affirmative action and diversity efforts in the assigned portfolio.\n\t<li>Assure O&M management of the proper execution of job performance interviews and in the continuing communication of management policies to all personnel.\n\t<li>Develop all of the technical skills to function as an onsite manager and are prepared to perform these functions during project start up as well as during emergency situations.\n\t<li>Verify and complete all job-related documents and reports.\n\t<li>Maintain quality of operations and deliverables at the levels expected by client, including achievement of Key Performance Indicators (KPI) where applicable.\n\t<li>Frequently travel to sites for Client meetings, Inspections, and Operational Compliance.\n\t<li>Provide support with business development of contract operations and other efforts.\n\t<li>Report on all competitive contract services sales efforts and advises marketing personnel of these efforts and prepare other reports and presentations as required.\n\t<li>Provide primary client relationship with client management and technical personnel and report regularly as to client confidence, satisfaction, and/or problems.\n\t<li>Review monthly contract service reports for each installation, advising management as to project status, regulatory agency permit compliance, and technical/plant management attitudes.\n\t<li>Support regional personnel with the handling of local problems and in the development of client relations strategies to assure successful on-going business at each site.\n\t<li>Develop budgets and assist in the preparation of operations strategies to achieve compliance with regulatory agency requirements and O&M corporate objectives.\n\t<li>Review all monthly project reports and utilize these materials to more effectively manage O&M client services and to assure O&M&apos;s compliance with all contract provisions and client understanding and satisfaction of services rendered.\n\t<li>Actively participate in regional and local professional groups, and reports on any technology or service advancements desired by local groups and/or O&M clients.\n</ul>\n\n<p><em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "numOpenings": 1,
      "isPublic": 1,
      "address": {
        "city": "Denver",
        "state": "CO",
        "countryName": "United States                                                   "
      },
      "employmentType": "Contract to Hire",
      "salary": 0.0,
      "salaryUnit": "",
      "isDeleted": false,
      "categories": {
        "total": 0,
        "data": []
      },
      "onSite": [
        "Hybrid"
      ],
      "benefits": [
        "Healthcare",
        "Dental",
        "Vision"
      ],
      "bonusPackage": "Company vehicle with paid fuel",
      "degreeList": null,
      "skillList": null,
      "certificationList": "Level A Wastewater License - Colorado",
      "owner": {
        "id": 1475434,
        "firstName": "Tarra",
        "lastName": "Dziurman"
      },
      "assignedUsers": {
        "total": 1,
        "data": [
          {
            "id": 1475434,
            "firstName": "Tarra",
            "lastName": "Dziurman"
          }
        ]
      },
      "responseUser": {
        "id": 1475434,
        "firstName": "Tarra",
        "lastName": "Dziurman"
      },
      "_score": 1.0
    },
    {
      "id": 34274,
      "title": "Senior Electrical Engineer, Pharma",
      "isOpen": true,
      "status": "Open",
      "dateAdded": 1756483504557,
      "dateLastModified": 1756518432970,
      "clientCorporation": {
        "id": 32594,
        "name": "Agile One/Jacobs Engineering"
      },
      "clientContact": {
        "id": 1473796,
        "firstName": "Tony",
        "lastName": "Morrissey"
      },
      "description": "<p><strong>8/20 - Message: Hybrid schedule is 2 days in the office, 3 days at home. Time onsite counts as in office.</strong></p>\n\n<p><strong>Comments/Special Instructions</strong></p>\n\n<pre>\nPE strongly desired or ability to obtain within a year.\nUS citizenship required.\nRelocation costs would be considered for the right candidate.\nInitial interview via Teams with in person follow up if deemed necessary.\n</pre>\n\n<p>Hybrid - at least 2 days in office </p>\n\n<p>As a <strong>Senior Electrical Engineer in </strong>Indianapolis, IN, you’ll need a passion for contributing to projects that enable the heart of our clients’ manufacturing. Join us and you will have the chance to work on projects including state of the art pharmaceutical facilities. You’ll oversee designer work, provide team technical leadership, perform quality reviews of design packages and assist directly with the more complex portions of the design process. You’ll also interact directly with the client, owner, and contractors to assist construction on site. You and the other members of your team will work closely with client owners in a fast paced, dynamic environment to establish design requirements and produce construction documents. You will also have the chance to utilize your technical expertise to mentor other professionals, helping your team discover what drives them, nurturing their purpose and guiding them forward.</p>\n\n<p>Your responsibilities will include:</p>\n\n<ul>\n\t<li>Engineering and design oversight for medium and low voltage power distribution, UPS/Generators, Lighting, Grounding, Fire Alarm, Security, Public Address (PA), Telecomm and Heat Trace systems.\n\t<li>Evaluate the desired goal of the system and develop, design, or select the required equipment or power/controls to achieve the goal.\n\t<li>Perform calculations and evaluations in the design of equipment and systems for industrial applications.\n\t<li>Direct activities to ensure that construction, installation, and operational testing conform to functional specifications, recognized codes and standards, and customer requirements\n\t<li>Maintains effective communication with project team members and with the customer\n\t<li>Use computer-assisted engineering and design software and equipment to perform engineering tasks.\n</ul>\n\n<p> </p>\n\n<p>With your solid understanding of all phases of construction document production and the relationship between drawings and specifications, you will prepare technical specifications and documents for bidding and construction and will be our Electrical discipline lead or Quality Control reviewer in project meetings. You will participate in project proposals and will suggest solutions to our clients to problems they didn’t even knew they had. </p>\n\n<p> </p>\n\n<p>Bring your curiosity, talent for multi-tasking and collaboration, and extreme organizational skills and we’ll help you grow, pursue and fulfill what drives you – so we can make big impacts on the world, together. </p>\n\n<p>Here is what you’ll need: </p>\n\n<ul>\n\t<li>Bachelor's or Master of Science Degree in Electrical Engineering from accredited program\n\t<li>Professional Engineer license in IN or ability to obtain\n\t<li>At least 15 years of experience in electrical engineering design of buildings\n\t<li>Solid working knowledge of NFPA 70 (NEC) \n\t<li>Ability to perform power system studies including short circuit, load flow, protective coordination, and arc flash\n\t<li>Provide leadership, guidance, and instruction to less experienced staff members\n\t<li>Excellent written & verbal communication skills\n\t<li>Strong analytical and problem solving skills\n\t<li>Must be capable of devising new approaches to problems encountered\n</ul>\n\n<p>Ideally, you’ll also have: </p>\n\n<ul>\n\t<li>Life Science and/or advanced manufacturing facility electrical design experience\n\t<li>Working knowledge of ACAD, Revit or BIM software\n\t<li>Power system studies software (ETAP, SKM, EasyPower)\n\t<li>Forward thinking, eager to learn best practices, and contribute with innovative ideas \n\t<li>Displayed ability to learn quickly and driven to broaden knowledge base \n\t<li>Ability to collaborate and work effectively in a variety of teams, including multi-disciplinary teams \n\t<li>Passionate about buildings and construction \n</ul>\n \n\n<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" style=\"width: 100.0%;\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td>Requested by:</td>\n\t\t\t<td>Omar Martin</td>\n\t\t\t<td>Alternate:</td>\n\t\t\t<td>Michael Blake</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Report To:</td>\n\t\t\t<td>Omar Martin</td>\n\t\t\t<td> </td>\n\t\t\t<td> </td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Phone:</td>\n\t\t\t<td>+1 317 423 4885   Ext.:</td>\n\t\t\t<td> </td>\n\t\t\t<td> </td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Travel Required:</td>\n\t\t\t<td> </td>\n\t\t\t<td>How Much Travel?</td>\n\t\t\t<td>10%</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Report To Manager's Office Address</td>\n\t\t\t<td colspan=\"3\">1099 N MERIDIAN, STE 500, Indianapolis, IN 46204 United States</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Start Date:</td>\n\t\t\t<td>8/25/2025</td>\n\t\t\t<td rowspan=\"2\">Work Days:</td>\n\t\t\t<td rowspan=\"2\">\n\t\t\t<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" id=\"t_SunToSat\" style=\"width: 100.0%;\">\n\t\t\t\t<tbody>\n\t\t\t\t\t</tbody></table></td></tr><tr>\n\t\t\t\t\t\t<td>Sun</td>\n\t\t\t\t\t\t<td>Mon</td>\n\t\t\t\t\t\t<td>Tue</td>\n\t\t\t\t\t\t<td>Wed</td>\n\t\t\t\t\t\t<td>Thu</td>\n\t\t\t\t\t\t<td>Fri</td>\n\t\t\t\t\t\t<td>Sat</td>\n\t\t\t\t\t</tr>\n\t\t\t\t</tbody>\n\t\t\t</table>\n\t\t\t\n\t\t\n\t\t\n\t\t\tEnd Date:\n\t\t\t2/27/2026\n\t\t\n\t\t\n\t\t\tStart Time:\n\t\t\t8:00 AM\n\t\t\tTotal Reg Hours:\n\t\t\t42.50\n\t\t\n\t\t\n\t\t\tEnd Time:\n\t\t\t4:30 PM\n\t\t\tOvertime Required:\n\t\t\t \n\t\t\n\t\t\n\t\t\tLunch Time:\n\t\t\tNo lunch\n\t\t\n\t\n\n",
      "publicDescription": "<p><strong>Senior Electrical Engineer – Pharma<br>\nIndianapolis, IN (Hybrid)<br>\nDirect-Hire<br>\nRate: $115K-$145K<br>\nBenefits: Access to full company benefits package</strong></p>\n\n<p>As a <strong>Senior Electrical Engineer in </strong>Indianapolis, IN, you’ll need a passion for contributing to projects that enable the heart of our clients’ manufacturing. Join us and you will have the chance to work on projects including state of the art pharmaceutical facilities. You’ll oversee designer work, provide team technical leadership, perform quality reviews of design packages and assist directly with the more complex portions of the design process. You’ll also interact directly with the client, owner, and contractors to assist construction on site. You and the other members of your team will work closely with client owners in a fast paced, dynamic environment to establish design requirements and produce construction documents. You will also have the chance to utilize your technical expertise to mentor other professionals, helping your team discover what drives them, nurturing their purpose and guiding them forward.</p>\n\n<p>Your responsibilities will include:</p>\n\n<ul>\n\t<li>Engineering and design oversight for medium and low voltage power distribution, UPS/Generators, Lighting, Grounding, Fire Alarm, Security, Public Address (PA), Telecomm and Heat Trace systems.\n\t<li>Evaluate the desired goal of the system and develop, design, or select the required equipment or power/controls to achieve the goal.\n\t<li>Perform calculations and evaluations in the design of equipment and systems for industrial applications.\n\t<li>Direct activities to ensure that construction, installation, and operational testing conform to functional specifications, recognized codes and standards, and customer requirements\n\t<li>Maintains effective communication with project team members and with the customer\n\t<li>Use computer-assisted engineering and design software and equipment to perform engineering tasks.\n</ul>\n\n<p>With your solid understanding of all phases of construction document production and the relationship between drawings and specifications, you will prepare technical specifications and documents for bidding and construction and will be our Electrical discipline lead or Quality Control reviewer in project meetings. You will participate in project proposals and will suggest solutions to our clients to problems they didn’t even knew they had.</p>\n\n<p>Bring your curiosity, talent for multi-tasking and collaboration, and extreme organizational skills and we’ll help you grow, pursue and fulfill what drives you – so we can make big impacts on the world, together.</p>\n\n<p>Here is what you’ll need:</p>\n\n<ul>\n\t<li>Bachelor&apos;s or Master of Science Degree in Electrical Engineering from accredited program\n\t<li>Professional Engineer license in IN or ability to obtain\n\t<li>At least 15 years of experience in electrical engineering design of buildings\n\t<li>Solid working knowledge of NFPA 70 (NEC)\n\t<li>Ability to perform power system studies including short circuit, load flow, protective coordination, and arc flash\n\t<li>Provide leadership, guidance, and instruction to less experienced staff members\n\t<li>Excellent written & verbal communication skills\n\t<li>Strong analytical and problem-solving skills\n\t<li>Must be capable of devising new approaches to problems encountered\n</ul>\n\n<p>Ideally, you’ll also have:</p>\n\n<ul>\n\t<li>Life Science and/or advanced manufacturing facility electrical design experience\n\t<li>Working knowledge of ACAD, Revit or BIM software\n\t<li>Power system studies software (ETAP, SKM, EasyPower)\n\t<li>Forward thinking, eager to learn best practices, and contribute with innovative ideas\n\t<li>Displayed ability to learn quickly and driven to broaden knowledge base\n\t<li>Ability to collaborate and work effectively in a variety of teams, including multi-disciplinary teams\n\t<li>Passionate about buildings and construction\n</ul>\n\n<p> </p>\n\n<p><em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "numOpenings": 1,
      "isPublic": 1,
      "address": {
        "city": "Indianapolis",
        "state": "IN",
        "countryName": "United States                                                   "
      },
      "employmentType": "Direct Hire",
      "salary": 0.0,
      "salaryUnit": "",
      "isDeleted": false,
      "categories": {
        "total": 0,
        "data": []
      },
      "onSite": [
        "Hybrid"
      ],
      "benefits": [
        "Healthcare",
        "Dental",
        "Vision"
      ],
      "bonusPackage": null,
      "degreeList": null,
      "skillList": null,
      "certificationList": null,
      "owner": {
        "id": 1475434,
        "firstName": "Tarra",
        "lastName": "Dziurman"
      },
      "assignedUsers": {
        "total": 1,
        "data": [
          {
            "id": 1475434,
            "firstName": "Tarra",
            "lastName": "Dziurman"
          }
        ]
      },
      "responseUser": {
        "id": 1475434,
        "firstName": "Tarra",
        "lastName": "Dziurman"
      },
      "_score": 1.0
    },
    {
      "id": 34275,
      "title": "Electrical Revit Designer",
      "isOpen": true,
      "status": "Open",
      "dateAdded": 1756484757800,
      "dateLastModified": 1756518385373,
      "clientCorporation": {
        "id": 30681,
        "name": "Jedson Engineering"
      },
      "clientContact": {
        "id": 1470678,
        "firstName": "Jay",
        "lastName": "Howle"
      },
      "description": "<p><strong><u>Sr. Electrical Revit Designer</u></strong><br>\nContract, 6+ mos. - up to $65/hour (flexible based on experience)<br>\nBenefits: Standard Medical, Dental, and 401(k)<br>\nIn office: M- F<br>\nVarious offices across the USA.<br>\n-Appleton<br>\n-Cincinnati<br>\n-Kansas City<br>\n-Raleigh<br>\n-Greenville<br>\n-Salt Lake City<br>\n-Mobile<br>\n-Savannah<br>\n-Tallahassee<br>\n<br>\n<strong><u>Electrical Designer</u></strong><br>\n<u>MUST have Revit experience.</u></p>\n\n<p>Performs design task related to the layout and specification of electrical and controls systems. The designer also generates drawing packages for these systems as part of engineering design packages to the client.</p>\n\n<p>In addition to the above, provide leadership to designers. They can also take on an increasing role of ownership on electrical and controls packages and management of project tasks.</p>\n\n<p><strong><u>ESSENTIAL FUNCTIONS</u></strong></p>\n\n<p>-Designers are expected to observe professional ethics in their association with others including fellow employees, clients, and vendors</p>\n\n<p>-Reviews rough sketches, drawings, specifications, and other engineering data received from the Engineer.</p>\n\n<p>-Reviews project scope of work and notify project management of any perceived changes in scope that may appear during the design phase.</p>\n\n<p>-Reviews the design input and communicates any ambiguous, incomplete, or conflicting information to the supplier of the input for resolution (includes processing information such as vendor drawings, marked up drawings, design basis, notes, and verbal instructions).</p>\n\n<p>-Reviews design output to verify it meets design input (i.e., verify output meets design basis, design input and standard industry practices).</p>\n\n<p>-Performs work related to design changes after validated documents are issued and notify project management of any perceived changes in scope resulting from the change.</p>\n\n<p>-Conform to drafting and quality standards</p>\n\n<p>-Design electrical and control systems. Generate drawings in accordance with client design requirement for execution and productivity</p>\n\n<p>-Draw single line diagrams (SLD), elementary diagrams (ED), power distribution diagrams, grounding diagrams, lighting drawing, logic diagrams, network architecture diagrams, function diagrams, and other drawings using AutoCAD and other CAD software.</p>\n\n<p><strong><u>OTHER SKILLS AND ABILITIES</u></strong></p>\n\n<p>A high level of competency in AutoCAD is required. The ability to create, modify reference and plot drawings to client standards is key to this position. Knowledge of PDS EE Raceway, SmartPlant Electrical and/or SKM is a plus. Basic knowledge of applicable codes and standards such as NEC, ISA, NFPA, ANSI, OSHA etc.</p>\n\n<p><strong><u>MINIMUM QUALIFICATIONS</u></strong></p>\n\n<p>An associate degree (A. A.) or equivalent from two-year college or technical school; and 5 to 7+ years’ experience and/or training; or equivalent combination of education and experience. Minimum of 5 years working as an Electrical Designer I or II or at supervisors discretion.<br>\n<br>\n<em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "publicDescription": "<p><strong><u>Sr. Electrical Revit Designer</u></strong><br>\nContract, 6+ mos. - up to $65/hour (flexible based on experience)<br>\nBenefits: Standard Medical, Dental, and 401(k)<br>\nIn office: M- F<br>\nVarious offices across the USA.<br>\n-Appleton<br>\n-Cincinnati<br>\n-Kansas City<br>\n-Raleigh<br>\n-Greenville<br>\n-Salt Lake City<br>\n-Mobile<br>\n-Savannah<br>\n-Tallahassee<br>\n<br>\n<strong><u>Electrical Designer</u></strong><br>\n<u>MUST have Revit experience.</u></p>\n\n<p>Performs design task related to the layout and specification of electrical and controls systems. The designer also generates drawing packages for these systems as part of engineering design packages to the client.</p>\n\n<p>In addition to the above, provide leadership to designers. They can also take on an increasing role of ownership on electrical and controls packages and management of project tasks.</p>\n\n<p><strong><u>ESSENTIAL FUNCTIONS</u></strong></p>\n\n<p>-Designers are expected to observe professional ethics in their association with others including fellow employees, clients, and vendors</p>\n\n<p>-Reviews rough sketches, drawings, specifications, and other engineering data received from the Engineer.</p>\n\n<p>-Reviews project scope of work and notify project management of any perceived changes in scope that may appear during the design phase.</p>\n\n<p>-Reviews the design input and communicates any ambiguous, incomplete, or conflicting information to the supplier of the input for resolution (includes processing information such as vendor drawings, marked up drawings, design basis, notes, and verbal instructions).</p>\n\n<p>-Reviews design output to verify it meets design input (i.e., verify output meets design basis, design input and standard industry practices).</p>\n\n<p>-Performs work related to design changes after validated documents are issued and notify project management of any perceived changes in scope resulting from the change.</p>\n\n<p>-Conform to drafting and quality standards</p>\n\n<p>-Design electrical and control systems. Generate drawings in accordance with client design requirement for execution and productivity</p>\n\n<p>-Draw single line diagrams (SLD), elementary diagrams (ED), power distribution diagrams, grounding diagrams, lighting drawing, logic diagrams, network architecture diagrams, function diagrams, and other drawings using AutoCAD and other CAD software.</p>\n\n<p><strong><u>OTHER SKILLS AND ABILITIES</u></strong></p>\n\n<p>A high level of competency in AutoCAD is required. The ability to create, modify reference and plot drawings to client standards is key to this position. Knowledge of PDS EE Raceway, SmartPlant Electrical and/or SKM is a plus. Basic knowledge of applicable codes and standards such as NEC, ISA, NFPA, ANSI, OSHA etc.</p>\n\n<p><strong><u>MINIMUM QUALIFICATIONS</u></strong></p>\n\n<p>An associate degree (A. A.) or equivalent from two-year college or technical school; and 5 to 7+ years’ experience and/or training; or equivalent combination of education and experience. Minimum of 5 years working as an Electrical Designer I or II or at supervisors discretion.<br>\n<br>\n<em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "numOpenings": 1,
      "isPublic": 1,
      "address": {
        "city": "Cincinnati",
        "state": "OH",
        "countryName": "United States                                                   "
      },
      "employmentType": "Contract to Hire",
      "salary": 0.0,
      "salaryUnit": "",
      "isDeleted": false,
      "categories": {
        "total": 0,
        "data": []
      },
      "onSite": [
        "Remote"
      ],
      "benefits": null,
      "bonusPackage": null,
      "degreeList": null,
      "skillList": "Revit",
      "certificationList": null,
      "owner": {
        "id": 1397694,
        "firstName": "Ryan",
        "lastName": "Oliver"
      },
      "assignedUsers": {
        "total": 1,
        "data": [
          {
            "id": 1397694,
            "firstName": "Ryan",
            "lastName": "Oliver"
          }
        ]
      },
      "responseUser": {
        "id": 1397694,
        "firstName": "Ryan",
        "lastName": "Oliver"
      },
      "_score": 1.0
    },
    {
      "id": 34277,
      "title": "Electrical Engineer",
      "isOpen": true,
      "status": "Open",
      "dateAdded": 1756491080430,
      "dateLastModified": 1756518288307,
      "clientCorporation": {
        "id": 30681,
        "name": "Jedson Engineering"
      },
      "clientContact": {
        "id": 1470678,
        "firstName": "Jay",
        "lastName": "Howle"
      },
      "description": "<p><strong><u>Electrical Engineer</u></strong> (On-site)</p>\n\n<p>Target rate range $60.00/hour to $80.00/hour (flexible based on experience)<br>\nBenefits: Standard Medical, Dental, and 401(k)<br>\n </p>\n\n<p>This person will bring extensive experience to work on industrial projects including design of power distribution, lighting and grounding systems. Projects range from small facility modifications to complex EPC contracts for heavy industrial processes in any one or more of the pulp and paper, chemicals, food and beverage, consumer products, or pharmaceutical industries. Some travel to project and construction sites will be required.</p>\n\n<ul>\n\t<li>Design power system facilities and equipment and coordinate construction, operation, and maintenance of electric power generating, receiving, and distribution stations, and distribution systems and equipment\n\t<li>Develop conceptual layouts and sketches to drive the most efficient design on a project-by-project basis\n\t<li>Participate in the planning, scheduling, conducting and coordinating detailed phases of electrical engineering projects\n\t<li>Develop equipment specifications\n\t<li>Develop construction specifications and contractor scope of work documents\n\t<li>Directs preparation of or prepares drawings and specific type of equipment and materials to be used, in construction and equipment installation\n\t<li>Inspects completed installations for conformance with design and equipment specifications and safety standards\n\t<li>Work products will include: one-line diagrams, wiring drawings, panel layout drawings, motor schematics, instrument loop sheets, conduit and tray routing drawings and contractor scope documents\n\t<li>Work with systems and equipment grounding requirements (high resistance, building and isolated grounding)\n\t<li>Provide on-site start up support\n</ul>\n\n<p>IDEAL BACKGROUND:</p>\n\n<ul>\n\t<li>5+ years of experience with design/installation of medium and low-voltage distribution equipment, with experience in consulting engineering and construction industry\n\t<li>Strong knowledge of applicable codes and standards (NEC, ANSI, NEMA, NFPA)\n\t<li>Able to handle onsite plant projects with minimal supervision\n\t<li>Well organized with a demonstrated ability to meet deadlines and operate within budgets and work directly with client engineers and maintenance teams.\n\t<li>Working knowledge of Autodesk Revit.\n\t<li>Capability with CAD systems including AutoCAD\n\t<li>PE license is highly preferred\n</ul>\n \n\n<p><strong><u>Can work out of any of the following offices:</u></strong></p>\n\n<table>\n\t<tbody>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Birmingham</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Alabama</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Mobile</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Alabama</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Tallahassee</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Florida</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Savannah</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Georgia</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Kansas City</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Missouri</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Raleigh</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>North Carolina</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Cincinnati</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Ohio</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Greenville</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>South Carolina</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Salt Lake City</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Utah</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Appleton</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Wisconsin</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p>Virginia</p>\n\t\t\t</td>\n\t\t\t<td>\n\t\t\t<p>Washington DC Area</p>\n\t\t\t</td>\n\t\t</tr>\n\t</tbody>\n</table>\n \n\n<p><em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "publicDescription": "<p><strong><u>Electrical Engineer</u></strong> (On-site)</p>\n\n<p>Target rate range $60.00/hour to $80.00/hour (flexible based on experience)<br>\nBenefits: Standard Medical, Dental, and 401(k)<br>\n </p>\n\n<p>This person will bring extensive experience to work on industrial projects including design of power distribution, lighting and grounding systems. Projects range from small facility modifications to complex EPC contracts for heavy industrial processes in any one or more of the pulp and paper, chemicals, food and beverage, consumer products, or pharmaceutical industries. Some travel to project and construction sites will be required.</p>\n\n<ul>\n\t<li>Design power system facilities and equipment and coordinate construction, operation, and maintenance of electric power generating, receiving, and distribution stations, and distribution systems and equipment\n\t<li>Develop conceptual layouts and sketches to drive the most efficient design on a project-by-project basis\n\t<li>Participate in the planning, scheduling, conducting and coordinating detailed phases of electrical engineering projects\n\t<li>Develop equipment specifications\n\t<li>Develop construction specifications and contractor scope of work documents\n\t<li>Directs preparation of or prepares drawings and specific type of equipment and materials to be used, in construction and equipment installation\n\t<li>Inspects completed installations for conformance with design and equipment specifications and safety standards\n\t<li>Work products will include: one-line diagrams, wiring drawings, panel layout drawings, motor schematics, instrument loop sheets, conduit and tray routing drawings and contractor scope documents\n\t<li>Work with systems and equipment grounding requirements (high resistance, building and isolated grounding)\n\t<li>Provide on-site start up support\n</ul>\n\n<p>IDEAL BACKGROUND:</p>\n\n<ul>\n\t<li>5+ years of experience with design/installation of medium and low-voltage distribution equipment, with experience in consulting engineering and construction industry\n\t<li>Strong knowledge of applicable codes and standards (NEC, ANSI, NEMA, NFPA)\n\t<li>Able to handle onsite plant projects with minimal supervision\n\t<li>Well organized with a demonstrated ability to meet deadlines and operate within budgets and work directly with client engineers and maintenance teams.\n\t<li>Working knowledge of Autodesk Revit.\n\t<li>Capability with CAD systems including AutoCAD\n\t<li>PE license is highly preferred\n</ul>\n \n\n<p><strong><u>Can work out of any of the following offices:</u></strong></p>\n\n<table>\n\t<tbody>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Birmingham</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Alabama</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Mobile</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Alabama</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Tallahassee</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Florida</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Savannah</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Georgia</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Kansas City</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Missouri</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Raleigh</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>North Carolina</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Cincinnati</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Ohio</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Greenville</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>South Carolina</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Salt Lake City</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Utah</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td width=\"162\">\n\t\t\t<p>Appleton</p>\n\t\t\t</td>\n\t\t\t<td width=\"228\">\n\t\t\t<p>Wisconsin</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p>Virginia</p>\n\t\t\t</td>\n\t\t\t<td>\n\t\t\t<p>Washington DC Area</p>\n\t\t\t</td>\n\t\t</tr>\n\t</tbody>\n</table>\n \n\n<p><em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "numOpenings": 1,
      "isPublic": 1,
      "address": {
        "city": null,
        "state": null,
        "countryName": "United States                                                   "
      },
      "employmentType": "Contract to Hire",
      "salary": 0.0,
      "salaryUnit": "",
      "isDeleted": false,
      "categories": {
        "total": 0,
        "data": []
      },
      "onSite": [
        "Remote"
      ],
      "benefits": null,
      "bonusPackage": null,
      "degreeList": null,
      "skillList": null,
      "certificationList": null,
      "owner": {
        "id": 1397694,
        "firstName": "Ryan",
        "lastName": "Oliver"
      },
      "assignedUsers": {
        "total": 1,
        "data": [
          {
            "id": 1397694,
            "firstName": "Ryan",
            "lastName": "Oliver"
          }
        ]
      },
      "responseUser": {
        "id": 1397694,
        "firstName": "Ryan",
        "lastName": "Oliver"
      },
      "_score": 1.0
    },
    {
      "id": 34273,
      "title": "Architectural Department Manager",
      "isOpen": true,
      "status": "Open",
      "dateAdded": 1756478436450,
      "dateLastModified": 1756518163867,
      "clientCorporation": {
        "id": 32585,
        "name": "Salas O'Brien"
      },
      "clientContact": {
        "id": 1470783,
        "firstName": "Keith",
        "lastName": "Strunk"
      },
      "description": "<p><strong>Architectural Department Manager</strong><br>\nLocation: Cincinnati, OH (On-site or Remote)</p>\n\n<p>Benefits: Access to Benefits Package</p>\n\n<p><strong><u>Summary:</u></strong> Reporting to the Director of Engineering (DOE), the Department Manager (DM) represents the company in such a way that embodies the company's values and beliefs. The DM collaborates with the Best Practices to determine the best resource assignments for projects based on availability of the resource(s) and the best overall direction for the company and the team member's career objectives.</p>\n\n<p><strong><u>Responsibilities:</u></strong></p>\n\n<ul>\n\t<li>Evaluate the need for a direct hire vs contracted resource\n\t<li>Evaluate resumes as they are received for potential department fit.\n\t<li>Interview with potential new resources.\n\t<li>Work with discipline specific Best Practices to assist with on-the-job training and communicating discipline specific standards.\n\t<li>Know and understand the team member’s goals, objectives and career interests.\n\t<li>Perform One-on-Ones monthly and provide team member regular feedback regarding performance.\n\t<li>Conduct formal team member Performance Appraisal annually.\n\t<li>Identify team members with poor performance and inform / seek guidance from Human Resources if necessary.\n\t<li>Assign a Discipline Lead (DL) to begin the SDA document and project fee estimate process.\n\t<li>Review and approve all engineering and design SDA’s and project fee estimates for the department.\n\t<li>Assist the Sales / Marketing Department in preparation of marketing documents like resumes and prior experience.\n</ul>\n\n<p><strong><u>Experience: </u></strong></p>\n\n<ul>\n\t<li>Good interpersonal communication (verbal and written) skills.\n\t<li>Strong organizational, prioritization and time management skills to handle multiple tasks and various situations in a fast-paced environment.\n\t<li>Ability to deal with complex situations with confidentiality.\n\t<li>Ability to handle confidential data.\n\t<li>Commitment to excellence and high standards.\n\t<li>Accountable / Responsible work ethic.\n\t<li><strong>Required – minimum four (4) year degree in Architecture with RA License; Preferred – NCARB</strong>\n\t<li>Advanced knowledge of Microsoft Word, Excel, Outlook, Access and PowerPoint.\n\t<li>Fundamental experience with Microsoft Project.\n\t<li>Preferred – Deltek Accounting System experience.\n</ul>\n<br>\n<p><em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "publicDescription": "<p><strong>Architectural Department Manager</strong><br>\nLocation: Cincinnati, OH (On-site or Remote)</p>\n\n<p>Benefits: Access to Benefits Package</p>\n\n<p><strong><u>Summary:</u></strong> Reporting to the Director of Engineering (DOE), the Department Manager (DM) represents the company in such a way that embodies the company&apos;s values and beliefs. The DM collaborates with the Best Practices to determine the best resource assignments for projects based on availability of the resource(s) and the best overall direction for the company and the team member&apos;s career objectives.</p>\n\n<p><strong><u>Responsibilities:</u></strong></p>\n\n<ul>\n\t<li>Evaluate the need for a direct hire vs contracted resource\n\t<li>Evaluate resumes as they are received for potential department fit.\n\t<li>Interview with potential new resources.\n\t<li>Work with discipline specific Best Practices to assist with on-the-job training and communicating discipline specific standards.\n\t<li>Know and understand the team member’s goals, objectives and career interests.\n\t<li>Perform One-on-Ones monthly and provide team member regular feedback regarding performance.\n\t<li>Conduct formal team member Performance Appraisal annually.\n\t<li>Identify team members with poor performance and inform / seek guidance from Human Resources if necessary.\n\t<li>Assign a Discipline Lead (DL) to begin the SDA document and project fee estimate process.\n\t<li>Review and approve all engineering and design SDA’s and project fee estimates for the department.\n\t<li>Assist the Sales / Marketing Department in preparation of marketing documents like resumes and prior experience.\n</ul>\n\n<p><strong><u>Experience: </u></strong></p>\n\n<ul>\n\t<li>Good interpersonal communication (verbal and written) skills.\n\t<li>Strong organizational, prioritization and time management skills to handle multiple tasks and various situations in a fast-paced environment.\n\t<li>Ability to deal with complex situations with confidentiality.\n\t<li>Ability to handle confidential data.\n\t<li>Commitment to excellence and high standards.\n\t<li>Accountable / Responsible work ethic.\n\t<li><strong>Required – minimum four (4) year degree in Architecture with RA License; Preferred – NCARB</strong>\n\t<li>Advanced knowledge of Microsoft Word, Excel, Outlook, Access and PowerPoint.\n\t<li>Fundamental experience with Microsoft Project.\n\t<li>Preferred – Deltek Accounting System experience.\n</ul>\n \n\n<p><em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em></p>\n",
      "numOpenings": 1,
      "isPublic": 1,
      "address": {
        "city": "Cincinnati",
        "state": "OH",
        "countryName": "United States                                                   "
      },
      "employmentType": "Contract to Hire",
      "salary": 0.0,
      "salaryUnit": "",
      "isDeleted": false,
      "categories": {
        "total": 0,
        "data": []
      },
      "onSite": [
        "Remote"
      ],
      "benefits": null,
      "bonusPackage": null,
      "degreeList": null,
      "skillList": null,
      "certificationList": null,
      "owner": {
        "id": 1397694,
        "firstName": "Ryan",
        "lastName": "Oliver"
      },
      "assignedUsers": {
        "total": 1,
        "data": [
          {
            "id": 1397698,
            "firstName": "Mike",
            "lastName": "Scalzitti"
          }
        ]
      },
      "responseUser": {
        "id": 1397694,
        "firstName": "Ryan",
        "lastName": "Oliver"
      },
      "_score": 1.0
    },
    {
      "id": 34272,
      "title": "Electrical Engineer - Power Equipment/Controls",
      "isOpen": true,
      "status": "Open",
      "dateAdded": 1756478040793,
      "dateLastModified": 1756517734793,
      "clientCorporation": {
        "id": 32586,
        "name": "Servtech (a Roeslein Company)"
      },
      "clientContact": {
        "id": 1470848,
        "firstName": "Daniel",
        "lastName": "Kaminer"
      },
      "description": "<p><strong>Electrical Engineer III</strong><br>\n<strong>Louisville, CO</strong><br>\n<strong>100% on site role - in office presence required</strong><br>\n<br>\nBenefits: Access to Client Benefits Package<br>\nPay Range: $115,000-$150,000</p>\n\n<p><strong>POSITION SUMMARY</strong></p>\n\n<p>Seeking an Electrical Engineer III to join our client’s team in the energy, mining, industrial power markets, and Integrated bio-energy solutions. The Electrical Engineer III will research, develop, design, and test electrical components, equipment and systems including power / control systems, applying principles and techniques of electrical engineering.</p>\n\n<p><strong>RESPONSIBILITIES</strong></p>\n\n<ul>\n\t<li>Design electrical equipment, facilities, components, products, and systems for industrial purposes.\n\t<li>Design and direct personnel in fabrication of control apparatus and equipment, and determine methods, procedures, and conditions for testing products such as generators, transformers, control devices, motors, conveyors, power distribution, and safety systems.\n\t<li>Develop applications of controls, instruments, and systems for industrial uses, including motors and conveyance systems; lead activities to ensure that manufacturing, construction, installation, and operation conform to functional specifications and customer requirements.\n\t<li>Direct and coordinate operation, maintenance and repair of equipment and systems in field installations utilizing computer-assisted engineering and design software and equipment to perform engineering tasks.\n\t<li>Perform specific and limited portions of a broader assignment of an experienced engineer. Lead a single group of Engineers, Designers and Technicians.\n\t<li>Independently evaluate, select, and apply standard practices and techniques in specific situations, adjust and correlate data, recognize discrepancies in the results, and follow operations through a series of related detailed steps or processes.\n\t<li>Ability to design a complete standard electrical engineering drawings package, which includes, power one-lines, control schematics, control panel layouts with bills of material, interconnection diagrams, cable schedules, cable tray design criteria, and cable tray drawings.\n\t<li>Ability to create program projects, modify, debug PLC software, and understand the various communication networks used.\n\t<li>Serve as the primary electrical resource for the installation and start-up of the assignment.\n\t<li>Ability to manage electrical contractors along with Modular Fabrication resources to complete unitized and pre-assembled work.\n\t<li>Collaborate with the estimation department to create and execute project estimations.\n\t<li>Work with project management to create schedules for assignments. Manage electrical portion of some projects.\n</ul>\n\n<p><strong>REQUIREMENTS</strong></p>\n\n<ul>\n\t<li>Bachelor's degree in electrical engineering is required.\n\t<li>5-7+ years of experience in electrical engineering is required.\n\t<li>Power experience is a plus (i.e. power distribution centers, motor control centers, large frequency drives, medium voltage )\n\t<li>Project management experience\n\t<li>AutoCAD and drafting experience beyond a basic level is preferred.\n\t<li>Experience developing drawings for fabrication of wire way systems are preferred.\n\t<li>Experience with selection and specification of switch gear, motor control centers, large generators, medium to high voltage transformers, water systems, support equipment and/or HVAC equipment is preferred.\n\t<li>Strong mechanical aptitude and hands-on experience are preferred.\n\t<li>Process knowledge of P&ID’s.\n\t<li>Excellent communication skills are required.\n\t<li>EIT registration is preferred.\n\t<li>Microsoft Office proficiency\n</ul>\n<br>\n<br>\n<em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em>",
      "publicDescription": "<p><strong>Electrical Engineer III</strong><br>\n<strong>Louisville, CO</strong><br>\n<strong>100% on site role - in office presence required</strong><br>\n<br>\nBenefits: Access to Client Benefits Package<br>\nPay Range: $115,000-$150,000</p>\n\n<p><strong>POSITION SUMMARY</strong></p>\n\n<p>Seeking an Electrical Engineer III to join our client’s team in the energy, mining, industrial power markets, and Integrated bio-energy solutions. The Electrical Engineer III will research, develop, design, and test electrical components, equipment and systems including power / control systems, applying principles and techniques of electrical engineering.</p>\n\n<p><strong>RESPONSIBILITIES</strong></p>\n\n<ul>\n\t<li>Design electrical equipment, facilities, components, products, and systems for industrial purposes.\n\t<li>Design and direct personnel in fabrication of control apparatus and equipment, and determine methods, procedures, and conditions for testing products such as generators, transformers, control devices, motors, conveyors, power distribution, and safety systems.\n\t<li>Develop applications of controls, instruments, and systems for industrial uses, including motors and conveyance systems; lead activities to ensure that manufacturing, construction, installation, and operation conform to functional specifications and customer requirements.\n\t<li>Direct and coordinate operation, maintenance and repair of equipment and systems in field installations utilizing computer-assisted engineering and design software and equipment to perform engineering tasks.\n\t<li>Perform specific and limited portions of a broader assignment of an experienced engineer. Lead a single group of Engineers, Designers and Technicians.\n\t<li>Independently evaluate, select, and apply standard practices and techniques in specific situations, adjust and correlate data, recognize discrepancies in the results, and follow operations through a series of related detailed steps or processes.\n\t<li>Ability to design a complete standard electrical engineering drawings package, which includes, power one-lines, control schematics, control panel layouts with bills of material, interconnection diagrams, cable schedules, cable tray design criteria, and cable tray drawings.\n\t<li>Ability to create program projects, modify, debug PLC software, and understand the various communication networks used.\n\t<li>Serve as the primary electrical resource for the installation and start-up of the assignment.\n\t<li>Ability to manage electrical contractors along with Modular Fabrication resources to complete unitized and pre-assembled work.\n\t<li>Collaborate with the estimation department to create and execute project estimations.\n\t<li>Work with project management to create schedules for assignments. Manage electrical portion of some projects.\n</ul>\n\n<p><strong>REQUIREMENTS</strong></p>\n\n<ul>\n\t<li>Bachelor&apos;s degree in electrical engineering is required.\n\t<li>5-7+ years of experience in electrical engineering is required.\n\t<li>Power experience is a plus (i.e. power distribution centers, motor control centers, large frequency drives, medium voltage )\n\t<li>Project management experience\n\t<li>AutoCAD and drafting experience beyond a basic level is preferred.\n\t<li>Experience developing drawings for fabrication of wire way systems are preferred.\n\t<li>Experience with selection and specification of switch gear, motor control centers, large generators, medium to high voltage transformers, water systems, support equipment and/or HVAC equipment is preferred.\n\t<li>Strong mechanical aptitude and hands-on experience are preferred.\n\t<li>Process knowledge of P&ID’s.\n\t<li>Excellent communication skills are required.\n\t<li>EIT registration is preferred.\n\t<li>Microsoft Office proficiency\n</ul>\n<br>\n<br>\n<em>We are an Equal Opportunity Employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity, or any other legally protected status. All qualified applicants will receive consideration for employment without regard to any of these characteristics.</em>",
      "numOpenings": 1,
      "isPublic": 1,
      "address": {
        "city": "",
        "state": "CO",
        "countryName": "United States                                                   "
      },
      "employmentType": "Direct Hire",
      "salary": 0.0,
      "salaryUnit": "",
      "isDeleted": false,
      "categories": {
        "total": 0,
        "data": []
      },
      "onSite": [
        "Hybrid"
      ],
      "benefits": null,
      "bonusPackage": null,
      "degreeList": null,
      "skillList": null,
      "certificationList": null,
      "owner": {
        "id": 1397698,
        "firstName": "Mike",
        "lastName": "Scalzitti"
      },
      "assignedUsers": {
        "total": 1,
        "data": [
          {
            "id": 1397698,
            "firstName": "Mike",
            "lastName": "Scalzitti"
          }
        ]
      },
      "responseUser": {
        "id": 1397698,
        "firstName": "Mike",
        "lastName": "Scalzitti"
      },
      "_score": 1.0
    }
  ]
}