{
  "timestamp": "2025-08-12T15:47:48.330207",
  "jobs": {
    "32541": {
      "id": "32541",
      "title": "EDW Informatica ETL Developer (32541)",
      "company": "Myticas Consulting",
      "description": "<p><strong>EDW Informatica ETL Developer </strong></p> <p><strong>Job Title: </strong>Enterprise Data Warehouse (EDW) Informatica ETL Developer</p> <p><strong>Duration: </strong>12 months with possible multi-year extension/s</p> <p><strong>Job Summary: </strong></p> <p>Clover Consulting (a Myticas Co.) is are seeking a highly experienced Informatica Extract Transform Load (ETL) Developer for a large, direct client in Springfield, IL. This opportunity will be an assent to the Enterprise Data Warehouse (EDW) team.</p> <p>This role is responsible for designing, developing, and maintaining robust ETL processes using Informatica PowerCenter and Teradata. The ideal candidate will have a deep understanding of data integration, performance tuning, and data warehousing best practices, with a focus on supporting healthcare-related data systems.</p> <p><strong>Key Responsibilities: </strong></p> <ul> <li>Design and implement ETL solutions using Informatica PowerCenter to extract, transform, and load data from various agency sources.</li> <li>Automate data staging processes and optimize ETL job scheduling for performance and efficiency.</li> <li>Administer and support ETL environments, including development and production systems.</li> <li>Perform repository backups, recovery operations, and system maintenance.</li> <li>Develop mappings, mapplets, sessions, and workflows using a wide range of Informatica transformations.</li> <li>Monitor and troubleshoot ETL jobs across development, testing, and production environments.</li> <li>Write and optimize complex SQL queries and Unix Shell scripts for data marts and interfaces in Teradata.</li> <li>Collaborate with stakeholders to define requirements, document technical solutions, and support project planning.</li> <li>Participate in unit, integration, and system testing.</li> <li>Provide technical support, mentoring, and guidance to team members.</li> <li>Communicate project status and deliverables to leadership and clients.</li> <li>Continuously learn and apply new technologies to enhance system performance and capabilities.</li> </ul> <p><strong>Required Qualifications:</strong></p> <ul> <li>7+ years of experience with Informatica PowerCenter and ETL development.</li> <li>5+ years of experience writing complex SQL and performance tuning.</li> <li>5+ years of experience with Teradata (v17+), including Fastload, TPT, and Multiload utilities.</li> <li>5+ years of Informatica PowerCenter administration experience.</li> <li>2+ years of Unix Shell (Bash/Korn) scripting experience.</li> <li>Strong communication, collaboration, and mentoring skills.</li> <li>Bachelorâ\u0080\u0099s or advanced degree in IT, Computer Science, Mathematics, or a related field.</li> <li>Strong organizational and time management skills. 2025 Page 1 of 2 Enterprise Data Warehouse (EDW) ETL/Informatica Developer</li> </ul> <p><strong>Preferred Qualifications: </strong></p> <ul> <li>Residing in or near Springfield, IL.</li> <li>5+ years of data warehouse development experience.</li> <li>5+ years of data modeling experience using ERWIN or similar tools.</li> <li>2+ years of experience with Azure Data Factory and Snowflake.</li> <li>Experience with scripting languages such as Python, R, or JavaScript (React).</li> <li>Familiarity with Informatica Data Quality (IDQ), Address Doctor, and Metadata Manager.</li> <li>Experience with Medicaid, Medicare, or healthcare data systems.</li> <li>Experience working in Agile environments.</li> <li>Knowledge of BI and data integration technologies across relational and multidimensional systems.</li> </ul>",
      "location": "",
      "country": "United States",
      "date": "June 13, 2025",
      "referencenumber": "TYAOIGKLJY",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32541/EDW%20Informatica%20ETL%20Developer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "32589": {
      "id": "32589",
      "title": "Senior FPGA Developer (32589)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Overview & Role Focus</strong></p> <p>This role is centered on innovating and advancing state-of-the-art video processing and transport capabilities, delivering high-performance solutions on some of the most integrated poadcast hardware platforms available today. The successful candidate will work hands-on with FPGA design, real-time media interfaces, and poadcast protocol implementation, playing a key role across architecture, development, testing, and cross-functional support.</p> <p><strong>Key Responsibilities</strong></p> <ul> <li>Lead the development and continuous improvement of advanced video transport and processing features within tightly integrated poadcast hardware.</li> <li>Design RTL for real-time, high-throughput media systems involving advanced interfacesâ\u0080\u0094such as PCIe, memory, and specialized hardware acceleration (e.g., video scaling, HDR/SDR conversion).</li> <li>Implement FPGA-based real-time transport protocols like SMPTE 2110 and SDI.</li> <li>Participate in architectural planning: advise on FPGA density, schematic reviews, clocking strategies, and thermal considerations.</li> <li>Build complete IO ring designs across modern FPGAs (Arria10, Stratix-10, Ultrascale+, MPSoC, Agilex) and validate pin-outs/IP within Quartus and Vivado environments.</li> <li>Define and negotiate high-level design specs, assist in part selection, and align with aggressive project timelines.</li> <li>Contribute to design specifications and documentation used by cross-functional teams.</li> <li>Collaborate closely with peers on design verification and testing of FPGA and hardware systems.</li> <li>Tackle debugging with a methodical and efficient approach.</li> <li>Support team members throughout the entire New Product Introduction (NPI) lifecycleâ\u0080\u0094from design through manufacturing to customer support.</li> </ul> <p><strong>Required Skills & Background</strong></p> <ul> <li>5+ years in FPGA and hardware development, with a strong preference for experience in video/audio-centric technologies.</li> <li>Intermediate to senior-level expertise in FPGA architecture and core components.</li> <li>Deep understanding of high-speed serial interfaces, clock domains, timing closure, and transceiver integration.</li> <li>Proficiency in Verilog, SystemVerilog, and TCL scripting; capable of creating testbenches and running simulations (e.g., VCS).</li> <li>Familiarity with modern Intel and Xilinx FPGA families and their development/debugging toolchains.</li> <li>Hands-on experience with interfaces like DDR3/DDR4, HBM, PLLs, and gigabit transceivers.</li> <li>Skilled in lab-based debugging using oscilloscopes, JBERTs, network analyzers, waveform monitors, etc.</li> <li>Embedded system awarenessâ\u0080\u0094experience with Linux, C/C++, bash scripting, and networking considered valuable.</li> <li>Broadcast studio domain knowledge is highly desirable, especially within video production and distribution workflows.</li> <li>A strong grasp of digital video/audio standards and signal integrity is considered a plus.</li> <li>Driven and independent, yet collaborativeâ\u0080\u0094equally adept at working solo or influencing poader team strategies.</li> <li>Quick learner with a creative mindset and ability to push ideas from concept to market.</li> <li>Comfortable making bold decisions that balance quality, speed, and cost for optimal business outcomes.</li> <li>Effective communicator with sharp observational skills and a problem-solving mindset.</li> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 03, 2025",
      "referencenumber": "LGWANV7EE2",
      "remotetype": "No Preference",
      "url": "https://apply.myticas.com/32589/Senior%20FPGA%20Developer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Broadcast Media",
      "senioritylevel": "Mid-Senior level"
    },
    "32659": {
      "id": "32659",
      "title": "Drupal Developer (32659)",
      "company": "Myticas Consulting",
      "description": "<p>The recruitment team at Myticas Consulting is looking for an experienced Drupal Developer who would be interested in a long-term remote contract opportunity offered within Canada (originally headquartered in Ottawa, ON).</p> <p><strong>Previous experience required:</strong></p> <ul> <li>Experience building web applications in the Drupal (7) CMS</li> <li>Understands key server-side web development concepts through experiences such as:</li> <li>Interpreting graphic visual or interaction designs in HTML, CSS and Javascript.</li> <li>Creating visually appealing web pages or interfaces.</li> <li>Creating, editing or modifying templates for a CMS or web development framework.</li> <li>Programming interaction with JavaScript and/or a lipary such as jQuery, YUI or Prototype.</li> <li>Testing cross-powser, cross-platform, and/or cross-device compatibility for inconsistencies.</li> <li>Testing for compliance to specified standards such as accessibility standards (WCAG 2.0) in the clients region or domain.</li> <li>Conducting observational user testing, or reviewing designs against usability heuristics.</li> <li>Domain specific knowledge or transferable skills</li> <li>Experience with web development languages of HTML, CSS and JavaScript/jQuery.</li> <li>HTML <ul> <li>Familiarity of HTML syntax for multiple specifications, including HTML 5.</li> <li>Knowledge of the semantic meaning of all HTML elements.</li> <li>Familiarity with the semantic markup for display of lists, tabular data, forms, articles, etc.</li> <li>Knowledge of markup used for layout such as dividers.</li> <li>Knowledge at the level to be able to hand-code markup.</li> <li>Including media and images.</li> </ul> <li>PHP <ul> <li>Familiarity with modifying Drupal Theme hooks to display data</li> <li>Understanding how to utilize PHP to filter, process and output html, json, xml</li> </ul> <li>CSS <ul> <li>Specifying different CSS for various media, devices and displays.</li> <li>Best practices in CSS file organization and structure.</li> <li>Methods for including CSS inline, internal and external via linked style sheets.</li> <li>How to define, combine and group CSS selectors for HTML elements, ID, classes, pseudo classes, child or sibling.</li> <li>Syntax of CSS declarations, properties and attributes.</li> <li>CSS box model and methods for CSS positioning, absolute and relative.</li> <li>Knowledge of properties and attributes to control the display.</li> <li>Familiarity with differences in CSS 2 and CSS 3.</li> <li>Proficient with a CSS Preprocessor such as Sass or LESS.</li> </ul> <li>Best practices <ul> <li>Drupal standards and modules</li> <li>Methods to ensure powser & device compatibility</li> <li>Methods for degrading gracefully for older powsers and displays.</li> <li>Methods to ensure accessibility.</li> <li>File compression techniques for improving speed.</li> </ul> <li>JavaScript <ul> <li>Knowledge of the operators, variables, datatypes, objects, properties and methods.</li> <li>Familiarity with control structures such as objects, functions, conditional statements, arrays, loops and expressions.</li> <li>Forms and regular expression validation and submitting data.</li> <li>Knowledge of how to apply logical operators and conditional statements.</li> <li>Knowledge of the DOM HTML objects and their properties.</li> <li>Event handling.</li> <li>Creating and controlling windows and dialogs.</li> <li>Processes for troubleshooting and debugging</li> <li>Familiarity with development and debugging tools for cross-powser issues.</li> </ul> <li>jQuery <ul> <li>Knowledge of how to employ the jQuery lipary for visual effects, event handling, and document manipulation.</li> </ul> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 24, 2025",
      "referencenumber": "P4O7RFOMH5",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32659/Drupal%20Developer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34110": {
      "id": "34110",
      "title": "Lead & Senior Machine Learning Engineer - MLOps & Platform Engineering (34110)",
      "company": "Myticas Consulting",
      "description": "<br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Myticas Consulting is seeking a highly experienced Machine Learning Engineer to join a fast-paced, client-facing environment focused on delivering scalable ML solutions. This role is hands-on and deeply technical, involving the modernization and migration of mature ML models within a complex production ecosystem. Youâ\u0080\u0099ll be leading architectural efforts, implementing robust MLOps practices, and supporting the integration of ML applications into SaaS platforms. Strong communication skills are essential, as the position requires regular collaboration with stakeholders and mentoring of junior team members.</span></span></span><br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">This opportunity is open exclusively to candidates located in Canada with a solid background in production-grade ML engineeringâ\u0080\u0094not recent graduates.</span></span></span><br> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 13.5pt;\">Role/Responsibilities</span></strong></span></span><br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 12.0pt;\">Platform Engineering & MLOps</span></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Architect and deliver ML pipelines end-to-end using tools like Databricks and MLflow.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Create and maintain large-scale data processing and feature engineering workflows within Databricks.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Automate and manage the full ML lifecycle: model training, testing, deployment, and monitoring.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Introduce CI/CD automation with platforms such as GitHub Actions or Azure DevOps.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Ensure high availability, security, and scalability across ML workflows.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Migrate models to SaaS environments and support cross-platform integrations.</span></span></span> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><u><span style=\"font-size: 12.0pt;\"><span style=\"background-color: yellow;\">Leadership & Collaboration</span></span></u></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Act as a technical leader on ML-focused client engagements, driving delivery and alignment with business outcomes.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Translate strategic objectives into practical ML implementations and delivery roadmaps.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Partner with data scientists, engineers, and product stakeholders to embed ML models into production environments.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Mentor junior team members and champion ML engineering best practices across engagements.</span></span></span> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 12.0pt;\">ML Application Engineering</span></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Convert experimental models into scalable, production-ready solutions.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Apply and optimize ML algorithms across a mix of structured and unstructured datasets.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Measure model performance, run experiments, and iterate for improvement.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Maintain documentation and contribute to internal knowledge-sharing frameworks.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Assist with the scale-up and migration of 25+ models in a production environment already housing over 100 ML models.</span></span></span> </ul> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 13.5pt;\">Experience</span></strong></span></span><br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 13.5pt;\">Mandatory</span></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Bachelorâ\u0080\u0099s or Masterâ\u0080\u0099s degree in Computer Science, Engineering, or a closely related technical field.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Strong academic and practical foundation in ML algorithms, distributed computing, and data engineering.</span></span></span> </ul> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">5+ years in software/data/DevOps engineering roles, with 3+ years specifically in ML engineering or MLOps.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Demonstrated experience launching and managing machine learning solutions in production.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Expertise with Azure-based ecosystems (Azure ML, Data Lake, AKS, Azure DevOps).</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Databricks proficiency is a mustâ\u0080\u0094especially working with Delta Lake, MLflow, and Apache Spark.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Advanced Python coding capabilities and experience with frameworks like TensorFlow, PyTorch, and scikit-learn.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Familiarity with CI/CD tools and infrastructure-as-code frameworks (e.g., Terraform).</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Strong communication skills and a collaborative mindset.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Must be legally authorized to work in Canada and currently residing in the country.</span></span></span> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 12.0pt;\">Nice to Have</span></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Certifications in Azure or Databricks (e.g., Databricks Certified Professional, Microsoft Certified: Azure Solution Architect).</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Exposure to LLMs and frameworks like Transformers, TRL, or DeepSpeed.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Background in migrating ML models to SaaS platforms.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 12.0pt;\">Prior experience in a consulting role, with a track record of effective client engagement.</span></span></span> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 06, 2025",
      "referencenumber": "7QTB1GHKT9",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34110/Lead%20%26%20Senior%20Machine%20Learning%20Engineer%20-%20MLOps%20%26%20Platform%20Engineering/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34101": {
      "id": "34101",
      "title": "Sr. Drupal Developer (34101)",
      "company": "Myticas Consulting",
      "description": "<p>We are seeking a highly skilled <strong>Senior Drupal Developer</strong> with deep experience in PHP and Drupal to lead and support the development of robust, scalable web solutions. The ideal candidate has a strong command of both front-end and back-end development, is comfortable working with a variety of contrib modules and custom code, and thrives in a collaborative, DevOps-driven environment.</p> <p><strong>Key Responsibilities:</strong></p> <ul> <li> <p>Lead and contribute to the design, development, and maintenance of Drupal-based websites and applications.</p> <li> <p>Build and customize content types, views, and display logic using modules such as Display Suite and Webforms.</p> <li> <p>Develop custom modules and maintain high standards for coding practices, testing, and documentation.</p> <li> <p>Optimize site performance through Search API integrations with ElasticSearch.</p> <li> <p>Lead or support complex Drupal migrations using the <strong>Drupal Migrate</strong> module.</p> <li> <p>Apply and create patches to core and contrib modules as necessary.</p> <li> <p>Integrate and develop web services (RESTful APIs) and support external integrations.</p> <li> <p>Collaborate with front-end developers using JavaScript and CSS/Sass to create seamless user experiences.</p> <li> <p>Utilize container-based development environments using <strong>Docker DDEV</strong> or work in <strong>VirtualBox</strong>-based systems (e.g., AlmaLinux).</p> <li> <p>Manage source control, branching, and CI/CD pipelines using <strong>Git</strong> and <strong>GitHub Actions</strong>.</p> <li> <p>Participate in code reviews, sprint planning, and DevOps discussions.</p> </ul> <p><strong>Required Qualifications:</strong></p> <ul> <li> <p>5+ years of hands-on experience with <strong>Drupal (7/8/9/10)</strong> and <strong>PHP</strong> development.</p> <li> <p>Expertise in a wide variety of <strong>contrib modules</strong> and <strong>custom module development</strong>.</p> <li> <p>Deep understanding of <strong>Drupal theming</strong>, <strong>content type customization</strong>, and <strong>site-building best practices</strong>.</p> <li> <p>Strong experience with <strong>Search API</strong>, <strong>ElasticSearch</strong>, and performance tuning.</p> <li> <p>Demonstrated knowledge of <strong>web services integration</strong> and <strong>Drupal migration</strong> workflows.</p> <li> <p>Competency with front-end technologies including <strong>JavaScript</strong>, <strong>CSS/Sass</strong>.</p> <li> <p>Proficiency with <strong>Docker DDEV</strong> or <strong>VirtualBox</strong>-based Linux environments (especially <strong>AlmaLinux</strong>).</p> <li> <p>Comfortable with <strong>Git</strong>, <strong>GitHub</strong>, and CI/CD pipelines.</p> </ul> <p><strong>Nice to Have:</strong></p> <ul> <li> <p>Experience integrating with <strong>Microsoft Dynamics 365 CRM</strong>.</p> <li> <p>Familiarity with <strong>Azure Cloud</strong> environments.</p> <li> <p>Knowledge of <strong>C# and .NET</strong> development.</p> </ul> <p><strong>Personal Attributes:</strong></p> <ul> <li> <p>Strong problem-solving skills and attention to detail.</p> <li> <p>Ability to work independently and in a team environment.</p> <li> <p>Excellent communication and time management skills.</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 05, 2025",
      "referencenumber": "2SO56MNQIQ",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/34101/Sr.%20Drupal%20Developer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34223": {
      "id": "34223",
      "title": "IT Technical Analyst â\u0080\u0093 Data Governance & Microsoft Purview (34223)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Required Experience Needed:</strong></p> <ul> <li> <p>3â\u0080\u00935 years of experience as an IT Technical Analyst</p> </li> <li> <p>1â\u0080\u00933 years of hands-on experience with Microsoft 365</p> </li> <li> <p>1â\u0080\u00933 years of experience working with Microsoft Purview</p> </li> </ul> <p><strong>Core Competencies Required:</strong></p> <ul> <li> <p><strong>Technical Proficiency:</strong><br /> In-depth knowledge of Microsoft Purview, Microsoft 365 workloads, and Azure capabilities, with a strong foundation in cloud-based data governance solutions.</p> </li> <li> <p><strong>Data Governance & Security:</strong><br /> Solid understanding of data governance frameworks, data lifecycle management, and security best practices to ensure organizational compliance and data integrity.</p> </li> <li> <p><strong>Compliance Expertise:</strong><br /> Familiarity with data protection regulations and compliance standards such as GDPR, HIPAA, and other regional or industry-specific frameworks.</p> </li> <li> <p><strong>Analytical & Problem-Solving Skills:</strong><br /> Strong analytical mindset and troubleshooting abilities to address complex governance and data classification challenges.</p> </li> <li> <p><strong>Cross-Functional Collaboration:</strong><br /> Demonstrated ability to work effectively with diverse teams including data architects, business analysts, and cybersecurity professionals.</p> </li> <li> <p><strong>Automation & Scripting:</strong><br /> Proficiency with scripting tools such as PowerShell for automating workflows and integrating Purview capabilities across systems.</p> </li> </ul> <p><strong>Nice to Have:</strong></p> <ul> <li> <p>Experience with Exact Data Match (EDM) for advanced data classification and protection.</p> </li> </ul> <hr /> <p><strong>Key Responsibilities:</strong></p> <ul> <li> <p><strong>Policy Development & Enforcement:</strong><br /> Design, implement, and maintain data policies including Data Loss Prevention (DLP), data retention, and sensitive information protection measures.</p> </li> <li> <p><strong>Data Cataloging & Lineage:</strong><br /> Build and manage a centralized data catalog, define metadata standards, and establish data lineage to promote transparency and data discoverability.</p> </li> <li> <p><strong>Risk & Compliance Monitoring:</strong><br /> Conduct risk assessments, proactively monitor for compliance violations, and implement remediation strategies leveraging Purviewâ\u0080\u0099s capabilities.</p> </li> <li> <p><strong>System Integration:</strong><br /> Seamlessly integrate Microsoft Purview with Microsoft 365 workloads and other enterprise data sources to enhance governance coverage.</p> </li> <li> <p><strong>Reporting & Insights:</strong><br /> Generate actionable insights through reports on data usage, compliance status, and governance gaps to support continuous improvement.</p> </li> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 08, 2025",
      "referencenumber": "BJMJ3RBW1Q",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/34223/IT%20Technical%20Analyst%20%E2%80%93%20Data%20Governance%20%26%20Microsoft%20Purview/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34085": {
      "id": "34085",
      "title": "Full-Stack Developer (34085)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">We are seeking a <strong>Full Stack Developer</strong> with strong expertise in <strong>Angular</strong>, <strong>Java/Spring Boot</strong>, and cloud-native development to join a purpose-driven organization. In this role, youâ\u0080\u0099ll contribute to the design, development, and deployment of secure, scalable, and resilient web applications and backend services used across Canada.</span></span> <div style=\"margin-bottom: 8.0pt;margin-left: 0.0cm;margin-right: 0.0cm;margin-top: 0.0cm;text-align: center;\"> <hr></div> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><strong>Key Responsibilities:</strong></span></span> <ul> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Develop, test, and maintain modern web applications using the Angular framework.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Design and implement RESTful services using Java and Spring Boot.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Collaborate with cross-functional teams including DevOps, QA, and business stakeholders to deliver high-quality solutions aligned with organizational goals.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Build and deploy applications to cloud environments using <strong>Azure AKS</strong>, <strong>OpenShift</strong>, or <strong>Kubernetes</strong>.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Create and manage Helm charts for Kubernetes-based deployments.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Work with relational databases such as <strong>Oracle</strong>, <strong>PostgreSQL</strong>, or <strong>SQL Server</strong> to support application data needs.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Ensure code quality and maintainability through automated testing, peer reviews, and adherence to development best practices.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Contribute to architectural decisions and provide technical guidance on cloud-native strategies and DevOps integration.</span></span> </ul> <div style=\"margin-bottom: 8.0pt;margin-left: 0.0cm;margin-right: 0.0cm;margin-top: 0.0cm;text-align: center;\"> <hr></div> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><strong>Qualifications:</strong></span></span> <ul> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">5+ years of experience as a Full Stack Developer or Software Engineer.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Proficiency with <strong>Angular</strong> (v10+), <strong>TypeScript</strong>, and front-end best practices.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Strong backend development experience with <strong>Java</strong>, <strong>Spring Boot</strong>, and <strong>RESTful API design</strong>.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Hands-on experience with container orchestration platforms such as <strong>Azure Kubernetes Service (AKS)</strong>, <strong>OpenShift</strong>, or <strong>vanilla Kubernetes</strong>.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Experience deploying applications using <strong>Helm</strong> and working in CI/CD environments.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Solid understanding of relational databases (e.g., <strong>Oracle</strong>, <strong>PostgreSQL</strong>, <strong>SQL Server</strong>) and writing performant SQL queries.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Familiarity with security, compliance, and performance requirements in regulated or healthcare environments is a strong asset.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Excellent communication skills and the ability to thrive in a collaborative, mission-focused team environment.</span></span> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 30, 2025",
      "referencenumber": "4G31VGWINQ",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/34085/Full-Stack%20Developer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34227": {
      "id": "34227",
      "title": "Network Verification & Test Engineer (34227)",
      "company": "Myticas Consulting",
      "description": "<p>We are seeking a <strong>Network Verification & Test Engineer</strong> to validate the performance, reliability, and compliance of advanced networking systems. This role involves creating verification plans, executing system-level tests, automating configurations, and working with industry-standard traffic generation tools. The ideal candidate will bring a strong networking background, hands-on testing expertise, and the ability to work both independently and in collaborative team settings.</p> <hr> <h3><strong>Key Responsibilities</strong></h3> <ul> <li> <p>Develop <strong>system and subsystem verification matrices</strong> to ensure full coverage of all system requirements.</p> <li> <p>Coordinate and participate in <strong>system-level testing activities</strong>, including planning, execution, and reporting of results.</p> <li> <p>Design, develop, and maintain <strong>test cases</strong> and <strong>test beds</strong> to support various testing scenarios.</p> <li> <p>Execute tests using traffic generators (e.g., Spirent, IXIA, Test Center), packet capture tools (tcpdump), and performance tools (iPerf).</p> <li> <p>Validate networking features and performance across <strong>OSI layers</strong>, including TCP, UDP, IP networking, routing protocols, and network optimization techniques.</p> <li> <p>Implement and manage <strong>NETCONF</strong> and <strong>gRPC/gNMI</strong> for automated network device configuration.</p> <li> <p>Work with structured <strong>data formats</strong> such as JSON, JSON IETF, XML, YAML, PROTO, and <strong>REST APIs</strong> to support automation workflows.</p> <li> <p>Utilize <strong>Kubernetes (POD)</strong> and <strong>Docker</strong> containers for test environment setup and management.</p> <li> <p>Troubleshoot and resolve performance and functional issues, ensuring timely defect identification and resolution.</p> </ul> <hr> <h3><strong>Required Qualifications</strong></h3> <ul> <li> <p>Proven experience with <strong>traffic generation and analysis tools</strong> such as Spirent, IXIA, Test Center, tcpdump, and iPerf.</p> <li> <p>Strong understanding of <strong>networking fundamentals</strong>, including OSI layers, TCP/UDP/IP protocols, routing protocols, and optimization methods.</p> <li> <p>Experience configuring and automating network devices using <strong>NETCONF</strong> and <strong>gRPC/gNMI</strong>.</p> <li> <p>Proficiency with structured data formats (JSON, XML, YAML, PROTO) and <strong>REST API</strong> integration.</p> <li> <p>Familiarity with <strong>Kubernetes</strong> and <strong>Docker</strong> environments.</p> <li> <p>Strong <strong>problem-solving</strong> and <strong>analytical</strong> skills.</p> <li> <p>Ability to work independently and within cross-functional teams.</p> </ul> <hr> <h3><strong>Preferred Qualifications</strong></h3> <ul> <li> <p>Experience with <strong>Python</strong> or <strong>Ansible</strong> for network automation and orchestration.</p> <li> <p>Prior experience in <strong>network verification</strong>, <strong>system integration testing</strong>, or <strong>telecom/network equipment validation</strong>.</p> <li> <p>Exposure to performance benchmarking and large-scale test environments.</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 11, 2025",
      "referencenumber": "L628LV9285",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34227/Network%20Verification%20%26%20Test%20Engineer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Computer Networking",
      "senioritylevel": "Mid-Senior level"
    },
    "34225": {
      "id": "34225",
      "title": "Windchill Solutions Consultant (34225)",
      "company": "Myticas Consulting",
      "description": "<strong><span style=\"\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\">Windchill Solutions Consultant<br> Contract to Hire</span></span></span><br> Hybrid - Grand Rapids, MI</strong><br style=\"color: rgb(0,0,0);font-family: Arial , Helvetica , sans-serif;font-size: 13.0px;font-style: normal;font-weight: 400;letter-spacing: normal;orphans: 2;text-transform: none;widows: 2;word-spacing: 0.0px;\"> <br style=\"color: rgb(0,0,0);font-family: Arial , Helvetica , sans-serif;font-size: 13.0px;font-style: normal;font-weight: 400;letter-spacing: normal;orphans: 2;text-transform: none;widows: 2;word-spacing: 0.0px;\"> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"\">Clover Consulting (a Myticas Co.) is</span><strong><span style=\"\"> </span></strong></span></span></span><span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"\">seeking a Windchill solutions consultant for a contract to hire opportunity with a large, direct client. This role aims to support the deliverables of the global team and initiatives. As a member of the team, using Agile practices, you will lead the company to timely delivery of high-quality technical solutions that drive cross functional business strategies and initiatives.</span></span></span></span><br> <br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><strong><span style=\"\">The team you will be part of </span></strong> </span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"\">Our Engineering Systems team is a diverse and global team, supporting the people and systems in Product Lifecycle Management (PLM). Our mission is to empower our global PLM users to bring high quality products to market faster, using best-in-class technology, consistent processes and services, and trusted data that improves the product design, launch, manufacturing, and overall lifecycle management.</span></span></span></span><br> <br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><strong><span style=\"\">What You Will Be Doing:</span></strong></span></span></span><br> <br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><strong><u><span style=\"\">Key Responsibilities:</span></u></strong></span></span></span> <ul style=\"\"> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Envisioning, implementing and supporting solutions (technical or non-technical) to resolve business problems or improve business processes</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Building relationships with and consulting with client groups</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Developing system requirements and identifying alternatives for solutions that use PLM technologies </span> </ul> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><strong><u><span style=\"\">Specifically:</span></u></strong></span></span></span> <ul style=\"\"> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Implement functionality for Supplier Collaboration through Windchill ProjectLink and Supplier Management (SUMA).</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Assist in other PLM initiatives involving MPMLink & Process Plans, Plant/Enterprise Data, and our SAP S4 to Windchill Migration</span> </ul> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"> </span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><strong><u><span style=\"\">Key Skills/Abilities</span></u></strong></span></span></span> <ul style=\"\"> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Knowledge and understanding of Product Life Cycle Management business processes</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Deep Windchill background that includes Workflow Design, Type and Attribute Management, Container Strategy and Access Control Policies, Object Initialization Rules, Life Cycle Definition, Team Templates, Change Process and Templates, Vaulting and Replication, Queue Management, 3D Publishing, CAD Data Management, XBOM Management, Visual Work instructions, Parts Classification, Installation, Preferences and Properties, etc.</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Open minded, positive, can-do attitude</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Ability to build trust with peers and help others when needed</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Strong problem-solving and analytical skills</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Accomplished Project Management and organizational skills</span> <li style=\"margin-bottom: 0.0in;line-height: normal;\"><span style=\"\">Expert in communication of all forms (written, verbal, 1:1, large groups) to any audience (internal, external, peers, executives, etc.).</span> </ul> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"> </span></span></span><br> <strong><span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"\"><u>Technical Components of the position includes such tools and technologies as: </u></span></span></span></span></strong><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">PTC Products: Windchill, Creo, ThingWorx</span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">ERP Systems: SAP ECC, SAP S/4</span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">Programming Skills: Java, JavaScript, SQL</span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">Other: MS Office Suite, MS Azure DevOps</span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"> </span></span></span><br> <u><span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><strong><span style=\"\">Minimum Qualifications</span></strong></span></span></span></u><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">Bachelorâ\u0080\u0099s Degree in a related field required. </span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">Five years of experience working with Windchill and PLM business processes.</span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">Experience with integration between Windchill and ERP systems.</span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">Experience implementing ProjectLink for supplier collaboration.</span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-family: Symbol;\">Â·</span><span style=\"\">Experience implementing Windchill SUMA for supplier management.</span></span></span></span><br> <span style=\"font-size: 13.0px;\"><span style=\"color: rgb(0,0,0);\"><span style=\"font-family: Arial , Helvetica , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Experience working in an Agile (SCRUM) environment preferred</span></span></span></span></span><br>",
      "location": "",
      "country": "United States",
      "date": "August 11, 2025",
      "referencenumber": "OXFGQ7IN4R",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34225/Windchill%20Solutions%20Consultant/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Consulting",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34090": {
      "id": "34090",
      "title": "Robotic Power Automate Developer (34090)",
      "company": "Myticas Consulting",
      "description": "<p>Myticas Consulting is currently seeking <strong>2â\u0080\u00933 Robotic Power Automate Developers</strong> to support a large-scale <strong>data migration project</strong> for a confidential financial services client. This is a <strong>hybrid role</strong> based in <strong>Montreal or Toronto</strong>, with a preference for <strong>Montreal-based candidates</strong>. Candidates must be open to periodic travel to Montreal (1â\u0080\u00932 times/month, 3â\u0080\u00934 days at a time) and <strong>working shifts during production events</strong>, including some evenings/weekends.</p> <hr> <h3><strong>Project Scope:</strong></h3> <p>The successful candidates will develop, optimize, and deploy automation workflows using <strong>Power Automate Desktop (RPA)</strong> and SQL. The role focuses on <strong>data transformation and integration into legacy mainframe systems</strong>, supporting business-critical migration activities with high compliance and quality standards.</p> <hr> <h3><strong>Key Responsibilities:</strong></h3> <ul> <li> <p>Design and deploy automation workflows using <strong>Power Automate Desktop (RPA)</strong></p> <li> <p>Collaborate with business and data teams to translate migration requirements into automated processes</p> <li> <p>Write and optimize complex SQL queries, stored procedures, and data validations</p> <li> <p>Automate ETL processes for integration with mainframe environments</p> <li> <p>Monitor, troubleshoot, and resolve workflow issues</p> <li> <p>Ensure security, compliance, and maintain clear documentation and audit trails</p> <li> <p>Participate in key migration events and be available for shift-based support when needed</p> </ul> <hr> <h3><strong>Required Skills & Qualifications:</strong></h3> <ul> <li> <p>4+ years of experience in <strong>Power Automate Desktop (RPA)</strong> development</p> <li> <p>Experience with <strong>Power Platform</strong> (solution creation and deployments)</p> <li> <p>Strong <strong>SQL development</strong> skills, including stored procedures and performance tuning</p> <li> <p>Previous experience with <strong>mainframe data integration or loading</strong></p> <li> <p>Understanding of <strong>RPA architecture</strong>, workflow orchestration, and automation lifecycle</p> <li> <p>Experience working in Agile or hybrid project settings</p> <li> <p>Strong communication and troubleshooting skills</p> </ul> <hr> <h3><strong>Nice-to-Have:</strong></h3> <ul> <li> <p>Familiarity with <strong>Power Automate Cloud flows</strong> or Power Platform integrations</p> <li> <p>Knowledge of <strong>SSIS, ADF, Informatica</strong>, or middleware tools</p> <li> <p>Exposure to <strong>COBOL datasets</strong> or legacy batch processing</p> <li> <p>Experience with <strong>data mapping</strong> and transformation logic</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 31, 2025",
      "referencenumber": "BCLKBBSMF5",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34090/Robotic%20Power%20Automate%20Developer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Financial Services",
      "senioritylevel": "Mid-Senior level"
    },
    "34221": {
      "id": "34221",
      "title": "Administrative Assistant (34221)",
      "company": "Myticas Consulting",
      "description": "<p>Myticas's direct client based out of Monsey, NY is currently seeking an Administrative Assistant for a contract position.</p> <p><strong>NOTE: </strong> <br> Pay Rate: $17-18/hr on W2.<br> 100% onsite <strong>vehicle required</strong>, will be <strong>doing weekly mail runs</strong>- Working hours 9-5:30 up to 5 hours of OT weekly as needed asap</p> <p><strong>Job Description:</strong></p> We are seeking a highly motivated, highly organized applicant with a strong work ethic and a high degree of problem solving skills to join Vcorp Services. <ul> <li>This position includes drafting state/county documents, communicating with other members of the team via phone and email, managing incoming and outgoing mail for various departments, and a very professional attitude.</li> <li>Entry-level, basic computer skills needed, Microsoft office proficiency required.</li> </ul>",
      "location": "",
      "country": "United States",
      "date": "August 08, 2025",
      "referencenumber": "WRP8AT90UF",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/34221/Administrative%20Assistant/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Administrative",
      "jobindustries": "Business Supplies and Equipment",
      "senioritylevel": "Entry level"
    },
    "32542": {
      "id": "32542",
      "title": "EDW Sr. Healthcare Technical Analyst (32542)",
      "company": "Myticas Consulting",
      "description": "<p><strong>EDW Sr. Healthcare Technical Analyst</strong></p> <p><strong>Duration: </strong>12 months with possible multi-year extension/s</p> <p>Clover Consulting (a Myticas Co.) is are seeking a highly experienced <strong>EDW Sr. Healthcare Technical Analyst </strong>for a large, direct client in Springfield, IL. </p> <p><strong>Primary Responsibilities:</strong></p> <ul> <li>Gathering and analyzing technical information from various sources to be included in the documentation.</li> <li>Planning, writing, and maintaining detailed technical, operational, and process documentation.</li> <li>Leading, developing, and maintaining a library of technical and business documentation source code and reports.</li> <li>Analyze Medicaid program including claims, eligibility, and provider data supporting data warehouse downstream reporting and analytics.</li> <li>Developing and supporting technical training materials.</li> <li>Modifying existing technical documentation for business needs.</li> <li>Participating in and leading technical and business requirements sessions.</li> <li>Meeting with the project team regularly to consolidate project status and reporting.</li> <li>Engaging with the customer as needed to provide updates on technical documentation and project work.</li> <li>Working with the development and QA team to assure each document has been thoroughly reviewed and support process improvements and operational efficiency.</li> <li>Mentoring/Coaching other project team members on effective writing skills and strategies for consistency.</li> <li>Performing additional duties that are typically associated with this position, as assigned.</li> </ul> <p><strong>Required Qualifications:</strong></p> <ul> <li>5+ years of healthcare business analysis experience supporting business initiatives through data analysis, writing business requirements and user acceptance testing of various systems.</li> <li>5+ years of experience serving as a technical analyst in healthcare (payor).</li> <li>3+ years of experience working specifically with Medicaid programs, MMIS/MES or related systems.</li> <li>3+ years of experience in knowledge management creating, organizing, sharing, and optimizing knowledge within an enterprise organization using tools such as Microsoft 365, AI-enabled search, MS SharePoint/Teams, and JIRA.</li> <li>Proven ability to lead communication (written and verbal) at the customer leadership level.</li> <li>Knowledge of health insurance, HMO, and managed care principles including Medicaid and Medicare regulation.</li> <li>Ability to interpret federal and state Medicaid policy and translate it into business and technical requirements.</li> <li>Effective organizational, analytical, time management, problem-solving, and multi-tasking skills, and habits; ability to complete assignments under tight deadlines with little/no direct supervision.</li> <li>Bachelorâ\u0080\u0099s degree in business, information systems, Public Health, or a related field</li> </ul> <p><strong>Preferred Qualifications:</strong></p> <ul> <li>Masterâ\u0080\u0099s Degree in related field is preferred.</li> <li>5+ years of experience as a technical analyst in payor healthcare.</li> <li>3+ years of experience writing SQL using large-scale database management tools.</li> <li>3+ years of experience working with State Medicaid and CHIP agencies including federal reporting (CMS 64/21, TMSIS, PERM). Enterprise Data Warehouse - Sr. Healthcare Technical Analyst</li> <li>Knowledge of data integration, software enhancements/planning and agile methodologies</li> <li>Experience with using Azure DevOps, SharePoint, MS Project, Visio</li> </ul>",
      "location": "",
      "country": "United States",
      "date": "June 13, 2025",
      "referencenumber": "IC2PNW29WF",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32542/EDW%20Sr.%20Healthcare%20Technical%20Analyst/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Analyst",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "34098": {
      "id": "34098",
      "title": "Cyber Posture Management Analyst (34098)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Title: </strong>Cyber Posture Management Analyst</p> <p><strong>Type: </strong>Direct Hire</p> <p><strong>Location: </strong>Lansing, Michigan</p> <p>Clover Consulting (a Myticas Co.) has a large, direct client seeking a skilled Cyber Posture Mgmt. Analyst I to join the team as part of their Information Security & Privacy team. This position provides security analysis for the company's Identity and Access Management (IAM) Operation's program. This role requires knowledge across multiple platforms, applications, processes, and procedures to enable access management of business initiatives across the enterprise.</p> <p><strong><u>Essential Responsibilities</u></strong></p> <ul> <li>Familiar with identity and access management, with a focus on Privileged Access Management (PAM), Multi-Factor Authentication (MFA), and Identity Governance and Administration (IGA).</li> <li>Knowledge of scripting languages (e.g., PowerShell, Python) for automation and customization of IAM solutions.</li> <li>Understanding of identity protocols and technologies: OpenID Connect (OIDC,) OAuth, SAML, AD-Fed, API Gateways, SCIM, and platforms such as, Sailpoint, CyberArk, and MS Entra.</li> <li>Knowledge of identity & access management vulnerabilities, threats and mitigations.</li> <li>Ability to determine how a security system works (including its resilience and dependability capabilities) and how changes in conditions, operations, or the environment will affect these outcomes.</li> <li>Familiar with modern software life cycle development and automated cloud infrastructure deployment.</li> <li>Understanding of network architecture, operating systems, and security protocols.</li> <li>Ability to work independently and collaboratively in a fast-paced environment.</li> <li>Supports initiatives and projects that will improve the organizationâ\u0080\u0099s cyber posture.</li> <li>Excellent analytical and problem-solving skills.</li> <li>Strong communication and interpersonal skills.</li> <li>Understanding of security controls, risk management, and regulatory compliance (NIST CSF/SOX/GDPR/etc.).</li> <li>Extended hours, including on-call may be required.</li> </ul> <p><strong><u>Knowledge, Skills and Abilities</u></strong></p> <ul> <li>Ability to receive and incorporate feedback.</li> <li>Strong verbal and written communication skills.</li> <li>Strong attention to detail.</li> <li>Strong interpersonal, analytical, and problem-solving skills.</li> <li>Flexibility in day-to-day work.</li> <li>Ability to learn the companyâ\u0080\u0099s supported systems and their interfaces with other systems.</li> <li>Strong knowledge of Microsoft software applications.</li> <li>Ability to communicate technical concepts in an understandable fashion.</li> <li>Ability to prioritize multiple tasks and execute efficiently and effectively while demonstrating a clear sense of urgency when appropriate.</li> <li>Excellent customer service focus and skills.</li> <li>Ability to collaborate effectively in a team environment to achieve desired results.</li> <li>Scripting knowledge preferred.</li> </ul> <p><strong><u>Qualifications</u></strong></p> <ul> <li>Bachelor's Degree or equivalent experience and/or education required.</li> <li>1+ years knowledge of financial products, regulatory requirements, and business process preferred.</li> <li>Cloud Identity experience preferred.</li> <li>SC-300 Microsoft Certified Identity and Access Administrator Associate preferred.</li> <li>CISSP Certified Information Systems Security Professional preferred.</li> </ul>",
      "location": "",
      "country": "United States",
      "date": "August 05, 2025",
      "referencenumber": "9K426SH5EP",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34098/Cyber%20Posture%20Management%20Analyst/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer and Network Security",
      "senioritylevel": "Mid-Senior level"
    },
    "34132": {
      "id": "34132",
      "title": "Privileged Access Management - PAM â\u0080\u0093 BeyondTrust SMR (34132)",
      "company": "Myticas Consulting",
      "description": "<p>Myticas Consulting is actively seeking a <strong>Privileged Access Management (PAM) Subject Matter Resource (SMR)</strong> specializing in <strong>BeyondTrust Password Safe</strong> for a 3-month contract engagement with a leading client in the engineering and construction industry.</p> <p>The ideal candidate will have deep technical expertise in PAM technologies, particularly in implementing and managing BeyondTrust solutions, as well as a strong understanding of identity governance frameworks.</p> <hr> <p><strong>Key Responsibilities:</strong></p> <ul> <li> <p>Implement and manage BeyondTrust Password Safe solutions</p> <li> <p>Onboard and integrate applications with BeyondTrust (must have)</p> <li> <p>Ensure compliance with security protocols and governance frameworks</p> <li> <p>Collaborate with IT and security teams to manage privileged access</p> <li> <p>Support governance initiatives and best practices related to PAM</p> <li> <p>(Nice to have) Support and manage CyberArk Self-Hosted solutions</p> </ul> <hr> <p><strong>Qualifications:</strong></p> <ul> <li> <p>5+ years of experience in PAM or related cybersecurity roles</p> <li> <p>Strong hands-on experience with BeyondTrust Password Safe</p> <li> <p>Proven experience with application onboarding using BeyondTrust</p> <li> <p>Deep understanding of IAM principles and PAM governance frameworks</p> <li> <p>Familiarity with CyberArk Self-Hosted is a strong asset</p> </ul> <hr> <p><strong>Certifications (Required/Preferred):</strong></p> <ul> <li> <p><strong>BeyondTrust BCIE â\u0080\u0093 Password Safe Certification</strong> (Mandatory)</p> <li> <p><strong>CyberArk CDE â\u0080\u0093 Self-Hosted Certification</strong> (Preferred)</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 06, 2025",
      "referencenumber": "AS9VIBAQL5",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34132/Privileged%20Access%20Management%20-%20PAM%20%E2%80%93%20BeyondTrust%20SMR/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer and Network Security",
      "senioritylevel": "Mid-Senior level"
    },
    "32608": {
      "id": "32608",
      "title": "Sr Program Management Consultant (32608)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Sr Project Management Consultant </strong><br> <strong>Location:</strong> Waukegan, IL (3 days onsite)<br> <strong>Company:</strong> Myticas's direct client based in North Chicago, IL</p> <hr><u><strong>NOTE:</strong></u><br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\"><em><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">**Need a seasoned, <strong><span style=\"font-family: Aptos , sans-serif;\">higher level Program Management Consultant/Program Leader</span></strong>-</span></span></em></span><span style=\"color: rgb(33,33,33);\"><em><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\"><span style=\"color: black;\">managing multiple programs/projects.</span></span></span></em></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"> </span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><u><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Job Summary </span></span></u></strong></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">One of our Direct clients is looking to add a Seasoned Sr Project/Program Management Consultant to their team. </span></span></span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"> </span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><u><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\"><span style=\"color: black;\">Primary Function:</span></span></span></u></strong></span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\"><span style=\"color: black;\">Develop, execute, and manage multiple IT projects within their defined scope(s). Manage a multitude of interrelated project activities and lead all aspects of the project lifecycle, working with project sponsors/key stakeholders, team members, and management to oversee all phases of project completion. Build and manage projectâ\u0080\u0099s work breakdown structure, milestones, risks, issues, and deliverables within the constraints of human and financial resources and changing priorities to ensure the successful completion of the project. Ensure transparent reporting of project status, issues, risks, and financials.</span></span></span></span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"> </span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><u><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\"><span style=\"color: black;\">Key Responsibilities:</span></span></span></u></strong></span></span></span></span> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Initiate and Plan Project:</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Build and manage the project plan, resources, and Gantt charts to accomplish the project scope.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Collaborate with business and IT management to establish project goals, objectives, financials, and deliverables.</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Project Control and Quality Management:</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Maintain and update the RAID log to track project risks, actions, and issues.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Measure performance against the original plan and budget, ensuring compliance with corporate and functional policies and procedures.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Evaluate scope changes, issues, and risks, working with stakeholders to resolve them.</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Execute and Close Project:</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Assist in managing the process to ensure all validation deliverables are completed.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Lead the team in delivering the project scope, gather lessons learned, and obtain final project approval.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Develop and execute work plans, securing authorized resources to complete all activities.</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Project Communication:</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Make recommendations to resolve issues and manage risks based on the current project status.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Produce and distribute project reports to provide accurate status and decision support to stakeholders.</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Resource and Team Management:</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Motivate the project team to achieve desired outcomes.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Coordinate and assign resources to ensure project needs are met, effectively assign tasks based on team membersâ\u0080\u0099 abilities.</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Decisions and Financial Control:</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Track and update financials in Clarity, coordinating estimates and invoices with vendors.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Develop and manage a financial plan, maintaining spend within +/- 10% of the overall budget.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Make decisions impacting project-level activities; influence or have authority over the project budget.</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Vendor Coordination:</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Ensure vendor purchase orders (POs) are processed promptly.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Coordinate vendor activities and ensure timely milestone delivery.</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Project Meetings:</span></span> </ul> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Facilitate Project Management meetings to oversee execution activities with IT System Owner and Principal Business Systems Consultant.</span></span> </ul> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"> </span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><u><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\"><span style=\"color: black;\">Qualifications:</span></span></span></u></strong></span></span></span></span> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Bachelorâ\u0080\u0099s degree in business, Information Systems/Computer Science or related discipline.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Proven Microsoft Project, PowerPoint, Excel, and Word skills are required.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">5-10 years of experience in Information Technology project management.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Experience managing SDLC projects.</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Flexibility needed while collaborating with the global project team and vendors (eg 7 AM meetings and /or 4 pm meetings).</span></span> </ul> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"> </span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\"><span style=\"color: black;\">Preferred Qualifications:</span></span></span></span></span></span></span> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">PMP Certification</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">PPM Tool experience</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Pharmaceutical experience</span></span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Experience managing projects to deliver or enhance validated systems.</span></span> </ul> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"> </span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\"><span style=\"color: black;\">Key Stakeholders:</span></span></span></strong></span></span></span></span> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: black;background: white;vertical-align: baseline;\"><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\">Business and Technology resources; varying levels of leadership.</span></span> </ul> <p><br> This is a hybrid position requiring both remote and onsite work in Waukegan, IL.</p>",
      "location": "",
      "country": "United States",
      "date": "July 14, 2025",
      "referencenumber": "0MZUULL32N",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/32608/Sr%20Program%20Management%20Consultant/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Project Management",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "34099": {
      "id": "34099",
      "title": "Mid level Business Systems Analyst (34099)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">Job Title:</span></span></strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\"> ISRM-Business Systems Analyst</span></span></span></span><br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Location: 100% remote</span></span></strong></span></span><br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Duration: 6</span></span></strong><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\"> months</span></span></strong><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\"> (with a possibility of extension)</span></span></strong></span></span><br> <br> <span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(66,66,66);\">Description</span></span></strong></span></span></span> <p>The Business Systems Analyst will provide direct support to the Crown Jewels program within Information Security Risk Management. This individual will apply relevant principles to support projects and ongoing activities.</p> <p> </p> <p>Responsibilities: Office of Crown Jewels</p> <p>â\u0080¢ Applies analytical thinking skills to diagnose and make recommendations on systems. Incorporates knowledge of business and technology to make recommendations. Translates data gathered from user discussions into business requirements.</p> <p>â\u0080¢ Identifies business/system needs and recommends solutions. Assists with the testing strategies and develops preliminary findings. Work is performed and technical decisions are made with a high degree of independence and performance is judged by results obtained.</p> <p>â\u0080¢ Manages Crown Jewel asset lifecycle including onboarding and offboarding processes</p> <p>â\u0080¢ Maps and updates Crown Jewels data flows</p> <p>â\u0080¢ Uses appropriate tools to collect, correlate and analyze data; records and maintains technical data for use in developing operating and instruction manuals. Conducts tests; develops preliminary findings for review by experienced analysts.</p> <p>â\u0080¢ Assists in the development of standards and procedures. Prepares written reports of work. Applies and executivesâ\u0080\u0099 standard information systems theories, concepts, and techniques.</p> <p>â\u0080¢ Determines approach and solution to problem when issue is within scope of own ability. Develops solutions to problems where casual relationships can be identified, and precedents exist.</p> <p>â\u0080¢ Train others when needed.</p> <p>â\u0080¢ Works effectively with team/group to accomplish organizational goals. Actively participates in client or team meetings by offering suggestions. Provides leadership to project planning.</p> <p>â\u0080¢ Monitors and organizes the efforts of technical and business support staff. Manages projects according to milestones and completes tasks assigned by more experienced analysts and managers. Guides the efforts of less experienced staff.</p> <p>â\u0080¢ Exercises latitude in approach to problem and solution. Work is reviewed for soundness of business judgment and to determine if overall results and objectives have been achieved.</p> <p>â\u0080¢ Responsible for compliance with applicable Corporate and Divisional Policies and procedures.</p> <p>â\u0080¢</p> <p>Qualifications</p> <p>â\u0080¢ Bachelorâ\u0080\u0099s degree plus 5 years technical experience, or Masters degree plus 4 years experience preferably in Business Systems Analysis or Cybersecurity</p> <p>â\u0080¢ Systems Testing and IT Implementation experience.</p> <p>â\u0080¢ Exceptional interpersonal and communication and strong analytical skills. Proven ability to build trust, listen and ask effective questions.</p> <p>â\u0080¢ Proven track record of effective project leadership and positive results. Ability to self-manage time and priorities.</p>",
      "location": "",
      "country": "United States",
      "date": "August 05, 2025",
      "referencenumber": "KV67IYFQI4",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/34099/Mid%20level%20Business%20Systems%20Analyst/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Analyst",
      "jobindustries": "Computer and Network Security",
      "senioritylevel": "Mid-Senior level"
    },
    "32619": {
      "id": "32619",
      "title": "IT Infrastructure Manager - Manufacturing (32619)",
      "company": "Myticas Consulting",
      "description": "<p> </p> <p><strong>IT Infrastructure Manager - Manufacturing</strong><br> <strong>Direct hire</strong><br> <strong>Onsite - Orion, MI</strong><br> <br> Clover Consulting (a Myticas Co.) is seeking an <strong>IT Plant Manager</strong> for a large client in Orion, MI. This role is crucial in managing all IT-related activities at the local plant, with key responsibilities encompassing infrastructure, manufacturing software, and business operations. Local candidates are strongly preferred.<br> <br> <strong> Responsibilities</strong></p> <ul> <li>Manage daily IT activity at plant level including employee related issues.</li> <li>Assist in budget (cap-ex/allocation) for plant and corporate level.</li> <li>Maintain budget for plant related IT expenses.</li> <li>Provide direct supervision for IT Plant Support Specialist assigned to respective plant.</li> <li>Manages the third-party maintenance for network, hardware, software, and telecommunications services.</li> <li>Participate in budget planning, implementation, and monitoring for purchase and maintenance of hardware and software for the plant</li> <li>Prepare plans for applications, physical infrastructure and the acquisition of the necessary resources to support these items and assure responsiveness of the plans relating to corporate objectives.</li> <li>Manage the installation of hardware and software by others.</li> <li>Manage provisioning of end user workstations/laptops based on corporate standards.</li> <li>Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions.</li> </ul> <p><strong>Qualifications</strong></p> <ul> <li>A minimum of six years of experience in an IT Manager role.</li> <li>Bachelor's degree in Information Technology, Computer Science or a related field</li> <li>Six (6) years of experience creating strategic plans</li> <li>A minimum of four (4) years of experience working with cross-functional teams</li> <li>Four (4) years of experience managing a budget</li> <li>A minimum of 4 years of project management experience</li> <li>A minimum of three (3) years of experience training and developing direct reports</li> <li>Six (6) years of organization and planning experience</li> <li>A minimum of six years of experience with the following technical skills:</li> <li>SQL Server database software</li> <li>Microsoft operating systems and Office (Word, Excel, PowerPoint, and Access)</li> <li>VMWare</li> <li>PC</li> <li>RF</li> <li>Printing</li> <li>Server</li> <li>Network Storage systems</li> <li>Knowledge of networking</li> <li>Backup technologies to support troubleshooting efforts</li> <li>Industry based IT tools</li> <li>Must be able to regularly lift and/or move up to 30 pounds.</li> </ul> <p><br> <strong>Preferred skills/Qualifications:</strong></p> <ul> <li>IT automotive systems</li> <li>ERP such as Plex</li> <li>MES</li> <li>Plant floor applications and networks preferred.</li> </ul>",
      "location": "",
      "country": "United States",
      "date": "July 16, 2025",
      "referencenumber": "OXCMIYTV5Y",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/32619/IT%20Infrastructure%20Manager%20-%20Manufacturing/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Electrical/Electronic Manufacturing",
      "senioritylevel": "Mid-Senior level"
    },
    "34222": {
      "id": "34222",
      "title": "Senior High-Speed Analog IC Design R&D Engineer (34222)",
      "company": "Myticas Consulting",
      "description": "<p>You will be responsible for the development of integrated circuits operating at speeds greater than 100Gbaud for next-generation products. This role involves driving multiple aspects of IC product development, including circuit design, physical layout, and silicon bring-up. You will collaborate closely with teams across verification, CAD, product engineering, and test engineering to create and execute detailed design validation test (DVT) plans and device characterization strategies.</p> <hr> <p><strong>KEY SKILLS AND EXPERIENCE</strong></p> <p><strong>Minimum Experience Requirements:</strong></p> <ul> <li> <p>Proven experience in high-speed analog IC design using SiGe BiCMOS or CMOS technologies</p> <li> <p>Strong understanding of transmission lines and other high-frequency passive components</p> <li> <p>Solid grasp of device physics and its influence on analog circuit performance, along with techniques to optimize performance</p> <li> <p>Hands-on experience with RF wafer probing, lab instrumentation, and evaluation of high-speed analog ICs</p> <li> <p>Familiarity with Verilog-A and scripting languages such as Skill, Python, or shell scripts is an asset</p> <li> <p>Excellent teamwork, verbal, and written communication skills</p> </ul> <p><strong>Education Requirements:</strong></p> <ul> <li> <p>BS with 5+ years of relevant experience</p> <li> <p>MS with 3+ years of relevant experience</p> <li> <p>PhD with related academic or professional experience</p> </ul>",
      "location": "",
      "country": "United States",
      "date": "August 08, 2025",
      "referencenumber": "RQ1KK3RIQJ",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34222/Senior%20High-Speed%20Analog%20IC%20Design%20R%26D%20Engineer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Semiconductors",
      "senioritylevel": "Mid-Senior level"
    },
    "32648": {
      "id": "32648",
      "title": "RF Systems Engineer (32648)",
      "company": "Myticas Consulting",
      "description": "As a RF Systems Engineer, youâ\u0080\u0099ll be responsible for simulating and modeling the terrestrial and in-orbit communication systems for Lightspeed and support the definition of the architecture. <h2>Main Responsibilities</h2> <ul> <li>Simulate and model communication systems</li> <li>Work with system architects, RF engineers, antenna engineers, User Terminal and Landing Station engineers, to partition functions between hardware and software domains</li> <li>Model RF link performance and manage link budgets accounting for impairments through the different elements in the system</li> <li>Derive specifications for RF links and RF and antenna subsystems</li> <li>Characterize and analyze system performance. Develop and maintain performance budgets</li> <li>Provide technical support to regulatory, coordination, and market access teams</li> </ul> <h2>Education & Experience Required</h2> <ul> <li>Bachelor's degree in electrical engineering with emphasis in RF/microwave circuits or communication theory</li> <li>At least 5 years of relevant experience RF communication systems</li> <li>Knowledge of digital communication systems, spread spectrum, single and multi-carrier techniques, modulation types such as PSK, APSK, QAM</li> <li>Specific experience with modulation standard such as DVB-S2X and DVB-RCS2, as well as with Adaptive Coding and Modulation (ACM) methods</li> <li>Good experience in MATLAB or other tools for modeling and analyzing RF communication systems</li> </ul> <h2>Specialized Knowledge, Skills & Abilities</h2> <ul> <li>Experience performing analysis and simulation of communication systems</li> <li>Thorough understanding of RF passive and active components</li> <li>Good understanding of active antenna beam forming technologies including digital beam forming, and fast beam hopping</li> <li>Experience characterizing radio performance at microwave frequencies, including rain fade and its effects on the communication links</li> <li>Knowledge of RF transceiver architectures and digital communication theor</li> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 21, 2025",
      "referencenumber": "G3DP57752X",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/32648/RF%20Systems%20Engineer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Aviation and Aerospace",
      "senioritylevel": "Mid-Senior level"
    },
    "32638": {
      "id": "32638",
      "title": "DevOps Technical Analyst (32638)",
      "company": "Myticas Consulting",
      "description": "<p>The team at Myticas Consulting is seeking a self-motivated <strong>Technical Analyst</strong> to support a long-term engagement with our non for profit client. This is a 2-year contract opportunity ideal for a DevOps-savvy analyst with a strong foundation in system analysis and cloud/infrastructure operations. The ideal candidate will thrive in a collaborative environment, have a passion for automation and modern DevOps practices, and be eager to take ownership in a hands-on technical role.</p> <p><strong>Responsibilities:</strong></p> <ul> <li> <p>Manage, maintain, and enhance cloud and on-premise environments</p> </li> <li> <p>Implement and optimize CI/CD pipelines</p> </li> <li> <p>Conduct system and integration analysis to ensure high performance and availability</p> </li> <li> <p>Collaborate with development and infrastructure teams to support environment configuration and deployment</p> </li> <li> <p>Leverage monitoring tools to identify and resolve technical issues proactively</p> </li> <li> <p>Mentor junior team members and contribute to best practices documentation</p> </li> </ul> <p><strong>Qualifications:</strong></p> <p><strong>Education:</strong></p> <ul> <li> <p>A Bachelorâ\u0080\u0099s degree in Computer Science or a related field</p> </li> <li> <p>Certifications such as AWS, ITIL, or similar are an asset</p> </li> </ul> <p><strong>Experience:</strong></p> <ul> <li> <p>5+ years in system analysis, environment management, or software engineering</p> </li> <li> <p>Experience with cloud platforms and managing hybrid infrastructure</p> </li> <li> <p>Hands-on with DevOps tools and CI/CD processes</p> </li> </ul> <p><strong>Technical Skills:</strong></p> <ul> <li> <p>Proficient in APIs, RESTful services, and system integration</p> </li> <li> <p>Skilled in containerization (Docker, Kubernetes)</p> </li> <li> <p>Experience with version control tools (Git)</p> </li> <li> <p>Scripting capabilities (Python, Bash)</p> </li> <li> <p>Familiarity with monitoring and automation frameworks</p> </li> </ul> <p><strong>Soft Skills:</strong></p> <ul> <li> <p>Excellent analytical and communication skills</p> </li> <li> <p>Leadership qualities and ability to mentor others</p> </li> <li> <p>Self-starter mindset with strong organizational abilities</p> </li> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 18, 2025",
      "referencenumber": "V7Y7LKG3ZZ",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32638/DevOps%20Technical%20Analyst/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Management Consulting",
      "senioritylevel": "Mid-Senior level"
    },
    "34219": {
      "id": "34219",
      "title": "Senior Technical NetSuite Architect (34219)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Senior Technical NetSuite Architect</strong><br /> <strong>Part-Time Contract | 20â\u0080\u009330 Hours/Week | Remote (U.S.-based only)</strong></p> <p><strong>Myticas Consulting</strong> is seeking a <strong>Senior Technical Architect</strong> with deep <strong>NetSuite ERP</strong> experience to support a long-term consulting engagement for a client in the advanced manufacturing space. This role will focus on architecting an ERP system for a network of pilot plants, helping lay the foundation for scalable and compliant manufacturing operations.</p> <h3><strong>Key Responsibilities:</strong></h3> <ul> <li> <p>Gather and document business and technical requirements.</p> </li> <li> <p>Guide ERP implementation partner selection.</p> </li> <li> <p>Architect and oversee the design of a NetSuite ERP solution aligned with manufacturing needs.</p> </li> <li> <p>Serve as a technical advisor throughout the implementation.</p> </li> <li> <p>Collaborate with both internal teams and third-party vendors.</p> </li> </ul> <h3><strong>Qualifications:</strong></h3> <ul> <li> <p>8+ years in ERP architecture, with hands-on NetSuite experience.</p> </li> <li> <p>Strong understanding of manufacturing and supply chain workflows.</p> </li> <li> <p>Experience working with implementation partners and cross-functional teams.</p> </li> <li> <p>Excellent communication skills.</p> </li> <li> <p>Must be located in the U.S.</p> </li> </ul> <h3><strong>Preferred:</strong></h3> <ul> <li> <p>Background in biotech, industrial manufacturing, or regulated industries.</p> </li> <li> <p>Familiarity with compliance and data security best practices.</p> </li> </ul> <p><strong>Apply today</strong> to connect with our team and learn more about this exciting opportunity.</p>",
      "location": "",
      "country": "United States",
      "date": "August 08, 2025",
      "referencenumber": "4ZU5UT22T1",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/34219/Senior%20Technical%20NetSuite%20Architect/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Consulting",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34224": {
      "id": "34224",
      "title": "Business Systems Analyst/Product Owner (34224)",
      "company": "Myticas Consulting",
      "description": "<p><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong><span style=\"font-size:11.0pt\"><span style=\"color:black\">Title</span></span></strong><span style=\"font-size:11.0pt\"><span style=\"color:black\">: </span></span><span style=\"font-size:11.0pt\">Business Analyst/Product Owner</span></span></span><br /> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong><span style=\"font-size:11.0pt\"><span style=\"color:black\">Location: </span></span></strong><span style=\"font-size:11.0pt\"><span style=\"background-color:white\"><span style=\"color:black\">Waukegan, IL - Hybrid - 3 days Onsite / 2 Remote</span></span></span></span></span><br /> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong><span style=\"font-size:11.0pt\"><span style=\"color:black\">Duration:</span></span></strong><span style=\"font-size:11.0pt\"><span style=\"color:black\"> 6+ Months<span style=\"background-color:white\"> Contract (Potential of Extension)</span></span></span></span></span><br /> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong> </strong></span></span><br /> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong><em><u><span style=\"font-size:11.0pt\"><span style=\"color:#002060\">Top 3-5 skills needed:</span></span></u></em></strong></span></span></p> <ol> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"color:black\"><span style=\"font-family:Aptos,sans-serif\"><strong><u><span style=\"font-size:11.0pt\">Good Business Analysis experience</span></u></strong><span style=\"font-size:11.0pt\">, writing/creating requirement, and working with stakeholders.</span></span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"color:black\"><span style=\"font-family:Aptos,sans-serif\"><strong><span style=\"font-size:11.0pt\">Product Management/Product Owner</span></strong></span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"color:black\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Knowledgeable on <strong>HR systems-</strong>Workday/HCM/ServiceNow/HR management</span></span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"color:black\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Familiarity and comfort with <strong>Scrum meeting, Agile mindsets</strong>, skillsets, and methodologies.</span></span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"color:red\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\"><span style=\"color:black\">Proficient in project management, Stakeholder management, Customer and Employee Experience management - approach of managing both customer and employee interactions</span></span><span style=\"font-size:11.0pt\">.</span></span></span></span></li> </ol> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"> </span></span><br /> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong><u><span style=\"font-size:11.0pt\">Description:</span></u></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">We are seeking a talented and experienced Business Systems Analyst to join our team.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">The ideal candidate will be responsible for reviewing, analyzing, and evaluating business systems and user needs, and will document requirements, define scope and objectives, and formulate systems aligned with our overall business strategies.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">This role requires a bachelor's degree in a related area and 3-5 years of experience in the field or a related area.</span></span></span></li> </ul> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"> </span></span><br /> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong><span style=\"font-size:11.0pt\">** Key Responsibilities **</span></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Analyze business systems and user needs to develop requirements and documentation.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Define the scope and objectives of business systems projects.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Formulate systems that parallel overall business strategies.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Support mainstream skills or common HR platforms, including ServiceNow, Workday, UKG, as well as tools like</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Adobe Analytics, Power BI, and PowerApps.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Perform effective tech/vendor/solution scouting and assessment.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Engage in CX/EX management with experience or a base level understanding.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Utilize AI tools to enhance quality and throughput, maintaining a critical approach without relying on 'autopilot.'</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Manage programs and stakeholders effectively.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Plan and accomplish goals relying on experience and judgment, and perform a variety of complicated tasks.</span></span></span></li> </ul> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong> </strong></span></span><br /> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><strong><u><span style=\"font-size:11.0pt\">Expertise & Skills:</span></u></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Familiarity and comfort with Agile mindsets, skillsets, and methodologies.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Proficient in program management and stakeholder management.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">AI savvy with the ability to leverage AI tools critically.</span></span></span></li> </ul> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"> </span></span><br /> <span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">** Traits & Behaviors **</span></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">A natural learner and self-starter.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Detail- and process-oriented.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">A doer and builder, showing initiative and proactiveness.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Deeply collaborative, able to catalyze progress by leading through example.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Outcome-oriented with a focus on achieving practical results.</span></span></span></li> <li style=\"margin: 0.0cm;\"><span style=\"font-size:10.0pt\"><span style=\"font-family:Aptos,sans-serif\"><span style=\"font-size:11.0pt\">Demonstrates creativity and flexibility in task execution.</span></span></span></li> </ul>",
      "location": "",
      "country": "United States",
      "date": "August 08, 2025",
      "referencenumber": "0Y40017N1E",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34224/Business%20Systems%20Analyst%2FProduct%20Owner/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Analyst",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "32655": {
      "id": "32655",
      "title": "Workflow Application Engineer (32655)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">The team at Myticas Consulting is seeking a Workflow Applications Engineer. This role bridges engineering and operations, requiring technical expertise, strong problem-solving skills, and a passion for continuous learning. You will design, develop, and implement efficient, automated workflows across a variety o</span></span> <p>We are seeking a Workflow Applications Engineer. This role bridges engineering and operations, requiring technical expertise, strong problem-solving skills, and a passion for continuous learning. You will design, develop, and implement efficient, automated workflows across a variety of platforms and applications, ensuring smooth integration, optimized performance, and high customer satisfaction.</p> <p><strong>Essential Functions</strong></p> <ul> <li>Design and implement automated workflows tailored to customer requirements.</li> <li>Develop and deliver reliable, scalable solutions using object-oriented principles and API integrations.</li> <li>Program using proprietary tools based on Java and other scripting languages (e.g., Python, Bash).</li> <li>Collaborate with cross-functional teams including software engineering, product, and customer service to gather requirements and identify automation opportunities.</li> <li>Ensure seamless integration across cloud and on-premise systems and applications.</li> <li>Monitor application performance for availability and troubleshoot workflow issues as needed.</li> <li>Clearly communicate complex technical concepts to both technical and non-technical audiences.</li> <li>Maintain comprehensive documentation of workflows, codebases, and technical solutions.</li> <li>Manage multiple concurrent projects, tasks, and requests in a dynamic environment.</li> </ul> <p><strong>Requirements</strong><br> <strong>Required Qualifications and Skills</strong></p> <ul> <li>Bachelorâ\u0080\u0099s degree in Computer Science, Information Technology, Software Engineering, or equivalent experience.</li> <li>Strong grasp of object-oriented programming and coding fundamentals.</li> <li>Hands-on experience with APIs, integrations, scripting, and command-line tools in Linux/Unix environments.</li> <li>Proficient in Java or scripting languages such as Python or Bash.</li> <li>Experience working with XML and JSON data formats.</li> <li>Excellent debugging, testing, and troubleshooting capabilities.</li> <li>Effective written and verbal communication skills.</li> <li>Familiarity with workflow automation tools and platforms.</li> <li>Proven ability to work both independently and collaboratively.</li> <li>Strong organizational skills and attention to detail in multitasking environments.</li> </ul> <p><strong>Preferred Experience</strong></p> <ul> <li>Knowledge of cloud platforms such as AWS, Azure, or GCP and related virtualization strategies.</li> <li>Experience with databases such as PostgreSQL and Elasticsearch.</li> <li>Background in technical support, solution architecture, or project management.</li> <li>Familiarity with Agile methodologies or startup environments.</li> <li>Experience in the media, entertainment, publishing, or digital media sectors.</li> </ul> <p><strong>Additional Requirements</strong></p> <ul> <li>Availability for occasional work during weekends, nights, or early mornings.</li> <li>Strong interpersonal skills with a customer-focused mindset.</li> <li>Enthusiasm for continuous learning and adapting to emerging technologies.</li> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">f platforms and applications, ensuring smooth integration, optimized performance, and high customer satisfaction.</span></span><br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><strong>Essential Functions</strong></span></span> <ul> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Design and implement automated workflows tailored to customer requirements.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Develop and deliver reliable, scalable solutions using object-oriented principles and API integrations.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Program using proprietary tools based on Java and other scripting languages (e.g., Python, Bash).</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Collaborate with cross-functional teams including software engineering, product, and customer service to gather requirements and identify automation opportunities.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Ensure seamless integration across cloud and on-premise systems and applications.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Monitor application performance for availability and troubleshoot workflow issues as needed.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Clearly communicate complex technical concepts to both technical and non-technical audiences.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Maintain comprehensive documentation of workflows, codebases, and technical solutions.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Manage multiple concurrent projects, tasks, and requests in a dynamic environment.</span></span> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><strong>Requirements</strong></span></span><br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><strong>Required Qualifications and Skills</strong></span></span> <ul> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Bachelorâ\u0080\u0099s degree in Computer Science, Information Technology, Software Engineering, or equivalent experience.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Strong grasp of object-oriented programming and coding fundamentals.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Hands-on experience with APIs, integrations, scripting, and command-line tools in Linux/Unix environments.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Proficient in Java or scripting languages such as Python or Bash.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Experience working with XML and JSON data formats.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Excellent debugging, testing, and troubleshooting capabilities.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Effective written and verbal communication skills.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Familiarity with workflow automation tools and platforms.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Proven ability to work both independently and collaboratively.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Strong organizational skills and attention to detail in multitasking environments.</span></span> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><strong>Preferred Experience</strong></span></span> <ul> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Knowledge of cloud platforms such as AWS, Azure, or GCP and related virtualization strategies.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Experience with databases such as PostgreSQL and Elasticsearch.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Background in technical support, solution architecture, or project management.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Familiarity with Agile methodologies or startup environments.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Experience in the media, entertainment, publishing, or digital media sectors.</span></span> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><strong>Additional Requirements</strong></span></span> <ul> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Availability for occasional work during weekends, nights, or early mornings.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Strong interpersonal skills with a customer-focused mindset.</span></span> <li style=\"margin: 0.0cm 0.0cm 8.0pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\">Enthusiasm for continuous learning and adapting to emerging technologies.</span></span> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 23, 2025",
      "referencenumber": "5ZXFDXV7NE",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/32655/Workflow%20Application%20Engineer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34107": {
      "id": "34107",
      "title": "Senior Machine Learning Engineer - MLOps & Platform Engineering (34107)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Weâ\u0080\u0099re currently seeking a seasoned Machine Learning Engineer who thrives at the intersection of data science, engineering, and operations. This role is ideal for someone who has not only mastered the craft of building and scaling ML solutions, but also knows how to put them into production, and keep them running smoothly.</span></span><br> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>What Youâ\u0080\u0099ll Be Doing:</strong></span></span><br> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">The role is a mix of MLOps, platform development, and hands-on model engineering. Youâ\u0080\u0099ll be responsible for designing automated workflows that take ML models from development to deployment with minimal friction. This includes developing robust CI/CD pipelines (preferably using Azure DevOps or GitHub Actions) and managing model lifecycle tasks such as versioning, monitoring, and retraining.</span></span><br> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">A large portion of your time will be spent working within Databricksâ\u0080\u0094developing feature pipelines, optimizing model workflows, and integrating ML components with existing SaaS systems. Youâ\u0080\u0099ll also help migrate and scale models within an environment already hosting over 100 ML models, with another 25+ targeted for transition.</span></span><br> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">On the application side, youâ\u0080\u0099ll work closely with data scientists to productionalize machine learning prototypes. Youâ\u0080\u0099ll select appropriate algorithms, build scalable ML systems using Python-based frameworks like TensorFlow and PyTorch, and help tune and evaluate performance over time.</span></span><br> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>The Ideal Candidate Brings:</strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">5+ years of experience in software, data, or DevOps engineering rolesâ\u0080\u0094with at least 3 of those focused on MLOps or ML engineering.</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Expertise in Python, and confidence working with key ML frameworks (TensorFlow, PyTorch, scikit-learn).</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Hands-on experience working in the Microsoft Azure ecosystemâ\u0080\u0094particularly Azure ML, AKS, and Azure DevOps.</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Deep familiarity with Databricks (including Delta Lake, MLflow, and Apache Spark) is non-negotiable.</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">An understanding of infrastructure-as-code (e.g., Terraform), version control, and CI/CD practices in ML workflows.</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Strong communication skills and the ability to work cross-functionally across technical and business teams.</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">You must be located in Canada and able to work with Canadian teams.</span></span> </ul> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>Additional:</strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Certifications from Databricks or Microsoft (e.g., Azure Solution Architect).</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Experience working with LLM libraries or frameworks like transformers, trl, or deepspeed.</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Prior involvement in ML model migration projects or SaaS ML platform integration.</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">A consulting background or client-facing role where clear communication and stakeholder management were key.</span></span> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 06, 2025",
      "referencenumber": "FWV879LKMM",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34107/Senior%20Machine%20Learning%20Engineer%20-%20MLOps%20%26%20Platform%20Engineering/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34087": {
      "id": "34087",
      "title": "SAP Data Migration Lead (34087)",
      "company": "Myticas Consulting",
      "description": "<p>Myticas Consulting is actively seeking an experienced <strong>SAP Data Migration Lead</strong> for a high-impact, long-term contract with our client in the natural resources sector. This role is based in <strong>Vancouver, BC</strong> and follows a <strong>hybrid model</strong> with <strong>20â\u0080\u009330% travel</strong>.</p> <p>The selected candidate will lead the <strong>data migration stream</strong> as part of an SAP S/4HANA and Ariba implementation. Weâ\u0080\u0099re looking for a hands-on leader who can architect, manage, and deliver high-quality data conversion solutions.</p> <hr> <h3><strong>Responsibilities:</strong></h3> <ul> <li> <p>Lead the SAP S/4HANA and Ariba data migration stream</p> <li> <p>Manage data conversion activities across the full lifecycle: design, build, test, validation, cutover</p> <li> <p>Set up data migration technical architecture using <strong>Syniti ADMM</strong></p> <li> <p>Provide technical direction to the data conversion team</p> <li> <p>Collaborate with functional teams to map and transform source data</p> <li> <p>Conduct data profiling, cleansing, and reconciliation</p> <li> <p>Develop and monitor data quality dashboards and pre/post-validation reports</p> </ul> <hr> <h3><strong>Required Qualifications:</strong></h3> <ul> <li> <p><strong>5â\u0080\u009310 years of SAP MDM/Data Migration experience</strong></p> <li> <p>Minimum of <strong>5 full-cycle SAP implementations</strong></p> <li> <p><strong>Expertise with Syniti ADMM (Advanced Data Migration and Management)</strong><br> (Candidates with <strong>BODS only</strong> will be considered after Syniti profiles)</p> <li> <p>Experience loading S/4HANA data using IDOCs, LTMC/LTMOM, LSMW, and custom methods</p> <li> <p>Strong hands-on experience in SQL and data analysis tools</p> <li> <p>Proven knowledge of SAP data objects and functional modules:</p> <ul> </ul><li> <p>FI, CO (Record to Report)</p> <li> <p>MM, IM, EWM (Procure to Pay)</p> <li> <p>PM, QM, IBP, PS, HR</p> </ul> <hr> <h3><strong>Preferred Experience:</strong></h3> <ul> <li> <p>Data migration project experience in the <strong>Energy or Natural Resources sector</strong></p> <li> <p>Deep hands-on knowledge of Syniti ADMM tools:</p> <ul> </ul><li> <p>Snapshot Management (data extraction)</p> <li> <p>Quality Module (profiling, dashboards)</p> <li> <p>Syniti Match, Construct, Migrate apps</p> <li> <p>Data migration cockpit and LTMOM</p> <li> <p>Data orchestration and CDC (Change Data Capture)</p> <li> <p>Security features (encryption, masking, user management)</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 31, 2025",
      "referencenumber": "UTKR956X7Z",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34087/SAP%20Data%20Migration%20Lead/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34089": {
      "id": "34089",
      "title": "Senior IAM Consultant (34089)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Job Title: Senior Identity and Access Management (IAM) Consultant â\u0080\u0093 Oracle 12C OIM Data Migration</strong></p> <p><strong>Background:</strong></p> <p>Ontario Healthâ\u0080\u0099s <strong>ONE ID</strong> service is a secure identity management solution utilized by the Ministry of Health and Long-Term Care, as well as numerous healthcare organizations across Ontario. It enables secure access to patient health information (PHI) through a single set of login credentials while upholding stringent privacy and security standards.</p> <p>The ONE ID platform is based on the Oracle Identity and Access Management suite, including Oracle Access Manager (OAM), Oracle Unified Directory (OUD), Oracle Identity Manager (OIM), Oracle Database, Microsoft Active Directory (AD), and custom Ontario Health systems.</p> <p>Ontario Health is undertaking an upgrade to Oracle 12C IAM and requires the services of a <strong>Senior Identity and Access Management Consultant</strong> to support the data migration and integration activities necessary to transition from Oracle 10G/11G to 12C. The consultant will be embedded within a dedicated project team responsible for the 12C Oracle IAM upgrade.</p> <hr> <h3><strong>Must-Have Qualifications:</strong></h3> <ul> <li> <p>Minimum 7 years of experience as a Solution Architect on Oracle Identity and Access Management systems (10G, 11G, 12C).</p> <li> <p>Minimum 7 years of experience with 12C Oracle Identity Governance (OIG), including successful migration of user, service enrollment, and organizational data from 10G to 12C.</p> <li> <p>Minimum 5 years of experience configuring 11G OIM and 12C OIG in a multi-data center (MDC) environment.</p> <li> <p>Minimum 7 years of experience integrating Oracle IAM suite components: OAM, OIM, OUD/OVD, Oracle HTTP Server (OHS), Microsoft Active Directory, and Oracle databases.</p> <li> <p>Minimum 5 years of experience tuning Oracle IAM for high availability on WebLogic and Linux platforms.</p> <li> <p>Experience designing and creating services and applications for enrollment in 12C OIG using native interfaces.</p> <li> <p>Experience configuring connectors and disconnected resources for service/application enrollment in 12C OIG.</p> <li> <p>Must be associated with a recognized Gold Oracle IAM Partner.</p> <li> <p>Expertise in SAML 2.0 and OAuth 2.0 protocols.</p> <li> <p>Proven ability to translate conceptual, logical, and physical application architectures aligned to business and technical goals.</p> <li> <p>Strong written and verbal communication skills with the ability to clearly articulate technical issues and propose viable solutions.</p> <li> <p>Ability to produce comprehensive technical documentation including design, deployment, and integration guides.</p> </ul> <hr> <h3><strong>Responsibilities:</strong></h3> <ul> <li> <p>Collaborate with Ontario Health teams to design and configure 12C OIG in a multi-data center setup for both lower and upper environments.</p> <li> <p>Integrate Phase 1 of 12C MDC with the existing 10G ONE ID system to enable interoperability for user and service transition.</p> <li> <p>Create and maintain service/application enrollments in 12C OIG.</p> <li> <p>Develop enrollment flows for individual services/applications.</p> <li> <p>Document design, installation, configuration, and integration procedures across all environments.</p> <li> <p>Collaborate with the Applications and Architecture teams to resolve cross-domain and technical issues related to the 12C implementation (e.g., return URL configuration).</p> <li> <p>Work closely with database, networking, and infrastructure teams at Ontario Health.</p> <li> <p>Provide weekly progress updates to team leads and the project manager.</p> </ul> <hr> <h3><strong>Desired Skills:</strong></h3> <ul> <li> <p>Experience with the Oracle IAM Suite Plus and Microsoft Active Directory Suite.</p> <li> <p>In-depth knowledge of IAM best practices.</p> <li> <p>Experience integrating business applications with Oracle IAM and Microsoft AD.</p> <li> <p>Strong troubleshooting skills for diagnosing and resolving IAM-related issues.</p> <li> <p>Experience with service and user identity development in OIM and OIG.</p> <li> <p>Understanding of IT security concepts, especially PKI, encryption, TLS/SSL.</p> <li> <p>Proficiency in Agile development methodologies and Continuous Integration/Continuous Deployment (CI/CD).</p> <li> <p>Familiarity with JIRA and Confluence.</p> <li> <p>Ability to collaborate with:</p> <ul> <li> <p>Internal and external stakeholders to assess integration needs.</p> <li> <p>Architects and policy/security teams across domains.</p> <li> <p>Solution vendors and development teams to ensure architectural compliance.</p> <li> <p>External organizations (e.g., Ministry of Health, Canada Health Infoway) to ensure alignment.</p> </ul> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 31, 2025",
      "referencenumber": "KKRF6N9ZMG",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/34089/Senior%20IAM%20Consultant/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Consulting",
      "jobindustries": "Computer and Network Security",
      "senioritylevel": "Mid-Senior level"
    },
    "34105": {
      "id": "34105",
      "title": "MuleSoft Developer & Integration Consultant (34105)",
      "company": "Myticas Consulting",
      "description": "<p>Our client is seeking a seasoned <strong>MuleSoft Developer & Integration Consultant</strong> to join their Integration and Data Management team. The successful candidate will be responsible for redesigning an existing integration model by introducing MuleSoft to interact with SAP systems.</p> <p><strong>Key Responsibilities:</strong></p> <ul> <li> <p>Collaborate with cross-functional teams to redesign integration architecture</p> <li> <p>Develop and implement MuleSoft solutions using Anypoint Platform</p> <li> <p>Build APIs, configure schedulers, and design event-based integration patterns</p> <li> <p>Leverage DataWeave for complex data mapping, transformation, and design</p> <li> <p>Integrate SAP systems with MuleSoft for seamless data exchange</p> <li> <p>Participate in Agile delivery cycles and contribute to architectural planning</p> <li> <p>Support CI/CD processes and version control using modern DevOps tools</p> </ul> <p><strong>Required Qualifications:</strong></p> <ul> <li> <p>4+ years of experience in integration development roles</p> <li> <p>4+ years of hands-on experience with MuleSoft Anypoint Platform</p> <li> <p>Expertise in MuleSoft APIs, configuration, customization, and patterns</p> <li> <p>Strong proficiency with DataWeave for advanced data mapping</p> <li> <p>Demonstrated experience integrating SAP using MuleSoft</p> <li> <p>Solid understanding of integration architecture and methodologies</p> <li> <p>Proven success delivering large-scale enterprise projects in Agile environments</p> <li> <p>Technical background in Java, HTML, XML, Kafka, GitHub Actions, Confluence, Jira</p> <li> <p>Bachelorâ\u0080\u0099s degree in Computer Science, Engineering, or related field</p> </ul> <p><strong>Nice-to-Have:</strong></p> <ul> <li> <p>MuleSoft Certified Developer â\u0080\u0093 Level 1 or Level 2</p> </ul> <p><strong>Additional Notes:</strong></p> <ul> <li> <p>Preference for candidates located in Calgary with hybrid availability (3 days/week onsite)</p> <li> <p>Remote candidates across Canada will also be considered if not based in Calgary</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 06, 2025",
      "referencenumber": "LK2U3AYWOX",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34105/MuleSoft%20Developer%20%26%20Integration%20Consultant/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "32539": {
      "id": "32539",
      "title": "Business Intelligence Business Objects SQL Developer (32539)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Location:</strong> Remote (with occasional travel to Springfield, Illinois)</p> <p><strong>Contract: </strong>12 months with possibly multiyear extension/s</p> <p><strong>Functional Description: </strong></p> <p>Clover Consulting (a Myticas Co.) is seeking a skilled and experienced BI BusinessObjects/SQL Developer to design, develop, and maintain business intelligence solutions using SAP BusinessObjects and SQL. This role supports Medicaid/CHIP claims and other healthcare data systems, ensuring accurate reporting and data integrity for state and federal stakeholders.</p> <p><strong>Key Responsibilities:</strong></p> <ul> <li>Design, develop, and maintain BusinessObjects reports using Medicaid/CHIP claims and subsystem data.</li> <li>Write, optimize, and maintain complex SQL scripts and queries for data marts and reporting.</li> <li>Create and manage BusinessObjects Universes and metadata layers.</li> <li>Develop and maintain database systems to support efficient data storage and reporting.</li> <li>Manage server backups and ensure system reliability.</li> <li>Collaborate with stakeholders to gather requirements and recommend technical solutions.</li> <li>Participate in unit, integration, and system testing.</li> <li>Provide regular project updates to customers and maintain strong communication.</li> <li>Mentor junior team members and provide technical training as needed.</li> <li>Stay current with emerging technologies and industry best practices.</li> <li>Perform additional duties as required to support project and organizational goals.</li> </ul> <p><strong>Required Qualifications:</strong></p> <ul> <li>5+ years of experience in SAP BusinessObjects development and reporting including report Universe designing.</li> <li>5+ years of SQL development, including 4+ years of performance tuning.</li> <li>2+ years of experience in data warehouse projects.</li> <li>2+ years of experience with Teradata (v15+), including SQL Assistant.</li> <li>Strong communication skills and the ability to work directly with clients.</li> <li>Bachelorâ\u0080\u0099s or advanced degree in IT, Computer Science, Mathematics, Statistics, or a related field.</li> <li>Excellent organizational skills and ability to manage multiple priorities.</li> <li>Strong team collaboration and adaptability.</li> </ul> <p><strong>Preferred Qualifications: </strong></p> <ul> <li>2+ years of experience as Business Objects server administrator</li> <li>Familiarity with Medicaid, Medicare, or healthcare-related applications.</li> <li>Experience with Tableau or BusinessObjects version upgrades. 2025 Business Intelligence (BI) Business Objects/S</li> </ul>",
      "location": "",
      "country": "United States",
      "date": "June 13, 2025",
      "referencenumber": "MJRF5200RP",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32539/Business%20Intelligence%20Business%20Objects%20SQL%20Developer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34100": {
      "id": "34100",
      "title": "Associate Business Systems Consultant (34100)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">Job Title: </span></span></strong></span></span>Associate Business Systems Consultant <br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Location: </span></span></strong></span></span> South San Francisco, CA (<strong>Hybrid</strong>-3 days Onsite/2 Remote)<br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Duration: 12 </span></span></strong><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">months</span></span></strong><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\"> (with a possibility of extension)</span></span></strong></span></span><br> <p><strong>Required Qualifications/Experience:</strong></p> <ul> <li>Bachelorâ\u0080\u0099s Degree with 6 yearsâ\u0080\u0099 experience; Masterâ\u0080\u0099s Degree with 5 yearsâ\u0080\u0099 experience; PhD with 0 yearsâ\u0080\u0099 experience.</li> <li>Pharma familiar and life science awareness</li> <li><strong>Linux and cloud </strong>familiarity </ul> <br> <strong>Job Description Summary: </strong> <p>Experienced Business Systems Consultant to work across multiple business areas (Precision Medicine, Genomic Research Center & Corporate Business & Strategy OIice) gathering requirements, helping the business to form strategy roadmaps and providing</p> informal project management duties.<br> Default point of contact for BTS with the business; brokers contracts between BTS and the business and resolves client and BTS relationship issues.<br> Manages and provides expert advice on, the selection, design, justification, implementation and business use of information systems. Analyzes business processes; elicits, analyzes, and documents business requirements; identifies alternative solutions, assesses feasibility and makes recommendations typically seeking to exploit and leverage new or existing technology components.<br> Translates business requirements into functional requirements; performs data and process modeling; manages change; and leads, coordinates / performs testing, verification, and validation of requirements.<br> <br> <strong>Job Responsibilities:</strong> <ul> <li>Elicits and communicates the organizationâ\u0080\u0099s business strategy; works directly with business unit clients to understand specific business processes and needs and opportunities for improvement; identifies IT capabilities and information required to support the business processes and collaborates in the development of appropriate information management strategies, developing them as an integrated part of the business strategy.</li> <li>Responsible for compliance with applicable Corporate and Divisional Policies and procedures.</li> <li>Identifies current and emerging business needs and evaluates alternative technology solutions using standard information systems methodologies and best practices.</li> <li>Proactively seek out strategic business opportunities with business unit executives for the application of new or existing technology capabilities.</li> <li>Develops technology strategies that meet the requirements of the business. Identifies the business benefits of alternative strategies. Ensures compliance between business</li> <li>strategies and technology directions. Prepares testing plans to confirm that requirements and system design are accurate and complete.</li> <li>Conducts training. Identify process disconnects and translate them into improvement opportunities with cost savings or avoidance, productivity improvements, or revenue generating business benefits. Develops business relationships and integrates activities with other BTO's to ensure successful implementation and support of project eIorts.</li> <li>Manages relationships between clients involved and BTOs to assure eIective communication between the groups is occurring. Brokers services within BTS community on behalf of customers; coordinates system solutions.</li> <li>Allies with other BTS functional areas to remain current on project status, and inform customer management of progress; conversely, keeps BTS managers aware of user issues and resolves conflicts.</li> <li>Identifies the impact of any relevant statutory, internal or external regulations on the organization's use of information.</li> <li>Exercises considerable latitude in determining objectives of assignment. Has defined authority and responsibility for a significant area of work, including technical, financial and quality aspects. Establishes organizational objectives and delegates assignments.</li> <li>Accountable for actions and decisions taken by self and subordinates.</li> <li>Accountable for the accuracy of the fit of the proposed solution to the business needs and the information upon which the business justification and prioritization decisions are made. Also accountable for communicating the business need and drivers to development groups to assure the implementation phase can fulfill the business need.</li> </ul>",
      "location": "",
      "country": "United States",
      "date": "August 05, 2025",
      "referencenumber": "8KRWRWV5FN",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34100/Associate%20Business%20Systems%20Consultant/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Consulting",
      "jobindustries": "Biotechnology",
      "senioritylevel": "Mid-Senior level"
    },
    "32662": {
      "id": "32662",
      "title": "D365 Trainer - SharePoint (32662)",
      "company": "Myticas Consulting",
      "description": "<p>Our client is seeking a highly experienced <strong>D365 Trainer with SharePoint expertise</strong> to support a national training and information management initiative. The ideal candidate will have a deep understanding of Microsoft 365 (D365), SharePoint (on-premise and online), and experience in developing training programs, videos, and instructional content for users across varied departments and time zones.<br> <u><strong>Mandatory Active SECRET clearance</strong></u></p> <hr> <h3><strong>Key Responsibilities:</strong></h3> <ul> <li> <p>Develop and deliver <strong>training videos</strong> and <strong>step-by-step guides</strong> for users on SharePoint (on-premise) and Defence 365 features.</p> <li> <p>Build and maintain a <strong>SharePoint Online Training site</strong> with how-to content, videos, and best practices.</p> <li> <p>Conduct training sessions for <strong>new Site Owners</strong> using training packages and sandbox environments.</p> <li> <p>Collaborate with the Communications (CO) and Information Management (IM) teams to design onboarding/orientation training for new team members.</p> <li> <p>Design and deploy <strong>Power Apps</strong> for automating team member intake forms and leadership processes.</p> <li> <p>Create an internal <strong>Wiki</strong> with approval workflows to replace DWAN-only resources on D365.</p> <li> <p>Support users in navigating the Microsoft Tenant environment post-launch.</p> <li> <p>Perform <strong>daily web administration</strong> for over 1,200 SharePoint sites.</p> <li> <p>Lead <strong>biweekly Information Management Working Groups</strong> and L1/L2 sessions to distribute updates and training.</p> <li> <p>Host <strong>monthly deployed Information Management sessions</strong> for field IMOs.</p> </ul> <hr> <h3><strong>Qualifications:</strong></h3> <ul> <li> <p>Proven expertise in <strong>D365</strong> and <strong>SharePoint (Online & On-Premise)</strong></p> <li> <p>Experience in instructional design and e-learning/training video creation</p> <li> <p>Strong experience with Power Apps and workflow automation</p> <li> <p>Comfortable presenting to and training users of varying technical skill levels</p> <li> <p>Ability to manage and administer large-scale SharePoint environments</p> <li> <p>Active <strong>SECRET clearance</strong> required</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 24, 2025",
      "referencenumber": "0EXABDBTNZ",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32662/D365%20Trainer%20-%20SharePoint/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Education",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "32563": {
      "id": "32563",
      "title": "Digital Marketing Consultant (32563)",
      "company": "Myticas Consulting",
      "description": "Clover Consulting has a direct client in Grand Rapids, MI in need of a Digital Marketing Consulting to support Search Engine Optimization activities. This is an ON-SITE role starting as a 5 months contract, with likely extensions. Candidates local to the Grand Rapids area, are preferred. Qualified candidates please provide resume. Thank you!<br> <table id=\"Master_PageContentPlaceHolder_screen_selectedTab_beelineForm_generalSection_Body\"> <tbody> <tr id=\"Master_PageContentPlaceHolder_screen_selectedTab_beelineForm_jobDescriptionTextRow\"> <th id=\"Master_PageContentPlaceHolder_screen_selectedTab_beelineForm_jobDescriptionTextLabel\">Job Description (Visible to Supplier):</th> <td>Digital Marketing Contractor â\u0080\u0093 Job Responsibilities<br> <br> In response to evolving digital marketing priorities and the growing importance of AI in search, we are expanding the role of our current SEO lead and seeking a Digital Marketing Contractor to provide support for core SEO responsibilities. This role will help ensure continuity in execution and performance monitoring while allowing the team to focus on broader strategic initiatives. The contractor will support global SEO operations and partner with market teams to enhance visibility, discoverability, and performance across digital properties.<br> <br> Duration: July â\u0080\u0093 December 2025, with potential extension<br> Location: Grand Rapids, MI (Onsite)<br> Reports to: Global SEO Lead<br> <br> Key Responsibilities<br> <br> Operational SEO Execution<br> â\u0080¢ Conduct keyword research to support market-level needs and content planning.<br> â\u0080¢ Perform technical SEO audits using tools like Ahrefs and Google Search Console.<br> â\u0080¢ Support content optimization efforts, including metadata, on-page structure, and internal linking.<br> â\u0080¢ Compile and deliver monthly SEO performance reports using platforms such as Ahrefs, Heap, and GSC.<br> â\u0080¢ Troubleshoot SEO issues reported by markets and provide actionable solutions.<br> â\u0080¢ Leverage AI tools and approaches to generate recommendations for content optimization, keyword discovery, link-building, and landing page refinement.<br> â\u0080¢ Integrate AI-enabled tools to automate repetitive SEO tasks and improve execution speed and scalability.<br> <br> SEO Training and Enablement<br> â\u0080¢ Assist in delivering SEO onboarding sessions and office hours for market teams.<br> â\u0080¢ Help maintain and update SEO playbooks, best practices, and documentation on SharePoint.<br> â\u0080¢ Create or revise modular self-serve resources to enable independent market optimization.<br> â\u0080¢ Support the creation and management of a centralized SharePoint hub for training.<br> <br> Performance Monitoring and Insights<br> â\u0080¢ Support organic search sentiment analysis and reputation tracking.<br> â\u0080¢ Monitor and extract insights from dashboards (Heap, Ahrefs) to identify trends and risks.<br> â\u0080¢ Assist in evaluating SEO impact for major product launches and post-launch performance reviews.<br> â\u0080¢ Apply AI-powered tools to surface deeper insights from large-scale performance data.<br> <br> Collaboration and Coordination<br> â\u0080¢ Work cross-functionally with content, analytics, and technical teams to integrate SEO best practices.<br> â\u0080¢ Participate in global team meetings or planning sessions to ensure SEO considerations are included.<br> â\u0080¢ Escalate technical SEO issues or strategic risks to the Global SEO Lead.<br> <br> Tool and Vendor Support<br> â\u0080¢ Assist with user access management, licensing coordination, and onboarding for SEO tools.<br> â\u0080¢ Support evaluations of SEO tool usage and effectiveness.<br> â\u0080¢ Coordinate with vendors to troubleshoot issues or implement platform improvements.<br> <br> ?<br> <br> Qualifications<br> â\u0080¢ 5+ years of experience in digital marketing and hands-on SEO in global or multi-market settings.<br> â\u0080¢ Proficiency with SEO tools like Heap, Ahrefs, Google Search Console, and Lumar (or equivalent).<br> â\u0080¢ Strong analytical skills; able to turn performance data into clear, actionable insights.<br> â\u0080¢ Excellent writing and editing skills, with an understanding of search-optimized content.<br> â\u0080¢ Demonstrated experience creating or reviewing metadata, headers, and on-page copy for SEO.<br> â\u0080¢ Familiarity with CMS platforms and technical SEO concepts (indexing, crawling, Core Web Vitals).<br> â\u0080¢ Strong understanding of how AI can be applied to SEO (e.g., prompt engineering, content summarization, automated content audits, keyword clustering).<br> â\u0080¢ Experience working with cross-functional teams across content, marketing, and tech.<br> â\u0080¢ Ability to work independently, manage multiple priorities, and adapt in a fast-paced environment.<br> </td> </tr> </tbody> </table>",
      "location": "",
      "country": "United States",
      "date": "June 23, 2025",
      "referencenumber": "H6F2N5SOV4",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/32563/Digital%20Marketing%20Consultant/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Marketing",
      "jobindustries": "Marketing and Advertising",
      "senioritylevel": "Mid-Senior level"
    },
    "34134": {
      "id": "34134",
      "title": "Google Cloud Practice Leader â\u0080\u0093 Delivery Consulting (34134)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">Overview</span></strong><br> <span style=\"\">We are looking for a strategic and hands-on leader to spearhead our Google Cloud Platform (GCP) practice. This senior-level role is designed for someone who thrives at the intersection of technical delivery, client consulting, and business growth. Youâ\u0080\u0099ll be instrumental in shaping and scaling a high-performing GCP services organizationâ\u0080\u0094overseeing delivery excellence, building innovative cloud offerings, and enabling client success across industries.</span></span></span><br> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">This is an ideal opportunity for a consulting-oriented leader who not only understands the GCP ecosystem but is also energized by building teams, solutions, and long-term client relationships.</span></span></span><br> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">RESPONSIBILITIES</span></strong></span></span><br> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">Practice Leadership & Growth</span></strong></span></span> <ul style=\"list-style-type: circle;\"> </ul><li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Build, scale, and oversee the GCP services practice with accountability for delivery success, client satisfaction, and team development.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Guide strategic initiatives and collaborate with cross-functional leaders to align cloud offerings with business priorities.</span></span></span> </ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">Technical Leadership</span></strong></span></span> <ul style=\"list-style-type: circle;\"> </ul><li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Serve as a senior technical authority for GCP engagementsâ\u0080\u0094able to lead architecture discussions and solution reviews without needing to operate at a granular API level.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Drive high-level design and implementation strategies, working closely with technical teams and client stakeholders.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">Client Engagement & Delivery Oversight</span></strong></span></span> <ul style=\"list-style-type: circle;\"> </ul><li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Act as a trusted advisor for enterprise customers, helping them realize the value of GCP technologies within their digital transformation journeys.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Ensure best-in-class delivery execution across projectsâ\u0080\u0094owning accountability for timelines, outcomes, and quality standards.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">Business Development & Sales Enablement</span></strong></span></span> <ul style=\"list-style-type: circle;\"> </ul><li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Support pre-sales activities including opportunity shaping, proposals, solutioning, and go-to-market efforts.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Partner with internal teams and external clients to evangelize service offerings and identify new revenue opportunities.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">Innovation & Enablement</span></strong></span></span> <ul style=\"list-style-type: circle;\"> </ul><li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Develop reusable delivery frameworks, methodologies, and assets to accelerate service delivery.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Represent the GCP practice in external forums and internal strategy discussionsâ\u0080\u0094helping raise visibility and influence roadmaps.</span></span></span> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">EXPERIENCE</span></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">10+ years of experience in IT consulting, cloud delivery, or professional services environments.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Strong technical foundation in GCP, with a proven ability to guide architectural conversations and lead multi-disciplinary delivery teams.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Background in services delivery, including experience designing and scaling cloud-based solutions for enterprise clients.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Experience in client-facing roles, with excellent communication and stakeholder engagement capabilities.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Demonstrated ability to contribute to sales cyclesâ\u0080\u0094providing solution input, influencing outcomes, and driving growth.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Proven success in building service offerings and bringing new solutions to market.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">A leadership style that emphasizes accountability, ownership, and collaboration.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Familiarity with Google Cloud partnerships, certification paths, and ecosystem programs is an asset.</span></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"\">Bachelor's degree in a related discipline or equivalent experience.</span></span></span> </ul> <br>",
      "location": "",
      "country": "Canada",
      "date": "August 06, 2025",
      "referencenumber": "6UXTUTW9S1",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34134/Google%20Cloud%20Practice%20Leader%20%E2%80%93%20Delivery%20Consulting/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Consulting",
      "jobindustries": "Computer Software",
      "senioritylevel": "Director"
    },
    "34124": {
      "id": "34124",
      "title": "Project Managers â\u0080\u0093 Real Property (34124)",
      "company": "Myticas Consulting",
      "description": "<p>Myticas is seeking <strong>intermediate and senior-level Project Managers</strong> with experience in <strong>Real Property</strong> for upcoming federal government initiatives. </p> <p><strong>Overall Responsibilities:</strong><br /> Candidates must demonstrate experience in managing <strong>real property projects</strong>, which may include asset acquisitions, fit-ups, construction, renovations, or remediation of buildings, land, or infrastructure.</p> <p>Tasks include:</p> <ul> <li> <p>Developing and gaining acceptance of project scope, budget, and schedule</p> </li> <li> <p>Implementing communication plans with stakeholders</p> </li> <li> <p>Coordinating multi-stakeholder engagement</p> </li> <li> <p>Managing scope, budget, and schedule changes throughout the project lifecycle</p> </li> <li> <p>Tracking and reporting with:</p> <ul> </ul> </li> <li> <p>Time schedules</p> </li> <li> <p>Work breakdown structures</p> </li> <li> <p>Project scopes</p> </li> <li> <p>Budget forecasts and cash flows</p> </li> <li> <p>Status reports</p> </li> </ul> <p><strong>Mandatory Requirements:</strong></p> <ul> <li> <p><strong>Intermediate Level:</strong> Minimum 3 years of real property project experience in the last 10 years</p> </li> <li> <p><strong>Senior Level:</strong> Minimum 5 years of real property project experience in the last 10 years</p> </li> </ul> <p><strong>Additional Point-Rated Assets:</strong></p> <ul> <li> <p>Experience preparing or leading the creation of:</p> <ul> </ul> </li> <li> <p>Project Charter / Statement of Work</p> </li> <li> <p>Project Management Plan</p> </li> <li> <p>Risk Management Plans / Feasibility Studies</p> </li> <li> <p>Project reporting, commissioning plans, and lessons learned</p> </li> </ul> <ul> <li> <p>Experience managing:</p> <ul> </ul> </li> <li> <p>Multi-disciplinary teams</p> </li> <li> <p>Construction contracts</p> </li> <li> <p>Cost and time control processes</p> </li> <li> <p>Change management protocols</p> <p><strong>Security Clearance:</strong><br /> All candidates must hold an <strong>Enhanced Reliability clearance</strong> (or be eligible).</p> <p><strong>Location Requirements:</strong><br /> Preference for candidates in the <strong>Ottawa region</strong>. Work model (hybrid or on-site) is to be confirmed.</p> </li> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 06, 2025",
      "referencenumber": "ALJ4SC0B2Z",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34124/Project%20Managers%20%E2%80%93%20Real%20Property/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Project Management",
      "jobindustries": "Commercial Real Estate",
      "senioritylevel": "Mid-Senior level"
    },
    "32649": {
      "id": "32649",
      "title": "Ambulatory Clinical Informatics Analyst - Oracle Health Cerner (32649)",
      "company": "Myticas Consulting",
      "description": "<p>Our client is seeking an experienced <strong>Ambulatory Clinical Informatics Analyst</strong> to support the OPOR (One Person One Record) Programâ\u0080\u0099s Ambulatory Portfolio. This role requires a strong background in Oracle Health (Cerner) and will involve collaboration with clinicians, project leadership, and Oracle Health consultants to design, configure, and translate clinical workflows.</p> <p><strong>Key Responsibilities:</strong></p> <ul> <li> <p>Support ambulatory care design and configuration initiatives.</p> <li> <p>Facilitate strategy execution and knowledge translation to subject matter experts (SMEs).</p> <li> <p>Engage with clinicians to review and validate workflows.</p> <li> <p>Participate in organizational change management and co-facilitate design sessions.</p> <li> <p>Collaborate with Oracle Health consultants and internal project teams.</p> <li> <p>Identify risks/issues and contribute to resolution strategies.</p> <li> <p>Provide ongoing updates to OPOR project leadership.</p> </ul> <p><strong>Requirements:</strong></p> <ul> <li> <p>Degree/diploma in a health-related discipline (or equivalent experience).</p> <li> <p>5+ years of experience in a health-related field.</p> <li> <p>2+ years in Clinical Informatics or supporting large-scale CIS implementations (Oracle Health/Cerner strongly preferred).</p> <li> <p>Deep understanding of ambulatory/medicine clinic workflows and interdisciplinary coordination.</p> <li> <p>Familiarity with healthcare terminology, CIS systems, and clinical transformation projects.</p> <li> <p>Ability to influence and collaborate with a range of stakeholders.</p> <li> <p>Excellent communication and documentation skills.</p> <li> <p>Strong problem-solving and process analysis capabilities.</p> </ul> <p><strong>Preferred Qualifications:</strong></p> <ul> <li> <p>Prior knowledge or experience working within the Nova Scotia Health OPOR program.</p> <li> <p>Graphic design/communications experience is a plus.</p> <li> <p>Background in change management or healthcare IT adoption initiatives.</p> </ul> <p><strong>Work Model:</strong></p> <ul> <li> <p>Hybrid role with approximately 70% remote work.</p> <li> <p>Travel across Nova Scotia (up to 30%) as needed.</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 22, 2025",
      "referencenumber": "9192RY3JU6",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/32649/Ambulatory%20Clinical%20Informatics%20Analyst%20-%20Oracle%20Health%20Cerner/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Analyst",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "32658": {
      "id": "32658",
      "title": "Technical Manager, Professional Services (32658)",
      "company": "Myticas Consulting",
      "description": "<p>Our client is seeking a hands-on <strong>Technical Manager</strong> to lead the design, development, and delivery of custom technical solutions across their entire product suite. This role blends technical leadership with project execution, guiding engineers and workflow developers through the successful implementation of enterprise-grade media workflows, systems integrations, and cloud-based solutions.</p> <p>The ideal candidate will have deep technical expertise in cloud infrastructure, software integration, scripting, and solution architecture. They are passionate about translating customer needs into scalable, high-impact solutions while driving engineering excellence through mentorship, best practices, and cross-functional collaboration.</p> <hr> <h3><strong>Core Responsibilities</strong></h3> <ul> <li> <p>Translate customer requirements into actionable technical tasks.</p> <li> <p>Contribute to writing and reviewing Statements of Work (SOW) by providing technical task breakdowns and time estimates.</p> <li> <p>Collaborate with the Commercial Lead to align on project scope, milestones, and sprint planning.</p> <li> <p>Define technical architecture and approaches for workflow implementation.</p> <li> <p>Allocate technical resources and prioritize tasks based on sprint goals.</p> <li> <p>Work with Engineering and DevOps teams to ensure infrastructure, integration, and deployment requirements are met.</p> <li> <p>Review and approve code, enforcing coding standards and best practices.</p> <li> <p>Ensure all technical deliverables meet customer expectations and internal quality standards.</p> <li> <p>Promote best practices in software development and workflow automation.</p> <li> <p>Mentor engineers to foster professional growth and technical excellence.</p> <li> <p>Proactively identify opportunities to improve customer deployments by recommending complementary solutions.</p> <li> <p>Analyze existing customer setups to identify inefficiencies and propose optimizations using the broader product suite.</p> <li> <p>Serve as a technical advisor, helping customers align their needs with the capabilities of our client's platform.</p> </ul> <hr> <h3><strong>Required Qualifications and Skills</strong></h3> <ul> <li> <p>Bachelorâ\u0080\u0099s degree in Computer Science or a related field (or equivalent experience).</p> <li> <p>3+ years of experience in software development or solution engineering.</p> <li> <p>2+ years of experience in technical leadership or a senior engineering role.</p> <li> <p>Proficiency in object-oriented design, API development, scripting (e.g., Python, Bash), and cloud platforms (AWS, Azure, GCP).</p> <li> <p>Familiarity with workflow automation tools and version control systems.</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 24, 2025",
      "referencenumber": "VAZ2ISZECV",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/32658/Technical%20Manager%2C%20Professional%20Services/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "34084": {
      "id": "34084",
      "title": "Cloud Site Reliability Engineer - Azure AWS (34084)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Cloud Site Reliability Engineer â\u0080\u0093 AWS & Azure</strong><br /> <br /> <strong>Overall Responsibilities</strong></p> <ul> <li>Oversee the design and improvement of infrastructure using SRE best practices, including IaC, recovery automation, and systems that detect and resolve issues independently.</li> <li>Manage and fine-tune critical services across both cloud and on-prem environments: Kubernetes clusters, CI/CD pipelines, artifact registries, and custom workloads.</li> <li>Enhance observability through intelligent logging, metrics, tracing, and alerting. Ensuring systems are transparent and actionable in real time.</li> <li>Champion automation by eliminating repetitive tasks, from deployment workflows to security audits, through scripting and tooling.</li> <li>Elevate the developer experience for 80+ engineers and researchers by streamlining secure, reliable workflows across hybrid and cloud-native platforms.</li> <li>Take ownership of IAM governance across platforms like Azure AD and AWS IAM. Implement lifecycle automation, auditing, and access controls.</li> <li>Foster a culture of operational excellence with strong practices around security, incident management, and resilience engineering.</li> <li>Act as a trusted partner to developers and researchers, enabling their speed and innovation without compromising stability.</li> </ul> <p><strong>Experience</strong></p> <ul> <li>Experience in Site Reliability Engineering, DevOps, or Systems Engineering within fast-paced, technically demanding environments.</li> <li>Strong background in Linux systems and cloud infrastructure, with hands-on experience in AWS (primary) and Azure environments.</li> <li>Solid command of Kubernetes and container orchestration in production environments.</li> <li>Expertise in Infrastructure as Code tools such as Ansible, building reproducible, scalable infrastructure is second nature to you.</li> <li>Deep experience in observability and incident response: you know how to set up effective monitoring, handle incidents, and lead blameless post-mortems.</li> <li>A security-first mindset, especially when it comes to protecting distributed systems and developer workflows.</li> <li>Proven ability to support and optimize CI/CD pipelines, container image builds, and artifact lifecycle management.</li> <li>Strong communication and collaboration skills. You build trust across teams and advocate for thoughtful, scalable solutions.</li> <li>Bonus if youâ\u0080\u0099ve worked with event-driven architectures using technologies like Kafka.</li> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 30, 2025",
      "referencenumber": "NX8DQIVZVD",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/34084/Cloud%20Site%20Reliability%20Engineer%20-%20Azure%20AWS/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "32643": {
      "id": "32643",
      "title": "Manufacturing Engineer (32643)",
      "company": "Myticas Consulting",
      "description": "Clover Consulting (a Myticas Co.) has a direct client in Grand Rapids, MI in need of a MANUFACTURING ENGINEER - willing to consider all experience levels - this is a contract role to start, with conversion to perm the goal. <br> <br> <br> Planned 2nd shift hours of 4pm-12pm/1am, to support production.<br> <br> We are hiring Associate to Sr. Manufacturing Engineer to lead and provide ongoing support through our manufacturing life cycle!<br> <br> What You Will Be Doing:<br> With general direction, will lead the introduction of new products into the facility, improve productivity and profitability of existing production procedures, and provide ongoing support through the manufacturing life cycle. Acts as a technical expert in process technology<br> <br> <em>Improvements:</em> Independently, with innovation and creativity, evaluates manufacturing processes to ensure optimal labor and material costs to increase productivity and profitability. Through justifications and evaluations, identifies prime areas for improvement. Tracks expenditures to ensure outlays are within budgeted amounts. Identifies, reduces, and eliminates worker exposure(s) to ergonomic stress(es) in the work place.<br> <br> <em>Floor Support</em>: Provides timely product and process support for any manufacturing area to diagnose problems and implement solutions to minimize interruptions to production.<br> <br> <em>Special Projects</em>: Leads the implementation of significant product, process, or other corporate change initiatives being introduced into the plant.<br> <br> <em>Strategic/Manufacturing Planning:</em> Provides advanced research to introduce/integrate new processes, equipment, and technologies into the company<br> <br> <br> Who You Are:<br> Preferred Skills and Competencies <ul> <li>Very strong analysis skills: process, capacity, cost/benefit, waste stream, and quality tools.</li> <li>Internal and external quality support/management</li> <li>Knowledge in lean manufacturing techniques: flow, PQ, equipment reliability, and set up reduction.</li> <li>Facilitation and negotiation skills</li> <li>Knowledge of material handling</li> <li>Productivity improvement techniques: RCIâ\u0080\u0099s</li> <li>Behavior sciences (logic, sociology, etc.)</li> <li>Economics and financial analysis</li> <li>Work measurement</li> <li>Interpersonal skills</li> <li>Computer skills; advanced level required to utilize Excel and Access programs</li> <li>Experience in design, specification, purchase, and installation of new equipment</li> <li>Experience in the Engineering Design Process</li> <li>Knowledge of simulation, process modeling, and value stream mapping</li> <li>Project management and leadership ability</li> <li>Occupational Bio Mechanics/Human Factors Engineering</li> <li>Strategic planning</li> </ul> <br> Required Skills and Competencies <ul> <li>4 year technical degree or equivalent education</li> </ul> <br>",
      "location": "",
      "country": "United States",
      "date": "July 21, 2025",
      "referencenumber": "9QOEQ8MFIZ",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/32643/Manufacturing%20Engineer/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Electrical/Electronic Manufacturing",
      "senioritylevel": "Mid-Senior level"
    },
    "34075": {
      "id": "34075",
      "title": "Senior Data Warehouse Business Analyst (34075)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\"><strong>Clover Consulting (a Myticas Co.) has a direct client in Springfield, IL in need of a Data Warehouse BA for a REMOTE, long-term contract. Travel to Springfield may be required 2-4 times/year. Qualified candidates please provide resume. <br> <br> Functional Description: </strong></span></span></span><br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">We are seeking a highly motivated Senior Business Analyst to support a large-scale Enterprise Data Warehouse (EDW) project. This role will serve as a critical liaison between business stakeholders and technical teams, ensuring that data warehouse solutions align with business goals. This role involves gathering and translating business requirements into functional specifications, supporting data modeling efforts, and facilitating testing and validation of data warehouse deliverables.</span></span></span><br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\"><strong> </strong></span></span></span><br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\"><strong>Primary Responsibilities </strong></span></span></span> <ul> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Collaborate with business users, data engineers, and BI developers to define and document business and data requirements. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Analyze existing data sources and business processes to identify gaps and opportunities for improvement. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Translate business needs into detailed functional and technical specifications for data warehouse development. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Support the design and implementation of ETL processes, interfaces, data marts, reports, and data analytics. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Work with our testing team to develop and execute test plans to validate data accuracy and integrity. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Facilitate user acceptance testing (UAT) and ensure stakeholder sign-off. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Create and maintain documentation including data dictionaries, process flows, and reporting specifications. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Act as a subject matter expert on data warehouse capabilities and best practices. </span></span></span> <li style=\"margin-top: 0.0in;margin-right: 0.0in;margin-bottom: 12.0pt;margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Support change management and training efforts related to new data solutions. </span></span></span> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\"><strong>Required Qualifications: </strong></span></span></span> <ul> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Bachelorâ\u0080\u0099s degree or higher degree in business intelligence, analytics, computer science, engineering, or related STEM field. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">5+ years of healthcare business analysis experience supporting business initiatives through data analysis, writing business requirements and supporting testing of various systems. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Good understanding of Fee for Service (FFS), Managed Care claim adjudication processes from eligibility and enrollment to claims processing to funding/finance. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Experience working on a Medicaid Enterprise System (MES)/MMIS, or EDW DDI or equivalent. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Proficient in MS Word, MS Excel, MS Project, SharePoint, Teams, and MS PowerPoint. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Be a self-starter and able to thrive in an environment with little guidance. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Excellent interpersonal, oral, and written communication skills. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Ability to effectively communicate findings clearly and concisely in writing and verbally to both technical and non-technical audiences </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Ability to work in a challenging environment with multiple teams and competing priorities </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Experience with facilitating meetings. </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Effective organizational, analytical, time management, problem-solving, and multi-tasking skills </span></span></span> <li style=\"margin: 0.0in 0.0in 0.7pt 0.5pt;\"><span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\">Ability to complete assignments under tight deadlines with little/no direct supervision. </span></span></span> </ul> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Calibri , sans-serif;\"><span style=\"color: black;\"> </span></span></span><br>",
      "location": "",
      "country": "United States",
      "date": "July 29, 2025",
      "referencenumber": "XFSUV417XA",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/34075/Senior%20Data%20Warehouse%20Business%20Analyst/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Analyst",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "32607": {
      "id": "32607",
      "title": "Product Line Manager - CIP (32607)",
      "company": "Myticas Consulting",
      "description": "<p>The recruitment team at Myticas is currently seeking an experienced Optical Networking resource who would be interested in working within the CIP vertical. </p> <p>We are looking for a candidate who is currently based in Canada since this is offered on a remote full-time permanent basis and requires the resource to be located within the country.</p> <p>The candidate in this role should have the following requirements:</p> <ul> <li>Highly experienced in CIP Optical Networking Deployment</li> <li>Over 8 Years of Optical Networking expertise</li> <li>Experience with Optical Network deployment and system development</li> <li>Experience with Optical PLM</li> <li>Experience with Operational Support Systems</li> <li>Experience with Open Standards and Concepts</li> </ul>",
      "location": "",
      "country": "United States",
      "date": "July 14, 2025",
      "referencenumber": "FE2QC6LJLY",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32607/Product%20Line%20Manager%20-%20CIP/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Product Management",
      "jobindustries": "Telecommunications",
      "senioritylevel": "Mid-Senior level"
    },
    "34082": {
      "id": "34082",
      "title": "Legal Analyst Attorney (34082)",
      "company": "Myticas Consulting",
      "description": "Myticas's direct client, based in Minneapolis, MN, is seeking a <strong><span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">Legal Analyst/Attorney with J.D.</span></span></span></span></span></strong> for a hybrid contract position.<br> <br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Job Title:</span></span></strong> <span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">Legal Analyst/Attorney with J.D.</span></span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Work Location:</span></span></strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\"> <strong>Hybrid, 2 days onsite/week <em><u>at either of locations</u> - </em></strong></span></span><strong><em><span style=\"font-size: 11.0pt;\"><span style=\"background-color: white;\"><span style=\"color: black;\">St. Cloud, MN or Minneapolis MN</span></span></span></em></strong></span></span></span><br> <br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Duration:</span></span></strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\"> 6+ month contract-to-Hire</span></span></span></span></span><br> <br> <br> <div style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><u><span style=\"font-size: 11.0pt;\"><span style=\"background-color: yellow;\"><span style=\"color: black;\">NOTE</span></span></span></u></strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">:<strong><u> MUST HAVE,</u></strong></span></span></span></span></div> <ol> <li style=\"font-size: 10.0pt;\"><strong style=\"color: rgb(33,33,33);font-family: Aptos , sans-serif;font-size: 11.0pt;\"><u>Juris Doctor (J.D.) degree</u></strong><span style=\"color: rgb(33,33,33);font-family: Aptos , sans-serif;font-size: 11.0pt;\">.</span> <li><span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">Ability to review documents.</span></span></span></span></span> </ol> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"> </span></span></span><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><span style=\"font-size: 10.0pt;\"> </span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">JOB SUMMARY:</span></span></strong></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">The Legal Invoice Analyst for client, Fulfilment Center of Excellence will be responsible for performing the quality assurance testing for the Legal Bill Analysis Center of Excellence (LBACOE). </span></span></span></span></span><br> <span style=\"font-size: 10.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"color: rgb(33,33,33);\"> </span></span></span> <ul style=\"\"> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: rgb(33,33,33);\"><span style=\"font-size: 11.0pt;\">Understanding of legal terminology and claims legal situations, multijurisdictional exposure preferred.</span> <li style=\"margin: 0.0cm;font-size: 10.0pt;font-family: Aptos , sans-serif;color: rgb(33,33,33);\"><span style=\"font-size: 11.0pt;\">Using sound discretion and legal expertise, analyze and condense legal service agreements to produce effective operational outputs meeting and in some cases exceeding customer expectations.</span> </ul> <br class=\"Apple-interchange-newline\">",
      "location": "",
      "country": "United States",
      "date": "July 30, 2025",
      "referencenumber": "L4LBY4Y9XW",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34082/Legal%20Analyst%20Attorney/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Legal",
      "jobindustries": "Legal Services",
      "senioritylevel": "Mid-Senior level"
    },
    "34096": {
      "id": "34096",
      "title": "AI Scrum Master (34096)",
      "company": "Myticas Consulting",
      "description": "<p>Myticas's direct client is seeking <em><strong>Scrum Master (AI Enablement team) - </strong></em><strong>Hypid</strong> at Waukegan, IL (3 days Onsite / 2 Remote).</p> <p><strong>Duration:</strong> 1 Year Contract (Potential of Extension)</p> <p><strong><u>TOP 5 Skills/Experience:</u></strong></p> <ol> <li>7-10 years of experience as Project Manager / ScrumMaster</li> <li><strong>Experience working with AI in Day-to-Day Work: Leverage AI (Artificial Intelligence) tools to drive innovation, efficiency and decision making.</strong> <li>Expertise of <strong>Agile Facilitation and Scrum Methodologies</strong> <li>Expertise in Jira</li> <li>SharePoint Expertise for Enhanced Collaboration</li> <li>Skilled in Storytelling and Developing Training and Communication Materials </ol> <p><strong>Job Summary</strong></p> <ul> <li>As a Scrum Master within our AI Enablement organization, you will play a crucial role in facilitating agile teams focused on advancing AI initiatives across the enterprise, with a strong emphasis on enhancing AI learning and education.</li> <li>Your responsibilities will include fostering collaboration and driving continuous improvement, while effectively addressing obstacles to ensure the timely and high-quality delivery of AI capabilities and learning solutions.</li> <li>Collaboration is paramount, and you will work cross-functionally with diverse professionals including developers, business stakeholders, technical experts, and leadership to ensure the seamless integration of agile practices.</li> <li>Your pivotal role will champion AI learning, supporting the cultivation of an AI-proficient workforce that can meet future challenges.</li> </ul> <p><strong>Required Experience:</strong></p> <ul> <li>7-10 years of experience as Project Manager / ScrumMaster</li> <li>Mastery of Agile Facilitation and Scrum Methodologies: Guide agile teams to enhance productivity and innovation in delivering impactful AI initiatives. This involves applying Scrum principles to manage workload efficiently.</li> <li>Demonstrated Experience Working with AI in Day-to-Day Work: Leverage AI tools to drive innovation, efficiency and decision making.</li> <li>Expertise in Jira: Use Jira for tracking project progress, managing backlogs and reporting on key project metrics.</li> <li>Strong Organizational and Communication Skills: Maintain effective communication with the team and stakeholders.</li> <li>Facilitate structured organization and time management to handle multiple projects and commitments efficiently.</li> <li>Leading Change Management: lead change management efforts that drive the adoption of AI-driven capabilities organization-wide.</li> <li>SharePoint Expertise for Enhanced Collaboration: Utilize your SharePoint skills to refine site content and design, fostering seamless collaboration and optimal resource management.</li> <li>Skilled in Storytelling and Developing Training and Communication Materials: Harness storytelling to create engaging narratives. Develop compelling, high-quality training and communication materials to ensure effective program delivery.</li> </ul> <p><em><strong>PMP Certification is preferred.</strong></em></p>",
      "location": "",
      "country": "United States",
      "date": "August 04, 2025",
      "referencenumber": "8U6F9LE1MP",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34096/AI%20Scrum%20Master/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Project Management",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "34080": {
      "id": "34080",
      "title": "Employment Equity Resource - Federal Job Evaluation & Pay Equity (34080)",
      "company": "Myticas Consulting",
      "description": "<p>Our client, a leading federal agency, is seeking an <strong>Employment Equity Resource</strong> to support a new project related to federal job evaluation and pay equity compliance. This is a <strong>confirmed contract win,</strong> and we are looking to move quickly to identify a qualified consultant. Must have Enhanced Reliability Security clearance in place. On-Site.</p> <p><strong>Key Responsibilities:</strong></p> <ul> <li> <p>Develop and support job evaluation plans and frameworks to ensure compliance with <strong>Federal Pay Equity legislation</strong></p> <li> <p>Collaborate with pay equity committees and union members to facilitate job evaluation and classification discussions</p> <li> <p>Conduct advanced data analysis on compensation and job structure data</p> <li> <p>Create clear and concise reports and presentations for internal and external stakeholders</p> </ul> <p><strong>Required Skills & Experience:</strong></p> <ul> <li> <p>Experience supporting <strong>federal pay equity compliance and job evaluation</strong> projects</p> <li> <p>Familiarity with working with <strong>pay equity committees and/or union groups</strong></p> <li> <p>Strong analytical skills, with a mix of <strong>qualitative and quantitative analysis</strong></p> <li> <p>Proficient in <strong>Microsoft Excel</strong> (advanced formulas, functions, and interconnected worksheets)</p> <li> <p>Experienced in analyzing <strong>large, complex data sets</strong></p> <li> <p>Ability to develop polished presentations using <strong>Microsoft PowerPoint</strong></p> </ul> <p><strong>Nice to Have:</strong></p> <ul> <li> <p>Previous work within <strong>federal government</strong> job classification systems</p> <li> <p>Bilingual (English/French)</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 29, 2025",
      "referencenumber": "30KKA3HL5A",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/34080/Employment%20Equity%20Resource%20-%20Federal%20Job%20Evaluation%20%26%20Pay%20Equity/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Consulting",
      "jobindustries": "Civic and Social Organization",
      "senioritylevel": "Mid-Senior level"
    },
    "34220": {
      "id": "34220",
      "title": "Application Project Manager (34220)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Location:</strong> Lansing, MI 48933 (Hybrid â\u0080\u0093 Onsite 2 Days/Week)<br /> <strong>Client:</strong> Myticas' Direct Client</p> <hr /> <h3><strong>IMPORTANT NOTE: </strong>This resource will be working on a<strong> project associated with the Federal Government. </strong><strong style=\"font-size:13px\">The individual hired for this position will need to pass a high-level, federal Background and Fingerprint check </strong><span style=\"font-size:13px\">in addition to our standard onboarding requirements.</span></h3> <ul> <li>Accepting local candidates within 2 hrs of Lansing, MI ONLY. Position will be hybrid, in office 2 days a week upon start and there is NO REMOTE ONLY option.</li> </ul> <strong>Top Skills & Years of Experience:</strong> <ul> <li>Strategic project oversight and accountability</li> <li><strong>Large-scale project e</strong>xecution (6+ months, 20+ team members)</li> <li>Budget, scope, and schedule management</li> <li>Executive-level communication and reporting</li> <li>Risk and issue management</li> <li>Long-term release and resource planning</li> <li>Vendor coordination and contract oversight</li> </ul> <br /> <strong>Other Required Skills:</strong> <ul> <li>Leadership and team coordination</li> <li>Strong verbal and written communication</li> <li>Problem-solving and decision-making</li> <li>Adaptability in dynamic environments</li> <li>Relationship-building across diverse stakeholder groups</li> </ul> <br /> <strong>Job Summary:</strong><br /> This role that the resource hired for this role will function mostly as an<strong> Application Project Manager versus an Infrastructure PM.</strong><br /> The ideal candidate will possess strong leadership skills and a basic understanding of<strong> IT Application</strong>/infrastructure <strong>and how the IT components interact via network communications. (Firewall, VIP, F5 Listener, Port, etm.) </strong><br /> â\u0080¢ Possess a basic understanding of IT infrastructure components, including networks, servers, storage, web and virtual/cloud environments.<br /> â\u0080¢ Assist in evaluation of technical requirements and propose solutions that meet business objectives while adhering to SOM best practices and industry standards.<br /> â\u0080¢ This position provides oversight, leadership, accountability, and project management functions for one or more large size, complex projects.<br /> â\u0080¢ These projects typically utilize vendor participation and require complex schedules and integration with other systems. <br /> â\u0080¢ Large sized projects typically have durations longer than 6 months with 20 or more team members, require communication at the Agency Leadership level and have a medium to high risk. <br /> <br /> <strong>This position will:</strong><br /> â\u0080¢ Ensure consistency with the client project management methodology (SUITE), investment management and systems engineering methodology.<br /> â\u0080¢ Perform long-term release planning based on organizational direction.<br /> â\u0080¢ Regularly interact with the project management teams for status of budget, quality, and schedule.<br /> â\u0080¢ Escalate issues and risks as needed to executives and exercise project quality control activities to ensure project scope expectations are met.",
      "location": "",
      "country": "United States",
      "date": "August 08, 2025",
      "referencenumber": "GVIJHWM42K",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34220/Application%20Project%20Manager/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Project Management",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "34226": {
      "id": "34226",
      "title": "Technical Support and Customer Service Associate (34226)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Technical Support and Customer Service Associate â\u0080\u0093 REMOTE</strong></p> <p>Myticas Consulting is seeking a <strong>Bilingual (Spanish/English)</strong> Technical Support and Customer Service Associate to join our clientâ\u0080\u0099s Personal Support Center (PSC) team. This role is ideal for someone passionate about helping others, skilled in troubleshooting, and comfortable in a fast-paced, tech-forward environment.</p> <p><strong>What Youâ\u0080\u0099ll Do:</strong></p> <ul> <li> <p>Provide Tier 1 technical support for software, hardware, and connectivity issues</p> </li> <li> <p>Assist with password resets, software installations, VPN setups, and general troubleshooting</p> </li> <li> <p>Escalate complex issues to senior team members when necessary</p> </li> <li> <p>Maintain clear, professional communication in <strong>both Spanish and English</strong> across all customer interactions</p> </li> <li> <p>Manage support requests via phone, email, and chat simultaneously</p> </li> <li> <p>Accurately log cases in tools like ServiceNow and Zendesk</p> </li> </ul> <p><strong>What Weâ\u0080\u0099re Looking For:</strong></p> <ul> <li> <p><strong>Fluency in Spanish and English (written and spoken)</strong></p> </li> <li> <p>Strong customer service and communication skills</p> </li> <li> <p>Ability to quickly adapt to new tools, systems, and processes</p> </li> <li> <p>Team-oriented with a willingness to learn and grow</p> </li> </ul> <p><strong>Why Join Us:</strong></p> <ul> <li> <p>Hands-on training and mentoring</p> </li> <li> <p>Access to a robust internal knowledge base</p> </li> <li> <p>Opportunities to collaborate with tech experts and leadership</p> </li> <li> <p>A supportive team environment that encourages growth</p> </li> </ul> <p>If youâ\u0080\u0099re ready for a dynamic support role where no two days are the same, apply now or reach out to learn more.</p>",
      "location": "",
      "country": "United States",
      "date": "August 11, 2025",
      "referencenumber": "MQMKTZHLZ8",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/34226/Technical%20Support%20and%20Customer%20Service%20Associate/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Customer Service",
      "jobindustries": "Consumer Services",
      "senioritylevel": "Associate"
    },
    "32632": {
      "id": "32632",
      "title": "Sr Business Systems Analyst (32632)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">Myticas direct client is seeking Business Systems Analyst with QA experience at </span></span></span></span><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Waukegan, IL <strong>(Hybrid-3 days onsite)</strong></span></span></span></span><br> <br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\">Duration: </span></span></strong><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: rgb(33,33,33);\">5 months</span></span></strong><strong><span style=\"font-size: 11.0pt;\"><span style=\"color: black;\"> (with a possibility of extension)</span></span></strong></span></span><br> <br> <span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"\"><span style=\"color: rgb(66,66,66);\">Description</span></span></span></strong></span></span></span><br> <span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\"><span style=\"color: rgb(66,66,66);\">The BSA/QA will play a critical role in bridging the gap between business needs and technology solutions. This individual will work closely with the project team and stakeholders to understand their business requirements and do document them in User Stories to then be developed. The BSA/QA will create test cases for user stories and will execute these tests and clearly documenting results and creating defects where needed.</span></span></span></span></span></span><br> <br> <span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 11.0pt;\"><span style=\"\"><span style=\"color: rgb(66,66,66);\">Key Responsibilities:</span></span></span></strong></span></span></span> <ul> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Collaborate with business stakeholders to gather and document detailed business requirements and functional specifications.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Analyze existing business processes, identify areas for improvement, and evaluate potential solutions to increase efficiency and effectiveness.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Assist in the design and implementation of software solutions that meet the business needs and integrate with existing systems where necessary.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Develop test plans and coordinate testing efforts to ensure that solutions meet business requirements and provide a high level of quality.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Create and maintain comprehensive documentation including process flows, business rules, and user guides.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Work closely with project managers and other team members to ensure timely delivery of project milestones and resolution of any issues that may arise.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Serve as a liaison between the IT department and business units by communicating project status, changes, and potential impacts to stakeholders.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Perform manual testing of software applications to ensure they meet user requirements.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Extensive experience on different types of testing that includes Functional testing, System Integration testing, Regression testing and UAT.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Experience in Agile/Scrum Environments on multiple Projects.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Experience in developing test plans, strategies, and test Scenarios.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Create, execute, and maintain test cases and test scripts. Collaborate with the development team to address and resolve identified issues in a timely manner.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(66,66,66);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\">Expertise in using JIRA for writing the Test Cases and tracking the Defects.</span></span></span></span></span></span> <li class=\"elementtoproof\" style=\"margin-top: 0.0cm;margin-bottom: 0.0cm;margin-right: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"background-color: white;\"><span style=\"color: rgb(33,33,33);\"><span style=\"font-family: Aptos , sans-serif;\"><span style=\"font-size: 11.0pt;\"><span style=\"\"><span style=\"color: rgb(66,66,66);\">Excellent Communication skills-Verbal and written.</span></span></span></span></span></span></span> </ul> <br> <br>",
      "location": "",
      "country": "United States",
      "date": "July 16, 2025",
      "referencenumber": "NI2QSVEXTR",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/32632/Sr%20Business%20Systems%20Analyst/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Analyst",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "34104": {
      "id": "34104",
      "title": "Business Process Reengineering Specialist (34104)",
      "company": "Myticas Consulting",
      "description": "<p><strong>Job Title: </strong>Business Process Reengineering Specialist<br> <strong>Location:</strong> Lansing, MI 48933 (Hybrid â\u0080\u0093 Onsite 2 Days/Week)<br> <strong>Client:</strong> Myticas' Direct Client</p> <hr> <h3><strong>Please NOTE: </strong></h3> <ul> <li>Lansing, MI. Resource will be working a hybrid schedule. NO REMOTE ONLY OPTION. Will need to be onsite from day 1, two days a week (Tuesdays and Wednesdays)</li> <li>Candidate must be authorized to work in the US without VISA sponsorship by the State of Michigan.</li> </ul> <strong>Required Skills/Experience:</strong><br> <strong>Core Competencies (Required)</strong> <ul> <li>5+ Years in Training/Teaching (business/technical concepts)</li> <li>5+ Years as a Business Analyst SME (requirements, processes, documentation)</li> <li>5+ Years in Quality Assurance (testing, validation, defect tracking)</li> <li>5+ Years in Azure DevOps (epics, features, user stories, backlog management)</li> <li>5+ Years understanding BA, QA, and DEV roles/responsibilities in SDLC</li> <li>5+ Years in as-is/to-be process mapping and content creation (SOPs, workflows)</li> <li>5+ Years in business process analysis, translating requirements into technical specs</li> <li>5+ Years in system testing (functional, regression, UAT)</li> <li>5+ Years documenting user stories & acceptance criteria</li> <li>5+ Years developing & maintaining technical documentation (BRDs, FRDs, manuals)</li> </ul> <strong>Additional Experience (Required)</strong> <ul> <li>3+ Years creating product roadmaps (prioritization, stakeholder alignment)</li> <li>3+ Years with <strong>Agile/Project Management methodologies</strong> (Scrum, Kanban, Waterfall) <li>3+ Years adept with tools (Figma, Visio, JIRA, Confluence)</li> </ul> <strong>Key Soft Skills</strong> <ul> <li>Strong analytical & problem-solving abilities (strategic and creative thinking)</li> <li>Excellent communication (technical & non-technical stakeholders)</li> </ul> <br> <strong>Preferred Skills (Nice-to-Have):</strong> <ul> <li>Experience in <strong>UI/UX prototyping </strong>(Figma, Balsamiq) <li>Familiarity with CI/CD pipelines</li> <li>Knowledge of SQL/data analysis</li> <li>Exposure to Power BI/Tableau for reporting</li> </ul> <ul> </ul>",
      "location": "",
      "country": "United States",
      "date": "August 05, 2025",
      "referencenumber": "EDN0K8NSHD",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34104/Business%20Process%20Reengineering%20Specialist/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Consulting",
      "jobindustries": "Information Technology and Services",
      "senioritylevel": "Mid-Senior level"
    },
    "34146": {
      "id": "34146",
      "title": "IT Business Analyst (34146)",
      "company": "Myticas Consulting",
      "description": "<p><strong>IT Business Analyst</strong></p> <p>We are seeking a highly motivated and self-driven individual to work in a complex and thriving global IT environment in support of the Toronto site, one of the largest vaccine research and development and manufacturing sites in the world. This role will report to the Digital Shop Floor Tools Lead and will be supporting all on-site manufacturing IT systems.</p> <p> </p> <p><strong>Location:</strong> North York ON (<strong>onsite 5 days a week</strong>)</p> <p><strong>Type:</strong> Contract</p> <p><strong>Duration:</strong> 12 months, long term contract renews every 1 year</p> <p><strong>Pay:</strong> $40 to $48 per hour CAD; $30-40 USD</p> <p> </p> <p><strong>Skills Required: </strong>The candidates<strong> must possess</strong> the following skills and this experience must be displayed on their resume: These are essential for seamless collaboration across different departments encompassing diverse skillsets and expertise, such as Digital, Operations, Automation, and Quality. </p> <ul> <li>Must have WHMIS certification.</li> <li>Must have a university degree in Computer Science, Engineering, or related discipline, or an equivalent combination of education and experience.</li> <li>Must have 2-6 years of providing in-person support of physical shop floor hardware/workstations (e.g. printers, scanners, WiFi bridges, ThinClient devices, peripherals) in a manufacturing environment. These systems include the manufacturing execution system, data historian system, interfaces for integrated lab equipment, and related physical hardware/workstations.</li> <li>Must have 2-6 years Business Analyst and support experience with computerized systems such as manufacturing execution systems, data historian systems, automation and control systems.</li> <li>Good understanding of IT Software Development Life Cycle (SLDC) and Project Management Methodologies.</li> <li>Must be able to supply their own PPE. Requires CSA certified steel toe boots. If there is a need to enter a live construction area (as we have projects where the facilities are being renovated) there are additional PPE requirements such as safety helmet, safety glasses, and gloves.</li> <li>The candidate for this role is expected to enter our manufacturing areas from time to time to provide on-the-floor support. As they will be entering live areas they may be exposed to Pertussis, Diphtheria, Tetanus and Flu. They will need to be vaccinated for these to enter those areas.</li> </ul> <p> </p> <p><strong>Skills Preferred:</strong></p> <ul> <li>Knowledge and awareness of regulatory standards requirements from FDA and Health Canada particularly GXP, 21 CFR Part 11, Electronic Records and Electronic Signatures, Data Integrity Requirements and ALCOA applied to IT Systems would be an asset.</li> <li>Experience with computer systems validation in pharmaceutical industry.</li> <li>Ability to manage relationships with external vendors.</li> </ul> <p> </p> <p>As an IT Business Analyst, you will play a crucial role in supporting on-site manufacturing IT systems from technical troubleshooting perspective as well as systems and process improvement perspective.</p> <ul> <li>Natural curiosity and passion for technology, ability to quickly learn manufacturing processes, and strong organizational and time-management skills.</li> <li>Excellent problem-solving and decision-making abilities, effective communication skills (technical writing, verbal, and presentation)</li> <li>Self-driven with a passion for taking ownership for their work with the ability to prioritize and execute tasks from initiation to closure and a proven track record of successful independent work and self-sufficiency.</li> </ul> <p> </p> <p><strong>Responsibilities:</strong></p> <ul> <li>Take ownership of manufacturing IT system issues from inception to resolution, collaborating closely with users and support teams to troubleshoot and resolve.</li> <li>Escalate and coordinate with local infrastructure team, global support teams and vendor if required to provide timely support and resolution to various system issues.</li> <li>Draft and maintain documentation in alignment with GxP and company processes as required by deviations / change controls, including but not limited to architecture specifications, installation procedures, and detailed specification documents.</li> <li>Provide in-person support of physical shop floor hardware/workstations (e.g. printers, scanners, WiFi bridges, ThinClient devices, peripherals).</li> <li>Participate in on-call support for addressing system emergencies outside of regular business hours.</li> <li>Drive system and process improvements to improve user experience and/or reduce required support and troubleshooting effort.</li> </ul> <p> </p> <p><strong>Location/Scope:</strong></p> <ul> <li>The job site is in Toronto, ON, Canada. Consistent <strong><u>on-site presence</u></strong> is mandatory for this role to facilitate troubleshooting and relationship management. <li>This role may occasionally require after-hours support availability to address system emergencies as the manufacturing facilities operate on a 24/7 basis. Overtime hours must be agreed with management.</li> <li>Due to the nature of the job (production floor support) up to date vaccination and WHMIS certification is required.</li> </ul>",
      "location": "",
      "country": "Canada",
      "date": "August 07, 2025",
      "referencenumber": "M8E6AWSON5",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/34146/IT%20Business%20Analyst/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Analyst",
      "jobindustries": "Biotechnology",
      "senioritylevel": "Mid-Senior level"
    },
    "32581": {
      "id": "32581",
      "title": "Technical Support and Customer Service Associate (32581)",
      "company": "Myticas Consulting",
      "description": "<strong>Technical Support and Customer Service Associate </strong><strong>- REMOTE<br> <br> Contract: 12 months with possible CTH</strong><br> <strong>Schedule: 3rd shift - 12 am to 9 am, Tuesday thru Saturday<br> Work Type: Fully Remote</strong><br> <br> Myticas is actively seeking a <strong>Technical Support and </strong><strong>Customer Service Associate </strong>for a direct client to join their <strong>Personal Support Center (PSC)</strong> team. This role is perfect for someone with a passion for helping others, a knack for troubleshooting, and the ability to thrive in a fast-paced, tech-forward environment.<br> <br> As a PSC Associate, youâ\u0080\u0099ll be the first point of contact for users via phone, email, and chatâ\u0080\u0094working to resolve technical issues, answer questions, and ensure a seamless customer experience. You'll be supported by extensive training, a detailed knowledge base, and a collaborative team ready to help you grow.<br> <br> <strong>What Youâ\u0080\u0099ll Do:</strong> <ul> <li>Provide Tier 1 technical support for software, hardware, and connectivity issues</li> <li>Assist with password resets, software installations, VPN setups, and general troubleshooting</li> <li>Escalate complex issues to senior team members when needed</li> <li>Maintain clear, professional communication across all customer interactions</li> <li>Simultaneously manage support requests via phone, email, and chat</li> <li>Accurately log cases using tools like ServiceNow and Zendesk</li> </ul> <strong>What Weâ\u0080\u0099re Looking For:</strong> <ul> <li>Strong customer service and communication skills</li> <li>Comfort working in a flexible, 24/7/365 support environment</li> <li>Ability to adapt to new tools, systems, and processes quickly</li> <li>Team player whoâ\u0080\u0099s open to ongoing feedback, learning, and development</li> </ul> <strong>Why Join Us:</strong> <ul> <li>Hands-on training and mentoring</li> <li>Access to a robust internal knowledge base</li> <li>Opportunities to collaborate with tech experts and leadership</li> <li>A supportive team environment where growth is encouraged</li> </ul> If you're ready to jump into a dynamic support role where no two days are the same, apply now or reach out to learn more. Weâ\u0080\u0099re excited to meet you!",
      "location": "",
      "country": "United States",
      "date": "June 30, 2025",
      "referencenumber": "LAW0DOADQG",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32581/Technical%20Support%20and%20Customer%20Service%20Associate/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Customer Service",
      "jobindustries": "Consumer Services",
      "senioritylevel": "Associate"
    },
    "32575": {
      "id": "32575",
      "title": "Full Stack Developer - .Net, Angular, JavaScript (32575)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">POSITION OVERVIEW</span></strong><br> <br> Looking for a <strong><span style=\"\">Senior .NET Full Stack Developer</span></strong> to support the architecture and development of critical application features. The ideal candidate is a well-rounded developer who enjoys both front-end and back-end work, and thrives in collaborative, agile, and remote-first teams.</span></span><br> <br> <br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">CORE QUALIFICATIONS</span></strong></span></span> <ul> <li>5+ years of experience in full-stack development delivering scalable, production-ready solutions</li> <li>Strong knowledge of:<br> â\u0080¢ C#, ASP.NET MVC<br> â\u0080¢ Entity Framework and SQL Server<br> â\u0080¢ JavaScript, HTML5, CSS <li>Solid understanding of software architecture principles, design patterns, and clean coding standards</li> <li>Hands-on experience with Git and modern source control practices</li> <li>Bachelorâ\u0080\u0099s in Computer Science or equivalent practical experience</li> <li>Must be authorized to work in the U.S.</li> <li>Open to limited travel (2â\u0080\u00934 times annually) for team collaboration</li> </ul> <br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"\">PREFERRED EXPERIENCE / NICE TO HAVE</span></strong></span></span> <ul> <li>Experience with modern .NET (.NET Core / .NET 6+)</li> <li>Familiarity with Microsoft Azure and DevOps tools</li> <li>Understanding of containerization (Docker, Linux containers)</li> <li>Proficiency with RESTful API development</li> <li>Exposure to cloud-based services (Azure preferred, AWS acceptable)</li> <li>Experience with modern front-end frameworks like React, Angular, or Vue.js</li> <li>Knowledge of CI/CD tools such as Azure DevOps, GitHub Actions, or Jenkins</li> <li>Test-driven development (TDD) and experience with testing frameworks (xUnit, MSTest, NUnit, Jest, Mocha)</li> <li>Security/authentication protocols (OAuth2, OpenID Connect, IdentityServer)</li> <li>Event-driven architecture and messaging systems (e.g., RabbitMQ, Azure Service Bus, Kafka)</li> </ul>",
      "location": "",
      "country": "Canada",
      "date": "June 25, 2025",
      "referencenumber": "8AAK4KZZ8B",
      "remotetype": "Remote",
      "url": "https://apply.myticas.com/32575/Full%20Stack%20Developer%20-%20.Net%2C%20Angular%2C%20JavaScript/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Information Technology",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "32647": {
      "id": "32647",
      "title": "Senior Manager, Radio System Engineering (32647)",
      "company": "Myticas Consulting",
      "description": "<p>As the Senior Manager of Radio System Engineering, you will lead all technical aspects of radio system architecture, including air interface definition, concept of operations, functional specifications, and physical implementation of RF functions.</p> <hr> <p><strong>Main Responsibilities:</strong></p> <ul> <li> <p>Provide expert-level leadership in RF system development, including trade-offs involving ACP, PAR, out-of-band emissions, pass-band ripple, group delay, and more.</p> <li> <p>Support the finalization of radio system implementation involving agile multi-beam phased array antennas and beam hopping technology.</p> <li> <p>Define operational concepts for all phases of the system lifecycle such as user terminal commissioning, network entry, satellite handovers, time synchronization, and adaptive coding and modulation (ACM).</p> <li> <p>Act as the principal architect for defining air interfaces between user terminals, ground infrastructure, and satellite payloads.</p> <li> <p>Collaborate with RF, antenna, system, and terminal engineers to partition functionality between hardware and software components.</p> <li> <p>Provide input to the system modeling team on design assumptions and strategies for modeling link performance, accounting for impairments across system components.</p> <li> <p>Work closely with the Verification and Test team to ensure thorough validation of requirements and system performance.</p> <li> <p>Participate in relevant industry standards forums (e.g., DVB) and provide strategic recommendations to align internal systems with evolving standards.</p> </ul> <hr> <p><strong>Education & Experience â\u0080\u0093 Required:</strong></p> <ul> <li> <p>Bachelorâ\u0080\u0099s degree in Electrical, Computer, or Systems Engineering.</p> <li> <p>15+ years of experience in RF communications systems and/or RF equipment development.</p> <li> <p>Demonstrated experience taking RF systems from concept through iterative design, specification development, and low-rate production.</p> <li> <p>Strong background in system architecture, requirements management, and performance assessment for communication systems.</p> </ul> <hr> <p><strong>Education & Experience â\u0080\u0093 Assets:</strong></p> <ul> <li> <p>Familiarity with DVB standards such as DVB-S2X and DVB-RCS2.</p> <li> <p>Solid understanding of digital communications, spread spectrum techniques, single and multi-carrier modulation (e.g., PSK, APSK, QAM).</p> <li> <p>Proficiency in MATLAB or equivalent tools for modeling and analyzing RF communication systems.</p> <li> <p>Deep knowledge of RF passive and active components and microwave frequency performance, including the effects of environmental factors such as rain fade.</p> <li> <p>Strong foundation in RF transceiver architecture and digital communication theory.</p> <li> <p>Excellent communication skills, with the ability to effectively engage stakeholders across engineering, management, and external partners.</p> <li> <p>Collaborative, adaptable, and capable of leading multidisciplinary teams in high-performance environments.</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 21, 2025",
      "referencenumber": "NQ6025EGSN",
      "remotetype": "Onsite",
      "url": "https://apply.myticas.com/32647/Senior%20Manager%2C%20Radio%20System%20Engineering/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Engineering",
      "jobindustries": "Telecommunications",
      "senioritylevel": "Mid-Senior level"
    },
    "34103": {
      "id": "34103",
      "title": "IT Business Analyst â\u0080\u0093 SharePoint & RFP Consultant (34103)",
      "company": "Myticas Consulting",
      "description": "<span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>IT Business Analyst â\u0080\u0093 SharePoint & RFP Consultant (Contract)</strong></span></span><br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 13.5pt;\">Location:</span></strong></span></span><br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Ottawa, ON â\u0080\u0093 <strong>Hybrid (3 days on-site/week preferred, 1 day remote possible)</strong></span></span><br> <br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 13.5pt;\">Overview:</span></strong></span></span><br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Our client is seeking a highly skilled <strong>IT Business Analyst â\u0080\u0093 SharePoint & RFP Consultant</strong> to support the development of a formal Request for Proposal (RFP) for a SharePoint Online implementation. This consultant will serve as the subject matter expert in SharePoint functionality, working closely with senior stakeholders, procurement specialists, and cross-functional teams to define project requirements and ensure an RFP that aligns with strategic goals and compliance standards.</span></span><br> <br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 13.5pt;\">Key Responsibilities:</span></strong></span></span><br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>RFP Development</strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Lead the creation of a clear, structured RFP outlining:</span></span> <ul style=\"list-style-type: circle;\"> </ul><li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Project objectives</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Scope</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Functional and technical requirements</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Timelines, challenges, and budget estimates</span></span> </ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Ensure training requirements are included for administrators, IT staff, and end users</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Collaborate with the procurement team to integrate our clientâ\u0080\u0099s terms, controls, schedules, and workflows</span></span> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>Requirements Gathering & Stakeholder Engagement</strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Review existing documentation (e.g., risk assessments, third-party reports, executive briefings)</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Facilitate and document stakeholder interviews with Directors, VPs, and SMEs across departments including:</span></span> <ul style=\"list-style-type: circle;\"> </ul><li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Operations, Security, IT, Communications, Major Projects, Finance</span></span> </ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Define and validate project scope, specifying inclusions/exclusions</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Ensure consistent communication and consensus across all internal groups</span></span> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>SharePoint Capabilities Alignment</strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Translate SharePoint Online capabilities into functional business requirements</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Assess and prioritize features to be included in the RFP:</span></span> <ul style=\"list-style-type: circle;\"> </ul><li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Intelligent Intranet & Digital Workplace</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Document Management</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Workflow Automation</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Microsoft 365 Integration</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Governance & Compliance</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Secure External Collaboration</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Analytics & Continuous Improvement</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Low-Code/No-Code Development</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Change Enablement</span></span> </ul> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>Evaluation & Compliance</strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Partner with procurement to define evaluation criteria for vendor selection</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Ensure all RFP elements are aligned with procurement policies and regulatory guidelines</span></span> </ul> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>Quality Assurance</strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Review and refine all RFP content for clarity, accuracy, and professionalism</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Support finalization of the RFP alongside the Director and Procurement team</span></span> </ul> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong>Additional Duties</strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Act as a convenor, bringing stakeholders and ideas together to drive consensus</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Perform related tasks necessary to support successful delivery of the RFP</span></span> </ul> <br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 13.5pt;\">Required Qualifications:</span></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">7+ years of experience in IT Business Analysis, preferably in the public or government sector</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Proven <strong>functional SharePoint Online experience</strong></span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Demonstrated expertise in <strong>RFP development</strong>, especially for IT or platform implementations</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Experience working with internal procurement teams and stakeholder groups</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Strong facilitation, interviewing, and consensus-building skills</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Excellent communication and documentation capabilities</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Ability to manage ambiguity and guide teams through early-stage requirement gathering</span></span> </ul> <br> <span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"><strong><span style=\"font-size: 13.5pt;\">Nice to Have:</span></strong></span></span> <ul> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Prior experience supporting RFPs involving digital workplace or intranet transformation</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Familiarity with Microsoft 365 integration projects</span></span> <li style=\"margin: 0.0cm;\"><span style=\"font-size: 12.0pt;\"><span style=\"font-family: Aptos , sans-serif;\">Understanding of compliance, governance, and security in public sector IT environments</span></span> </ul> <br> <span style=\"font-size: 11.0pt;\"><span style=\"font-family: Aptos , sans-serif;\"> </span></span><br> <br>",
      "location": "",
      "country": "Canada",
      "date": "August 05, 2025",
      "referencenumber": "SVJGVSUZDP",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/34103/IT%20Business%20Analyst%20%E2%80%93%20SharePoint%20%26%20RFP%20Consultant/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Analyst",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    },
    "32657": {
      "id": "32657",
      "title": "Technical Manager Customer Support (32657)",
      "company": "Myticas Consulting",
      "description": "<p>Our client is seeking a highly motivated and experienced Technical Support Manager to lead a team of skilled Technical Support Engineers in delivering world-class customer support. This individual will be responsible for managing daily support operations, coaching and mentoring team members, driving operational excellence, and fostering a customer-first culture focused on satisfaction, retention, and long-term success.</p> <p>The ideal candidate will have a strong background in technical support operations, experience with networking or SaaS platforms, and a genuine passion for solving customer issues with empathy and urgency.</p> <h3>Core Responsibilities</h3> <ul> <li> <p>Lead, inspire, and develop a team of Technical Support Engineers to deepen product knowledge, elevate support standards, and encourage professional growth.</p> <li> <p>Oversee daily operations of the support organization, ensuring key performance indicators (KPIs)â\u0080\u0094including customer satisfaction, response time, and resolution rateâ\u0080\u0094are consistently met or exceeded.</p> <li> <p>Serve as the primary escalation point for complex or high-priority technical issues, ensuring timely and effective resolution.</p> <li> <p>Analyze support metrics, service-level agreements (SLAs), and customer feedback to identify trends and implement scalable improvements that enhance team efficiency and service quality.</p> <li> <p>Evaluate and adopt new tools and technologies that improve productivity and the overall customer support experience.</p> <li> <p>Foster employee development and retention through regular coaching, mentoring, and opportunities for continuous learning.</p> <li> <p>Drive consistency in support processes by promoting best practices, standardizing workflows, and maintaining high-quality documentation.</p> <li> <p>Collaborate with cross-functional teams, including Product, Engineering, and Customer Success, to address systemic issues and advocate for long-term product improvements.</p> <li> <p>Lead customer-facing support reviews and Quarterly Business Reviews (QBRs) to discuss issue trends, resolutions, and opportunities for service enhancements.</p> <li> <p>Translate technical feedback and customer pain points into actionable improvements for product development and documentation.</p> </ul> <h3>Required Qualifications and Skills</h3> <ul> <li> <p>7+ years of experience in technical support or customer success, including managing technical escalations.</p> <li> <p>Proven success leading support teams in fast-paced, high-growth environments.</p> <li> <p>Strong analytical, organizational, and problem-solving abilities.</p> <li> <p>Excellent communication and interpersonal skills, with the ability to engage both technical and non-technical stakeholders.</p> <li> <p>Solid understanding of networking concepts and tools used for troubleshooting network-related issues.</p> <li> <p>Bachelorâ\u0080\u0099s degree in Computer Science, Information Technology, or a related technical field (or equivalent professional experience).</p> <li> <p>Ability to prioritize and manage multiple initiatives in a high-pressure environment.</p> <li> <p>Demonstrated ability to proactively identify risks and implement effective mitigation strategies.</p> </ul>",
      "location": "",
      "country": "Canada",
      "date": "July 24, 2025",
      "referencenumber": "J0G3I5JY8L",
      "remotetype": "Hybrid",
      "url": "https://apply.myticas.com/32657/Technical%20Manager%20Customer%20Support/?source=LinkedIn",
      "salary": "",
      "jobfunction": "Customer Service",
      "jobindustries": "Computer Software",
      "senioritylevel": "Mid-Senior level"
    }
  }
}